[">- What?", "- Uh, nothing.", "I'm gonna go over to there now.", "Jake, what's going on? Why is Amy's hair like that?", "- Oh, she obsessively braids her hair when she's nervous,", "and she's super nervous 'cause she's taking", "the sergeant's exam today.", "- But Amy loves tests.", "- Not this one. - It's always been her plan", "to be the youngest captain in the history of the NYPD,", "but if she doesn't pass this exam,", "she's gonna have to wait another three years to take it again,", "and that'll disrupt her entire life calendar.", "- Is that a real thing?", "- It hangs over our bed.", "- So she's stress-braiding. - Big deal.", "That's like a one on the Santiago Panic Scale.", "- Yeah, but we've also jumped up to level two,", "creepily singing songs", "from the Great American Songbook.", "- * You're a grand old flag", "* You're a high flying flag", "- So, yeah, it's a little tough right now,", "but I think the worst is behind us.", "- Why are you taking so long to cook my frickin' oatmeal?", "- Yeah... oh.", "- She'll be okay.", "- Hey, babe.", "Oh!", "I see you've taken the braids out.", "Your hair looks fun.", "- Now it's ready for me to braid again.", "- Okay. Ames, I don't want you to take this the wrong way,", "but you gotta calm the \"F train\" down.", "You're going to ace this test.", "- You think that because you love me,", "and love has made you dumb.", "- I disagree, if anything, love has made me smarter.", "Remember last week when I boiled that egg?", "- That was big. - I was really proud of you.", "- Yes, and... - Hold onto your crazy-ass hair...", "Because I'm about to prove to you that you have", "nothing to worry about. Follow me.", "Practice test.", "You ace it, you relax,", "you nail the real one, you become a sergeant,", "you make grateful love to me for 14 hours straight.", "- Jake... - Fine, one hour.", "15 minutes. Eight.", "Three but they're mind-blowing.", "- I told you a million times...", "- You don't really want more than three.", "- No, practice exams are worthless.", "The testing conditions are way too pristine.", "There's nothing to distract you. I mean, look around.", "A child could pass the frickin' MCAT in here.", "I knew you would say that,", "which is why I've asked these officers...", "to do their paperwork in here while you take the test.", "He writes way too loudly. She's always yawning.", "He has a gross cold.", "IBS, IBS.", "She has a weird arm-stretching thing.", "IBS, IBS, and Hitchcock and Scully", "with two hours worth of potato chips.", "- Oh, my God, it's gonna be crinkle-city.", "- Jake said we get to eat with our mouths open.", "What a day!", "- Babe, take the practice test. - Then you'll know you're ready.", "- Okay. - See you in two hours.", "- Sir, a witness just came in with her child.", "While she was being interviewed, I took the kid to the soft room,", "and the toy situation in there is kind of bleak.", "- Is this your opinion or the child's opinion?", "- It's mine. - Trick question.", "Any opinion about toys is a child's opinion.", "- All we have in there are toys from the movie \"Kazaam,\"", "and none of 'em are even Kazaam.", "I have an extra graphing calculator", "I could leave in there for the children.", "- Um, I was thinking we could liven things up in there.", "Maybe add a model train?", "I used to love 'em when I was a kid.", "- I was also a model train enthusiast as a child.", "Those miniature tracks provided me", "with some of my happiest memories.", "All aboard!", "The train will be departing in 45 minutes.", "I like this idea, Jeffords.", "I'll help you build the train set.", "- Sweet! - This'll be fun!", "- I hope not.", "It's trains.", "- Gina, as you know,", "Great Nana Boyle recently passed.", "- Yes, I watched the live stream of the plug-pulling ceremony.", "- Anyway, they executed her will.", "- Guess what she left me? - No.", "- Her silk bed sheets.", "They were very special to her. She insisted on dying in them.", "Don't get jealous. She left you something too.", "- Oh, that's so nice of her.", "And it's a big jar of brown sludge", "that smells like death.", "- Oh, you got the mother dough!", "- Ugh! - Did this come out of her?", "Charles, how grossed out should I be right now?", "- No, that's the Boyle family sourdough starter.", "It's fed us for 140 years.", "The bread it births is succulent and firm... tang for days.", "- I hate so many of the words you just used.", "Charles, if it's so great, why would she give it to me?", "I barely knew her.", "- You know what, she probably got you confused", "with my cousin Tina. He was always her favorite.", "- Tina is a boy's name?", "- Yeah, short for Christina. - Mm.", "- You're right, it's pretty gross.", "You don't bake bread. Let me take it off your hands.", "- Oh, Charles.", "Charles, Charles, Charles.", "You already showed your cards, baby boy.", "You know how badly you want this,", "so you're gonna have to pay for it.", "- Gina, please.", "- No, I'll take $10,000.", "- What? - Are you out of your mind?", "- Probably. - You don't even want that.", "You said it smelled like death.", "- I thought it did, but now...", "Smells like opportunity.", "- Ugh. - Oh, God,", "it really does smell bad. My eyes hurt.", "- Ahh.", "- What are you looking all wistful about?", "- Just thinking, about relationships and love,", "and how I'm way better at them than I thought I'd be.", "Should I do a TED Talk on it?", "- Doesn't seem any dumber than all the other TED Talks.", "- I mean, Amy was a wreck and I fixed her.", "The weird thing is, I love her so much,", "I don't even feel like bragging about it.", "- Clearly. - You get it.", "- All right, two things. - One, we're out of chips.", "- How? - You skimped us.", "And two, Amy left and asked me to give you this note.", "What's she say? She go out to get us more chips?", "- No, the practice test freaked her out.", "She's not taking the sergeant's exam.", "Damn it!", "- Amy's not in the break room. - Or the evidence room.", "- Or the ladies' bathroom.", "You know what? I'll check again.", "- I've never seen him walk with such purpose.", "What a wretched man.", "- I can't believe this is happening.", "I didn't think there was any way", "she could fail the practice test.", "- Well, we still have three hours until the exam.", "- First we gotta figure out where she is.", "All right, think. If you were Amy,", "where would you be right now?", "- Oh, uh, boring pantsuit store.", "A crossword factory?", "A museum of retainers and headgear?", "Is it possible to enter the color beige?", "- All right.", "Ooh, I know, I can call her from Sarge's phone.", "There's no way she'll turn down a call from a superior officer.", "Everybody shush!", "It's ringing, I can hear her phone.", "She's still in the building.", "She's still in the room!", "She's in...", "her desk drawer!", "Nope. It's just her purse.", "Phone must be in the purse. That makes more sense.", "- Phone, wallet, keys.", "She didn't take anything with her.", "- That means she's still close. - Let's go!", "Duty Sergeant said she exited this way, and...", "she's not here. Damn it!", "- Stop thinking about her like she's your girlfriend.", "What would you do if she was a perp?", "- I guess role play,", "try and see the world through her eyes.", "Oh, no, what if I see my reflection", "and fall in love with myself?", "- Jake, we have a literal ticking clock situation here.", "- Roger that. - Okay, fine, I'll be Amy.", "Just know everything I'm about to say, I say with love.", "Okay. I'm outside.", "It's 78 degrees and yet somehow I'm still cold.", "Better walk on the sunny side of the street.", "Wait, did I remember to put on sunscreen?", "Pause to think, pause to think.", "Yes, I did put on sunscreen,", "and I bragged about it all morning.", "Amy's on the move. And I'm walking,", "I'm walking.", "- GP40 Diesel locomotive with sprung drive wheels,", "rule 17 lighting, and full underbody detailing.", "You're gonna be the belle of the ball.", "- Terry is your god.", "All hail Lord Terry, giver of life.", "\"All hail Lord Terry.\"", "Check out Jeffords Junction.", "It's got a ice cream shop, a '50s diner,", "and a Mexican restaurant with a sombrero on it.", "- What happens to the sombrero when it rains?", "I see no drains. Does it just fill up with water", "until the building collapses, killing everyone inside?", "It never rains at Jeffords Junction.", "- So you achieved this level of lushness", "through irrigation alone?", "- I don't know.", "I'm just trying to build a fun world.", "That's what model trains are all about: imagination.", "- No, they're about accuracy.", "People like to see the world around them", "exactly as it is, but smaller.", "- Okay, well, we can have part of the model be", "very accurate and part of it will be creative.", "I'm okay with that.", "- Yes, yes, as am I.", "Would you fetch me the 8 millimeter level", "from my office?", "- Oh, sure.", "- Oops.", "- Gina! I just want to say, I am disgusted by you.", "You somehow lucked your way into a family heirloom,", "and have the gall to ask me to give you $10,000 for it?", "That's an absurd amount of money!", "Took me all morning to get it together!", "- Oh, I thought you were telling me off.", "- And what would that get me? - Pride?", "You can't make bread with pride.", "- Well, unfortunately, I've changed my mind.", "I want to keep the mother dough. I'm gonna start baking.", "- I see what you're doing. - You're trying to up the price.", "Well, shame on you.", "But also, here you go.", "An extra $2,000.", "You won't get one cent more...", "after this.", "- Charles, get your chicken leg off my desk.", "I don't want your money, Boyle.", "- What's going on? - Nothing,", "I just realized that I just love old, sour bread so much!", "- Come on, Gina. - Fine!", "I put it under my desk", "and my space heater burnt it to a crisp.", "You're a murderer!", "- Listen, you gotta get over it.", "It was just some old bread batter.", "It had black spots in it.", "- Those are sour spores!", "That's where the tang comes from.", "That's tang town.", "- I'm walking.", "I'm walking and I'm seeing a paper supply store.", "I wonder if they have those new summer folders?", "- Whoa, you're good. - I've definitely heard her", "talk about those folders.", "- That's because they have such a fun color scheme,", "perfect for vacation organization.", "- This is chilling.", "Darn it to heck.", "The store is closed.", "My bad day just got a whole heck of a lot worse.", "Time to go... smoke in secret.", "And as I'm shame-smoking, I'm seeing...", "The library.", "- Captain, did you throw away my sombrero restaurant?", "- Oh, I might have knocked it in the bin by accident.", "I do remember saying, \"Oops.\"", "Fine, I'll come clean.", "You're ruining our model with your frivolous garbage.", "- We're building this for kids!", "You really think they're gonna enjoy", "your brown rectangle of dirt with one little house?", "- Excuse me, this is an accurate facsimile", "of a mid-sized switching yard.", "And it isn't a \"little house.\"", "It's a work shed where the yardmen get", "their OSHA-mandated eight hours of rest between shifts.", "So, yeah, I think the kids are gonna love it.", "- Okay, we have a witness coming in at 3:00 with her son.", "Let's split this train set in two,", "make our own models, and see which one he likes more.", "- You're on.", "- You don't stand a chance.", "I'm gonna turn Jeffords Junction", "into the funnest town in America.", "That's right, I said \"funnest.\"", "- Stop dancing.", "Stop dancing.", "This is a direct order.", "Stop...", "dancing.", "- Of course I know Amy Santiago.", "She was here earlier.", "She used my phone to call a car service.", "- But she doesn't have her wallet.", "How's she gonna pay for that?", "- We have a joint account at Brooklyn Town Cars.", "I can call them, and they'll tell me", "where they dropped her off.", "- She got out here. - I don't know where she went.", "- That's it? - You didn't watch her?", "You didn't follow her with your eyes?", "- No, that would be creepy.", "- Well, next time, do the city a favor", "and creep it up a little, bud!", "Let's think, where did she go next?", "Let's mix it up. This time, you play Amy.", "- She's in that building right there.", "- Aww, you didn't do the voice.", "- That's the Department of Records,", "where her best and only friend Kylie works.", "- Ah ha! - \"Noice.\"", "- She signed in 20 minutes ago.", "- Yet another great opportunity for the voice.", "Amy's not here.", "- Don't give up, babe, you'll find me.", "- Not now, Rosa.", "- Okay, so Amy's test is in an hour", "and we have no idea where she is.", "I'm spiraling. Somebody say something positive.", "- I cannot believe you screwed this up for her.", "- I was kind of hoping for something", "more traditionally positive,", "as opposed to overtly negative.", "- And I was hoping you wouldn't lose my best friend.", "- Starting to feel like you're not a real big Jake head.", "- Oh, no, I like him, just not as a boyfriend for Amy.", "Or as a trivia teammate.", "- Okay, Kylie, you have gotta get over the trivia thing.", "I tried my hardest!", "The phrase you're looking for is,", "\"Winter is coming.\"", "- No, what Paul Revere said was that the British are coming.", "- Come on. - Yeah, come on.", "So what, Paul Revere never said \"winter is coming?\"", "Not even in late autumn? I still think I was right.", "- Can we please get back to Amy?", "She signed in downstairs 20 minutes ago,", "but she didn't come here, so where is she?", "- Well, this is the Department of Records,", "so I'm going to make an educated guess", "and say she came here for a record.", "- Ooh, not sure you're qualified to make an educated guess.", "- Okay, I know where you're going with this,", "the Theory of Relativity question.", "Uh, he's got crazy hair, super smart, Jewy name.", "Eisenberg! Jesse Eisenberg.", "- Sit down!", "- Look, I know lots of things.", "I know the names of every Transformer.", "Yeah, even the Dinobots. Grimlock much?", "- No. - Okay.", "I'm not dumb, I just can't handle the trivia pressure.", "Anyway, can you please just look up every file", "that's been logged out in the past 20 minutes?", "- Fine, but I'm doing it for her, not for you.", "- Fine.", "Trivia Nazi over here.", "- Yeah, there was a 99th precinct case file", "from January, 2014, that was just accessed.", "- Okay, I definitely know where she is.", "- Like you definitely knew the Serengeti was", "a type of pasta?", "- Let it go, Kylie!", "- Mount Terry's looking good, just add a little snow,", "and... perfect.", "- Ah, yes. - Now, that's what I call", "the right amount of arid shrubbery.", "- Great job, Captain.", "That's just what the kid's gonna want,", "to play in a serial killer's dumping ground.", "All aboard the Jeffords Victory Express!", "- Oh, I'm sure the child will love that you put", "a steam locomotive whistle on a diesel train.", "I'm joking... he's going to vomit when he hears that.", "- Kid's here. - Show him in.", "- This is Dylan.", "- Hello, Dylan. - I'm Captain Holt.", "We have some trains here to play with,", "like this one that carries coal and rivets,", "the two main exports of our town.", "Would you like to transport some coal or rivets?", "- Or... would you like to come over here to Jeffords Junction,", "where it's always all four seasons and a volcano?", "- Do you have guys have any video games?", "- Okay, I see what's happening here.", "You're afraid that you're gonna make Sergeant Jeffords feel bad.", "Don't worry, he's a subordinate.", "- No, just... - Trains are kinda lame", "and nobody plays with them.", "- Okay, but surely one of these trains", "is less lame than the other, right?", "- No, they look exactly the same to me.", "- Get out.", "- Gina.", "I just got an email from the council of cousins.", "Tina Boyle is contesting the will.", "- So? - So he's coming here", "right now with an officer of the court.", "The mother dough is to be placed in protective custody", "until the matter is resolved.", "- Yeah, it's resolved. - I cooked it.", "- Don't you understand what will happen if they find out?", "Gina, they will banish you from the family.", "No more Boyle activities.", "No Christmas cards, no Thanksgiving cards,", "no Valentine's cards.", "That's right, imagine a Valentine's Day", "with no cards from your cousins.", "- Oh, my God. - This is a dream come true.", "You think I can get out of all the family vacations too?", "Because let's be honest, Charles,", "Aruba was the worst thing that's ever happened.", "How do all 18 of you", "have sleep apnea?", "- Listen, we have to do something.", "Maybe if we put the dough in the box, they won't check.", "- Won't check what?", "- Christina! - How are you?", "Great jacket. Where'd you get it?", "- You know, I got it at Mervyn's.", "Where's my mother dough?", "- Yeah, about that. - Um, it's an interesting story,", "what happened with that thing, because...", "- Yeah, it is interesting.", "- I killed her. - No!", "- I killed her dead. - No, she didn't.", "- Put her by a space heater till she was burnt up", "- to a black lump of coal. - No, shh.", "- Oh, my God.", "- Yeah, that's right, she gone.", "- First of all, Gina, I love you.", "Secondly, you're banished from the family.", "Oh, no!", "May I still please be on the Boyle daily email blast?", "- Please? - I'm afraid not.", "You'll just get the weekly blasts,", "like the rest of our acquaintances.", "- It was an accident, she didn't mean it.", "- I'm sorry it had to end this way.", "Charles, I love you.", "- I love you too.", "- But you brought Gina into this family,", "and you're also banished.", "What?", "- Oh, there you are, thank God.", "- Hey. - How'd you find me?", "- January 14th, 2014.", "Detectives Peralta and Santiago conducted surveillance", "from a rooftop at 397 Barton Street.", "This is where we came the night I won our bet", "and you fell in love with me.", "- Jake. - The night that you flirted", "with me for 20 seconds and I became", "obsessed with you forever.", "Ready?", "- I'm sorry I freaked out and ran away.", "- It's okay.", "Just because you messed up the practice test", "doesn't mean you're gonna fail the real one.", "- I didn't mess it up. - I got 102%.", "I found a spelling error in one question.", "I gave myself extra credit.", "- Then why'd you leave?", "- Because that was the first time it really hit me.", "When I pass the exam, I'll actually be a sergeant.", "And... what if everything changes between us?", "- That's why you came here?", "- Yeah.", "Things are so good right now.", "I don't want to screw that up", "by getting transferred or becoming your boss.", "- Ames, I've always known you were gonna be my boss.", "I mean, this is your dream, from before we were dating.", "And yeah, things might change a little,", "but for the better, right?", "We can finally get premium cable,", "check out all those shows on EPIX.", "- Look, you can't be afraid to be successful.", "You're too good for that.", "- I love you.", "- I love you too.", "Wait! The test.", "- We gotta get you outta here. - Right.", "- I'm gonna be a sergeant. - You're gonna be a sergeant!", "You don't have a key", "for this random roof door, do you?", "- Come on. - Come on!", "Oh, no!", "I broke the hotel key I forgot was in my wallet", "for the last five years.", "- Where's Rosa? - We can't wait for her.", "The exam's in 20 minutes.", "- It's my fault we're up here.", "I just won't take the test.", "I'll wait three years for the next one.", "- Oh, no, you won't.", "- No. - Jake,", "you are not Die-Harding off this roof.", "- I am definitely Die-Harding off this roof,", "for you and only for you, and also for me", "'cause I've always wanted to do it.", "Jake, come on, get down from there.", "It's too dangerous.", "- It's perfectly safe.", "See you in hell, kiddo.", "- What?", "- Yippee ki-yay!", "Bars, bars, bars!", "- Oh! - Are there bars on the window?", "- Yeah, there bars on the window.", "- I just set up a video game system.", "The kid's much happier.", "Turns out children don't care about model trains.", "- Not only children.", "I'm beginning to think nobody does.", "Kevin, you are not gonna believe this.", "Terry put Lo-V IRT Pullman rolling stock", "on a ballastless track.", "I was dying, Kevin, dying.", "Yes, you can hang up now.", "I guess we're condemned...", "to a life of solo railroading.", "- We don't have to be.", "I know we've had our differences,", "but through some crazy twist of fate we found each other.", "Shouldn't we just be excited", "that we have someone to share that with?", "- Not interested. - Good day.", "- Okay. - Well, I just wanted to show you", "I got a tiny little train inspector.", "It's to make sure the tracks were up to code.", "I'll be going.", "- Wait.", "You left your figurine behind for some reason.", "Take it.", "Wait.", "Come on, Sergeant, take the train through the pass.", "- All aboard the Terryliner.", "Next stop, Holtsovania.", "- Where are you guys?", "What the hell is taking you so long?", "Did Jake Die-Hard off the roof?", "- Yeah. - But the windows have bars.", "- Yeah, we all know about the bars, Rosa!", "- All right, you get to the exam,", "I'll take care of Jake.", "- Yeah, don't worry about me.", "The important thing is, you go become a sergeant.", "Leave me! I know it's gonna be hard", "to walk away, but you have to be strong!", "- She left like two minutes ago. - You're talking to nobody.", "- Yeah, that makes sense.", "- This is when the Boyles went to that farm", "and we all got hoof and mouth disease.", "Ah, when we went to that water park,", "and we all got hoof and mouth disease again.", "- That was a good vacation.", "- Sam, Tina, what are you doing here?", "- Gina called us.", "- What? - Why?", "- Because I wanted to show you this.", "It's a new mother dough.", "Now, I know it's not 140 years old,", "but I will feed it, and I will nurture it,", "and it will grow, and eventually it'll be", "just as sour and smelly as the old one.", "- What about the tang?", "- It will be tang town. - Tang town.", "- Now can you just let Charles back into the family, please?", "- How will we get to this new mother dough?", "- You can all come by my apartment", "and take a little piece whenever you want.", "- We'll need keys. - Why?", "- In case you're not home, or in the bath.", "- Gina, it's okay, you don't have to do this.", "- Yes, I do, because you're my brother.", "Isn't she great? We used to have sex, you know.", "Cool.", "- You don't have to mention that every time, you idiot.", "- Hey.", "- Hey! - That looks like the strut", "of a lady who just crushed an exam.", "- I sure did, and finished 45 minutes early.", "- Oh, nice, did everyone else give you dirty looks?", "- So dirty.", "How long were you hanging off the roof for?", "- Long enough for me to take a bunch of pics.", "- Ah-ha, very funny. - No \"soc.\"", "Listen.", "I just want to thank you guys", "for chasing me down and getting me here.", "I know it's been a rough day, Jake,", "but I think I know how to make it up to you.", "Three minutes?", "- Oh, no, not that. - Even better.", "- Okay, welcome to trivia night.", "- You said you would never bring him again.", "- Don't worry, it's gonna be fine,", "- I promise. - Is it?", "- Tonight's first category, by special request,", "the \"Transformers\" movies.", "- Yes!", "- Question one. - What is the name", "of the evil race of Transformers?", "- The robot... bad robot. - Oh, God, I don't know.", "- Damn it, Jake! - I'm sorry,", "I can't take the trivia \"presh\"!", "Why couldn't you have just given me the three minutes?", "- Not a doctor. - Shh."]