[">Ladies and gentlemen, we are gathered here today", "to answer and age-old question.", "Right, what's Amy's deal? She single?", "No, we're dating. Come on.", "The question is:", "Who here does the best impression", "of Captain Raymond Holt?", "You'll be judged on voice,", "body language, and overall lack of flair.", "Everyone will perform the same scenario:", "Captain Holt eating a marshmallow", "for the very first time.", "Let the Holt-off begin!", "What is this glutinous monstrosity before me?", "The sugar in this is quite sweet.", "Ooh, mm-hmm, mm-hmm-hmm-hmm!", "That's your Holt impression?", "I can hear him doing that.", "Looks like a sticky pillow.", "I don't care for it. Classical music.", "[laughter]", "What's going on here? What are you doing?", "Captain, hey, nothing, just eating some marshmallows.", "Care for one?", "Marshed-mallow.", "Hmm. Hmm-hmm-hmm-hmm! [laughing]", "I knew it!", "Sync &amp; corrections by Rafael UPD www.addic7ed.com/", "♪ ♪", "That concludes our briefing.", "And now, on a personal note,", "I have some thoughts about Beyoncé's \"Lemonade\"", "- I'd like to share. - Oh, my God, sir,", "as much as I want to hear those thoughts,", "and it is so, so much, I think we should", "probably let Amy speak.", "Oh, Santiago, the floor is yours.", "Thank you. Okay, here's everyone's", "itineraries for Thanksgiving at my place.", "I know a lot of your families are out of town,", "and you just want to relax, but I think we'll all enjoy", "ourselves more if we rigidly stick to the schedule.", "Whoa, did you assign us individual bathroom break times?", "Keep asking questions about it, Sarge,", "and your slot is after Scully's.", "All right, Santiago, damn.", "It's your toilet.", "Sorry, it's just that", "my dad is coming into town, and he can be a little uptight.", "Uh-oh, Santiago's calling someone uptight.", "That can't be good.", "He's not crazy. He's just the kind of guy", "who arranges the money in his wallet", "according to serial number.", "Yeah. That kind of guy.", "Boyle, are you set on the turkey?", "This year's bird will be as moist as...", "- Nope. - As juicy as...", "- Nope. - As wet as you can...", "Boyle, just say it'll be good, man.", "It'll be good, man.", "Well, I gotta go start getting ready.", "Don't be late or I'll slit your throats.", "[laughs]", "You don't have to fake laugh. We know you mean it.", "Good.", "So, meeting Amy's dad for the first time, huh?", "- You nervous? - Yeah, a little.", "- I was talking to Jake. - No, Sarge, I am not nervous.", "I'm confident that I'll make a great first impression", "on Mr. Victor Santiago.", "Why'd you do it with a British accent?", "I felt like doing the Cuban accent", "would be a little dicey for me.", "- Very good call. - Yeah.", "My advice: don't be overconfident.", "The first time I met Kevin's parents,", "I called Brahm's \"Funf Gesange\"", "opus 106 when it is, obviously, opus 104.", "They haven't spoken to me since.", "Really? Just for that?", "Yes... also because they're huge homophobes", "who think that I made Kevin gay with my magic genitalia.", "That's super sad, but I do like hearing you say", "the word \"genitalia.\"", "Well, I am ready for this.", "I pulled a full Amy and researched the crap out of him.", "Made this sweet binder.", "Just a couple of factoids about Victor:", "He's an ex-cop, 65 years old,", "married for 36 years, Cuban, his favorite food...", "Flavor First beefy dog food.", "Wait, no, sorry.", "That's his dog's favorite food.", "His favorite food is...", "corn.", "Makes more sense. Dog food's not in the name.", "I know everything about him, therefore I know exactly", "the type of person I need to be in order for him to think", "- I'm good enough for Amy. - No, Jake, you're fine.", "Just flash him your baby browns,", "he'll love it. Just be yourself.", "Be myself? Charles, I have one day", "to win over Amy's dad. How long did it take", "before you guys started liking me?", "- Couple weeks. - Six months.", "- Jury's still out. - See, Charles?", "\"Be myself,\" what kind of garbage advice is that?", "I hope you're not telling Nikolaj that crap.", "- [correcting] - Nikolaj.", "Ugh.", "[classical music playing]", "Okay, we're running out of time.", "What do you guys like better: classic bishop hat fold", "or crown fold? Now, the crown is more showy,", "but the bishop hat has a certain dignity.", "I'll kill myself if it's not the crown fold.", "Oh, okay, thanks.", "Sometimes you have to pretend to care about napkins", "to stop hearing about napkins.", "Sorry I'm late, guys.", "Had to get my ax sharpened.", "Why do you have an ax? Also, nice ax.", "Thank you. It's for the turkey,", "so I can chop its head off when it gets here.", "- Chop its head off? - I ordered a live turkey.", "It's being delivered. Because you know what they say:", "The yummiest turkey is the one that just died in your hands.", "Charles, you can't kill an animal in here.", "That's horrible. It's disgusting.", "We won't let you do it, right, Amy?", "It's getting late. Don't make a mess.", "Relax. It's not the first turkey", "I've killed in a friend's bathtub.", "It isn't?", "And now back to the Lexington Thanksgiving Day Dog Show.", "Oh, look at her. Sloping, clean-cut,", "forequarters, cocksure gait.", "She's majestic,", "and she knows it.", "- Pimento's here. - Ah, Adrian.", "So you made it. Happy Thanksgiving.", "Is it?", "Something wrong?", "Feel no pressure to talk about it.", "Brass says I can't rejoin the force.", "Some crap about you can't just disappear from your job", "for seven months, blah, blah, blah, blah, blah.", "Oh, well, that's unfortunate.", "I know how much being a cop meant to you.", "I don't know what I'm gonna do.", "I guess I could be a teacher.", "\"Sorry, Travis, the answer's", "\"obviously Istanbul. What did you say to me?", "\"No, maybe you're wasting your life.", "\"Sorry, Principal Ramos, I didn't see you there.", "\"Wait, Travis is your son? Hah, well, I guess you're", "\"just gonna have to fire me. Fired? Me? How dare you, sir.", "We will settle...\" See, it just wouldn't work.", "Hmm. You know, I had a friend", "that had to retire from the force.", "He became a private investigator.", "Ooh, PI, huh?", "- Mm. - I like that.", "[laughs] \"Hello, Mr. Branville,", "\"I found out where your wife's been going tonight.", "\"Have a seat, you're not gonna like this.", "\"She's cheating on you.", "\"What do you mean you knew that already?", "\"You killed her?", "\"And are framing me for the murder?", "\"I just left my prints all over the crime scene.", "Oh, you are an evil ge...\"", "This... this I could get on board for.", "- Hmm. - Only problem is,", "PI license is like, two grand.", "I could lend you the money.", "Think of it as an investment", "from someone who believes in you.", "Wow, thanks, Captain. That means every...", "Whoa, hang on, you carry a check book with you?", "'Course, you never know when you're gonna need groceries.", "So cool.", "- [beeping] - Where are you?", "Picking up Amy's dad at the airport.", "Ooh, that's a strong move.", "Have you successfully changed everything", "about yourself as planned?", "Oh, yeah, you wouldn't recognize me.", "I'm wearing a sweater, I bought new shoes,", "I put something on my face called \"moisturizer.\"", "- It's amazing. - Did you clean your car?", "I did, but it didn't really take,", "so I just rented a new one, but here's the best part:", "I printed out a sign especially for him using", "his favorite font, Garamond.", "Who has a favorite font?", "The Santiagos do. All of them.", "Oh, here he comes. Gotta go, bye.", "Hey, Mr. Santiago.", "I am Jake Peralta, Amy's boyfriend.", "Jake, nice to finally meet you.", "- You too. - Ah, look at that.", "You're a Garamond man, huh?", "Of course, what other font would I use, Cambria?", "[laughter]", "Amy said you were a crack up, but I had no idea.", "- Oh, it's working. - What?", "Excuse me? Shall we?", "- Let me get your bag. - Sure.", "The two hunks have arrived.", "Hi.", "So glad to have you here, Dad.", "Happy to be here, tiger.", "- How was your flight? - Oh, good, good, you know,", "- I did \"The Times\" crossword. - Oh, great puzzle to do, right?", "- Oh, my God, 17 down? - Oh, I know,", "- what about 16 across? - What about 34 across?", "Oh, what about 45 down?", "Both: What about 20 across?", "[laughter]", "- I also did it. - Yeah.", "So Jake and I had a great conversation on the way here.", "You didn't tell me he was so interested in mutual funds.", "Uh...", "Yeah, ugh, Amy is so bored of hearing me", "talk about allocation, asset mix, attribution analysis.", "These are just terms I throw around all the time.", "In alphabetical order.", "Well, that's just how my brain works.", "I mean, how would you list financial terms,", "in random order? What are you, crazy?", "He's got a point. I like this guy.", "[laughs] Yeah.", "Oh! Captain Holt.", "This is my dad.", "Captain, heard a lot about you.", "And I you.", "Do you mind passing me those crab puffs?", "Oh, certainly. There you go.", "Thank you.", "Yeah.", "That was everything.", "Yeah, pretty big night:", "the three most important men in your life under one roof.", "Well, Will Shorts isn't here.", "Oh. Burn on Holt... probably.", "That's the one you were talking about.", "The Cairn Terrier is intelligent and inquisitive", "with a bold personality.", "[chuckles] \"A bold personality.\"", "We know what that's code for:", "you're the bitch.", "Pimento is back. How's the dog show going?", "Well, it's not without its drama.", "Whoever groomed the Irish Setter might want to think about", "blowing his brains out.", "Yeah, yeah, yeah, how's that Wire Fox Terrier?", "- Still in the lead? - In the lead?", "- I doubt she even wins her group. - What?", "Oh, no, no, no, no, no, no, don't say that!", "What? She's not gonna win?", "Ooh, I bet the check you gave me on the Wire Fox Terrier to win.", "Why would you do that?", "That money was to help you get a PI license.", "Yeah, but I wanted to pay you back fast.", "You made it sound like the terrier was a sure thing.", "You said she was majestic.", "They're all majestic.", "This is a nationally-televised dog show.", "This is the big time.", "Listen, mister, I didn't give you that money", "so you could throw it away. I want it back.", "We're gonna pay your bookie a visit.", "- What? - And so help me God,", "you better hope I don't miss the \"in memoriam.\"", "If it's dead dogs you wanna see,", "I know where to get my hands on dozens of them.", "All right, choo-choo!", "Here comes the veggie train, leaving the station.", "Next stop, a healthy body.", "Terry has kids. Just carrots for me.", "I don't eat celery, hate the stuff.", "Oh, that's funny. Me too.", "Really? Get out of town.", "Even though everybody says...", "both: They're basically the same thing.", "[chuckling]", "I'm gonna go get a refill. Do you want something?", "Oh, uh, you know, if they have it,", "maybe, like, a dry Riesling?", "- Excellent choice. - Thank you.", "They definitely have it. I brought it.", "Wow, you are really pulling this off.", "I know, all this research is actually gonna work.", "Should I prepare for things all the time?", "- Yeah. - Nah, that's crazy.", "Look, I can't believe you memorized", "that whole, huge binder.", "Oh, I didn't. I brought it with me", "and hid it out on the stoop.", "So do you have a favorite watchmaker?", "I do, but I actually have to run to the bathroom real quick.", "[seedy music]", "Watches...", "Gotcha.", "I guess if I had to pick one watch,", "it would be NOMOS Glashutte.", "It's a German company based in Saxony.", "Speaking of which, I think I just dropped", "a bit of a Glashutte in the baño.", "Steer clear.", "The only downside is, I've told him I have to pee", "so much he thinks I have a UTI.", "I wonder if he's ever had a UTI.", "You know what, I'm gonna sneak outside", "and get the 411 on the UTI. BRB.", "He loves abbreviations.", "♪ ♪", "Hey, Jake. You looking for this?", "What? Oh, no.", "Boyle, your turkey's here.", "All right, let's do this.", "Pretty cool, huh?", "I feel like Dexter. I think.", "I never actually saw the show.", "Billboard gave me nightmares.", "Charles, are you crazy?", "No, I don't want to watch a living animal die", "and then consume its flesh.", "How is this different than eating a turkey", "that's been killed in a factory?", "Because I don't have to see that.", "It's called living in denial, you moron.", "Gina, I know it seems cruel, but it's a swift death.", "One painless chop removes the head.", "I mean, that doesn't sound so bad.", "And then its decapitated corpse only flops around", "for, like, half an hour.", "You know what? You won't be able to", "go through with this if I give this little guy a name.", "He's now Nikolaj.", "[gasps] That's my son's name.", "Go ahead, cut Nikolaj's throat.", "Sorry, Gina, but we need a turkey,", "and you're the only one complaining.", "I don't like it either. It's not a fair fight.", "Give the bird a gun, then see what happens.", "Sarge, this must bother you too.", "Yeah, but eating a big drumstick on Thanksgiving", "makes Terry feel like a king.", "Sorry, but it's five against two.", "Wait, you assume Hitchcock and I want to eat that turkey?", "- Yeah...? - Thank you.", "Charles, do what you need to do.", "Copy that.", "Uh-uh, no, hold up.", "- Rosa, get the bird. - On it.", "I'll stand here and sacrifice my life to Charles's bloodlust.", "I'm not gonna kill you, Gina.", "Huh, then you already lost.", "No, where are you going?", "Hey, you can run, but you can't hide.", "The apartment will run red with the blood of Nikolaj.", "Please stop calling him that.", "So, uh, what are you doing out here?", "Sneaking a cigarette. I just can't quit.", "But you knew that, didn't you? Page 136.", "What is that strange book you're holding?", "I've never seen it before.", "\"Jake Peralta's Guide to Tricking Amy's Dad.\"", "What? Who put that there?", "Why did I use a title page?", "Relax, Jake, it's okay. Actually, I'm quite impressed.", "- You are? - Yeah, you did a ton", "of research here. You made a binder.", "This is real Santiago stuff.", "Yeah, I-I guess it is. I even used tabs.", "- The good ones. - Yes.", "There are good and bad types of tabs.", "- That's something we all know. - I can't believe", "you did all this. You've got my family tree,", "all of my case files, lot of photos.", "Yes, and might I add,", "your ponytail in the 90s puts Amy's to shame.", "They used to call me \"The Lion.\"", "Wow, cool nickname.", "They call me \"The Barracuda.\"", "Well, I call me that. I'm hoping it catches on.", "I was wondering what you thought about", "one of my cases...", "First Essex Bank Heist.", "Yes, I read that one.", "They got robbed the day before their grand opening.", "I never solved that one.", "That bothered me for 20 years.", "But I see that you wrote a note here that says,", "\"Contractor did it, so obvious.\"", "Oh, what?", "Well, you know us millennials,", "we're always exaggerating.", "But what I think happened there is,", "is that I was reading that file, and I noticed", "that the contractor, Russo, was the, um...", "- Obvious? - Obvious suspect, but only", "in the sense that he was the only one who could've", "possibly done it 'cause he had the blueprint.", "I talked to Russo. He had an alibi.", "Of course, of course.", "But, you know, the name of the company was \"Russo and Sons,\"", "so... I figure probably, maybe, definitely the sons did it.", "Maybe. Probably. For sure.", "Sons? Oh, my God, the sons.", "I think you might be on to something.", "- Really? - I don't know", "how I missed that.", "I bet they still live here in New York.", "We should go talk to them right now.", "I mean, if that would be okay.", "\"Okay,\" are you kidding me?", "I would love to work a case with you.", "That's amazing.", "Looks like The Lion is gonna roar again.", "And the Barracuda is gonna...", "What?", "[fluttering]", "Anyway, you get it, let's go.", "[knocking]", "Your bookie lives in a college dorm?", "He's a freshman. They don't let them", "live off-campus first year. Doi.", "Hey, Adrian, come on in. Happy Thanksgiving, man.", "Can it, Alan.", "Listen, I need the money back,", "and I need it back now.", "Aw, geez, I'm sorry.", "I can't do that. I placed the bet online.", "It's not like I can cancel it.", "You just placed the bet online?", "Yeah. He could've done it himself.", "It's really easy.", "I kept telling him there's no need for bookies anymore.", "No, no, no, I don't mess with computers, okay?", "Ever since I died of dysentery on the Oregon Trail, I was like,", "no thank you. I'm done with this.", "Okay, look, the money's already in the Caribbean.", "There's nothing I can do.", "Looks like we're going", "to the Caribbean.", "[imitates guitar riff]", "You do know we're not going to the Caribbean, right?", "I didn't know that. That is a bummer.", "[grunts] Come on, guys.", "It's getting late. Open the door.", "Not until you promise to let this little turkey", "live out the rest of his life with Rosa.", "What? Why can't it live with you?", "I'm an ideas man.", "All right, that's it. You've left me no choice.", "[exciting music]", "There we go.", "Thanks.", "Now give us the bird.", "Gladly. Whoop, whoop...", "Not that bird.", "Don't take another step.", "This ends now.", "I am so sorry, girl.", "Great party, but uh-uh.", "All right, here it is.", "Be free, noble bird.", "Be free, fly away. Fly to freedom.", "Gina, turkeys can't fly.", "- [\"Jaws\" theme] - [gasps]", "Why is he looking at me like that?", "[chattering]", "Nobody make any sudden moves.", "Yeah, and those talons are super sharp, huh?", "That thing's a freaking dinosaur.", "[all screaming]", "[dramatic music]", "[thud] [turkey squawks]", "So, where were you the day the bank was robbed?", "I don't understand, Dad. What's going on?", "- Well, honey, this man... - The Barracuda.", "Wants to talk to me about something that happened", "20 years ago, and as I said to that man...", "The Lion. [hisses]", "20 years ago, I was in Pittsburgh", "at a softball tournament.", "Oh, Pittsburgh, interesting.", "Home of the Bengals.", "Home of the Steelers.", "No, this is the home of the stealers.", "I set you up perfectly for that.", "While you were busy establishing an alibi,", "your sons were back in Brooklyn robbing the bank.", "But we were at the softball tournament too.", "Oh, convenient you say that now when you have no proof.", "Didn't you guys bring back a trophy?", "A trophy's not really proof.", "We also have a framed photograph of the team,", "a videotape of the whole event, 39 eye-witnesses,", "a newspaper article about it,", "and security footage from the gas stations", "we stopped at on the way to and from Pittsburgh.", "Okay, I gotta say, it seems a little weird", "you're so prepared for these questions.", "No, it's not.", "My brother and I had to gather all that information", "20 years ago when we got accused of", "the exact same stuff by him.", "Say what now?", "Captain, you seem upset.", "Are you mad at me about something?", "Yes, obviously. I gave you $2,000,", "and you threw it away.", "Ugh, I knew that was it. Stupid, Adrian, stupid!", "- And it's not just the money. - I know... you believed in me.", "And I took that belief, and I just dumped all over it.", "Wait, Adrian, an SMS text alert.", "Just pulled my pants down and squatted all...", "Adrian, be quiet.", "The beagle's been eliminated.", "Our dog is in the top three!", "[wheezing]", "Put the dog show on, at once.", "The game's on.", "Put on the dog show, Hank!", "It's in overtime.", "So what was that? You set me up?", "You already knew they had an alibi.", "Of course I did. I guess", "I guess you must have missed that fact", "when you were putting together", "your sloppy, lazy, garbage binder.", "What? I thought you loved my binder.", "You said I used all the good tabs.", "Those tabs weren't even cascading.", "Okay. Oh, I see.", "I think I know what's happening here.", "You're upset because Amy and I have seen each other's butts.", "- What? - Oh, God, it wasn't that.", "Please forget I said anything about your daughter's butt.", "You know why I don't like you, Jake?", "'Cause of my binder, apparently.", "No.", "Because of my binder.", "What, you think I wouldn't do my own research,", "find out everything I could", "about whoever my daughter is dating?", "Okay, fine, but it's not like you found anything bad about me.", "I mean, look at this credit score: 100.", "- Out of 850. - Oh, no, really?", "This binder tells the story of a sloppy, disorganized,", "irresponsible individual", "who's not allowed within 500 feet of Taylor Swift.", "That was a misunderstanding.", "You're not good enough for my Amy.", "I don't want my only daughter dating a screw-up.", "Oh, yeah? Well, I don't want", "my only girlfriend daughtering a jerk-dad.", "Burn on you.", "- [phone buzzing] - It's Amy.", "Can I answer it? Am I good enough", "to have a conversation with her?", "Honestly, no.", "Well, I don't care. I'm doing it anyway.", "Hello, lover. How's that butt?", "What? Are you with my dad?", "I sure am, and you're on speaker phone.", "So feel free to tell me all about your sexuality", "and the intercourse we might have together, getting it in.", "I was just calling to tell you there's a turkey", "loose in the apartment, but somehow that's not", "the weirdest part of this phone call.", "What's going on?", "Oh, nothing. Just had a real eye-opening", "conversation with your dad.", "I wanted his approval, but he says", "I'll never be good enough for you.", "- What the hell? - I know, right?", "- Tell him he's wrong. - No, I'm upset with you.", "That's right, go get 'em, tiger.", "I'm also upset with you. What is this, 1950?", "I can't date someone unless I have my father's approval?", "- Oh, obviously you can... - You guys act like this is", "your decision to make, like, the woman doesn't even exist", "in this equation. Well, this woman...", "- Wait, Amy, shut up. - Excuse me?", "I mean, I'm so sorry, you were making a totally", "valid point about gender equality, but I just thought", "of something really important so I'm gonna hang up on you, okay?", "Love you, bye.", "It wasn't Russo or his sons.", "Both: It was the daughter!", "[dramatic music] [chattering]", "All right, someone's gotta go out there", "and kill that feathery bastard.", "Rosa, you're always looking for an excuse to behead something.", "Don't look at me.", "Terry wastes all that time building muscles,", "- make him do it. - Oh, come on, you all know", "these are just for show. Gina's the one who set him free.", "How was I supposed to know there'd be consequences", "- for my actions? - Enough.", "I started this.", "I'm gonna end it.", "[intense music]", "♪ ♪", "It's turkey time.", "[toothbrush buzzing]", "♪ ♪", "[turkey squawks]", "This is it, the final lap.", "Bichon Frise dismissed.", "We're the top two, just us and that stupid", "freaking schnauzer.", "Come on, Wire Fox Terrier. Come on, baby.", "Shh, shh, shh, shh. The judge has made his decision.", "Shut up!", "Hold my hand, Captain. Hold my hand.", "And Best in Show goes to the Wire Fox Terrier.", "[yelling and exclaiming]", "- I'm gonna live forever! - Whoo!", "[tense music]", "Charles? It's been quiet for a while.", "Everything okay?", "I was gonna chop the heck out of this bastard,", "but then he looked me in the eye,", "and I realized that nature is beautiful.", "He scratched you up real bad, didn't he?", "Yep, he got me good.", "[all exclaiming]", "It's okay. Once I started", "giving him gouda, he showed me mercy.", "So we're not eating the turkey then?", "Obviously not.", "Hello, everyone.", "Guess who just solved a 20-year-old unsolvable case?", "Wait, what?", "You guys figured out who pulled the First Essex Bank job?", "Yep. We realized", "we never checked the daughter's alibi.", "She wasn't at the softball trip, she had access to the plans,", "and then she just confessed.", "That's right. We arrested a woman today", "because we are feminists.", "So, does this mean you like each other now?", "- Yep. - Jury's still out.", "- Uh-oh. - Doesn't matter.", "It only matters what Amy thinks,", "and apparently she loves you.", "I do.", "That's the first time we've ever kissed.", "- Yeah! - [laughs]", "- The Wire Fox boys are back! - Whoo!", "Yeah!", "[both barking]", "I just won 70 grand,", "So, Rosa, pack your bags,", "we're going to Tampa.", "‐ Tight. Can't wait.", "‐ Guys, I'm out of gouda.", "[squawks]", "Sync &amp; corrections by Rafael UPD www.addic7ed.com/"]