[">- Oh hello.", "Guys, guys, guys, check it out.", "Hitchcock fell asleep in the break room,", "so I put his hand in a bowl of warm water.", "- Come on, man. - That's the stupidest prank ever.", "- Uh, no, it's the smartest because it involves biology.", "I bet it worked already. Let's go check.", "- Hitchcock, no! - He's drowning, he's drowning!", "- Save him, man!", "- I take it back, Jake. - Great prank.", "- Is everyone packed for the 28th annual", "Tri-State Police Officers Convention?", "I hear Bill Powell's giving a lecture on advances", "in appellate court e-filing techniques.", "Phew, talk about \"can't miss.\"", "- Yeah, we don't really go for the talks.", "We're more interested in the extracurriculars.", "Fart-five.", "- Of course, Rochester has much to offer in that sphere.", "For instance, it's famed thermometer museum.", "- Thermometer museum? - Uh, no thanky.", "Here's what a-we are all about.", "One, free hotel rooms.", "- I get to sleep in a bed by myself.", "No wife, no kids,", "just Terry starfishing on a Cal King.", "- Two, a huge hall full of cool police tech.", "- Last year, I got to try out a heat ray.", "- Three, the Buffalo P.D. - always throws an insane party.", "Last year, Amy got so drunk,", "she jumped a police horse into the pool.", "- Eight-drink Amy is an equestrian,", "and she's real bad at it.", "- This isn't an excuse for you to party.", "This is a police convention, not the Newport Folk Festival.", "- Come on, sir. - It's been a hard year.", "I mean, frankly, we could all use a party", "to blow off some steam.", "First we were on the night shift,", "then the precinct almost got shut down.", "- I got hit by a bus.", "- Well, we have been through a lot,", "but, frankly, our reputation has taken a hit.", "That's why I'm running for a seat", "on the convention's board of directors.", "If I win, it will look good for the precinct.", "So please don't do anything to jeopardize that.", "Understood?", "Dismissed.", "- That's a big ole bummer.", "- All right, everybody, just relax.", "We're still gonna have a great time.", "If there's one thing I know, it's how to sneak out to a party", "without your parents finding out.", "I used to do it all the time.", "Well, I did it a few times.", "Once, to go to a Magic: the Gathering tournament.", "I got stuck in the window like Winnie-the-Pooh.", "There, okay? Now you know everything.", "My mom had to pull me back in by my ponytail.", "All right, let's party!", "- What is taking so long with those keys?", "I gotta hit that pillow top. It's starfish o'clock.", "- Guys, guys, they're here. - Hey, hey, what's up B.P.D.,", "aka Buffalo Party Department.", "That is gold.", "You guys coming tonight, right?", "- Obviously, it's the only reason any of us are cops.", "- All right, detectives, here are your room assignments.", "Uh... wait a minute. What's going on here?", "- You guys planning a party? - What?", "No, we're just debating", "our favorite parts of the conference.", "He likes his Q&amp;A's moderated.", "I like mine unmoderated.", "- Why is that? - I just...", "I'm just...", "sick of the moderator bias.", "- I couldn't agree more. - Your story checks out.", "See you at the party.", "Let's check out some tech.", "Ooh, look.", "This is a long-range heart beat detector.", "You can hear a human pulse through walls.", "- Oh, I am so sorry. - Oh, whoa.", "- Excuse me.", "- Oh, my God, it's like a She-Scully.", "- I'm, hi. - Uh, Norm.", "- Uh, who are you? - Shatz.", "Uh, Cindy Shatz.", "- Scully, shake her hand. - Oh, uh, here I go.", "- Meet to please you, Shatz. - Your hands are so clammy.", "- I ate a bunch of clams earlier and they still smell.", "- No, that's not what she meant. - No, it was.", "Anyway, it was so nice to meet you.", "- Why?", "- Okay, uh, I'll see you around.", "- Guys, I was just talking to that amazing woman", "and I blacked out. Did I get her number?", "- No, you chunked it. - Ugh, of course I did.", "I'm not Hitchcock when it comes to the ladies.", "- You don't wanna be. - Oh, he's fearless.", "I once saw him ask out a breastfeeding mother.", "- Ooh, look.", "It's a robot that can patrol an empty building all by itself.", "Oh, no, this is how it starts.", "It's Skynet all over again. Here, let's wait here a second", "and see if our future selves show up", "and tell us to destroy it.", "Nope. Looks like we're in the clear.", "- It's kind of cute. - Hey, check it out.", "It's called The Wasp.", "It's for dispersing crowds of young people.", "It emits a sound that you can only hear if you're 35 or under.", "Ah, I also hate the sound", "- that I definitely hear. - Me too.", "It's so high-pitched or low-pitched.", "Oh, that was bogus to the extreme.", "- So bogus and not tubular.", "My ears are ringing from the pain of being young.", "- Ugh, so not gnarly.", "- Captain, you missed the tech expo.", "We got all this swag.", "Six tote bags. Terry can tote anything.", "Look, point at something, I'll tote it.", "- Oh, no.", "Hold still.", "I'm gonna hide behind you like you're a tree.", "- Uh, why are you doing that?", "- On the other side of your trunk,", "is the worst person I've ever met.", "Captain Jeffrey Bouché, the living embodiment of evil.", "- Raymond Holt? - As I live and breathe.", "You have not aged a day.", "So how's Kevin? How's Cheddar?", "Come on. Tell me everything.", "- Kevin is fine. - Cheddar is a dog.", "He has no concept of good or bad.", "- I wouldn't be so sure about that.", "He's a very clever dog.", "Hey, I wanted to tell you that I am also running", "- for the board of directors. - You are what?", "- Yeah, I had no idea that you were running,", "but, listen, it doesn't matter 'cause you're gonna win anyway.", "I mean, you're Ray Holt.", "But look, I gotta go. I will see you soon.", "I hope not.", "- You're being a little harsh on him, Captain.", "- I've been up for promotions against that man", "on six occasions,", "and he's prevailed every single time.", "Why? Because he's a snake.", "- Isn't it possible he gets promotions", "because he's nice and people like him?", "- Please, I hate to say this about anyone,", "let alone a fellow officer,", "but that man is full of balone-nya.", "- \"Baloney.\" - You're right.", "He's so vile, we should use", "the crude Americanization of the word.", "He's full of baloney.", "- Holt went to bed early", "'cause his big speech is in the morning.", "- Well, how do you know he's in for the night?", "- Because his breakfast order is hanging on the doorknob.", "Water, comma, hot.", "Muffin, comma, English.", "And that means it's time for us to hard, comma, party.", "- Hey, what happened? - Sorry, bro, they busted us.", "- 'Cause the party got too crazy?", "- Yeah, totally. - They've been taking bribes.", "- No, it was because of the party.", "That's what you should tell everyone.", "- Oh, no.", "The party's not happening.", "That means we're just", "in a hotel in Rochester. This is a nightmare.", "- I learned a bunch of new dance moves for tonight.", "- Ones where you move your butt. - Ugh, screw this.", "I'm gonna get a ride back to Brooklyn with some drifter.", "- No, we came here to blow off steam", "and we're not gonna give up yet 'cause we're the Nine-Nine.", "We're gonna take matters into our own hands Nine-Nine style.", "That's right, my friends.", "The Nine-Nine is throwing a big...", "- Can I borrow $200 for alcohol? - Mm-hmm.", "- Okay, I talked to some of the vendors at the tech expo,", "and they agreed to hook us up for the party.", "Check it out. Disco lights,", "sound system, and...", "beer cooler.", "Leak-free, insolated body bag.", "Our beer is dying to get inside.", "- I don't know, man.", "Holt didn't want us going to a party,", "he certainly doesn't want us throwing one.", "- Oh, poor, simple Terry.", "For such a bemuscled specimen,", "you certainly do frighten easily.", "I promise you, Holt won't find out.", "His room is all the way across the hotel from ours.", "He insisted so he'd have a view of the Rochester skyline.", "- Ah, drink it in, Peralta.", "The Mustard City.", "- Besides, if he does leave his room,", "my new partner will warn me.", "- New partner? - K-13.", "- Hello. - It's a robot!", "I can program it to wait outside Holt's door,", "and if there's any movement, it'll send us an alert.", "- All right, I'm in,", "but only because your robot is so cool.", "- I don't know. - It's not that cool.", "I mean, all he's doing is standing guard.", "- I mean, I could do that. - Awesome, if you do that,", "then K-13 can come to the party.", "I am programmed to boogie my butt.", "- No, I'm going to the party.", "People prefer me over a robot.", "Right?", "- Hey, going pretty good, right? - Hell, yes.", "It's like a Bonnie Raitt concert in here.", "- No. - Hey.", "We're about to do the Taser challenge,", "- you guys want in? - What's the Taser challenge?", "- We tase each other, then drink.", "- How do you win? - What are you, a lawyer?", "- You want in or not? - Yeah, Terry.", "What're you, a lawyer? It's Tasers.", "Get tased at a party, man. Come on.", "- She's here. - She's here.", "Cindy Shatz is here. What do I do?", "My face is so wet and my mouth is so dry.", "- Okay, calm down.", "Remember, be direct.", "Women don't like to play a lot of games.", "- I think we gotta start simpler.", "Okay, Scully, smile at her, don't fart.", "- He knows not to... - Oh, you're writing that down.", "- This is good stuff. - What else you got?", "- Don't talk about your foot fungus.", "Don't talk about your eye fungus.", "Let's just say \"fungus\" is off the table.", "- Oh, no, see you just wrote the word \"fungus\" down", "and I feel like we're barreling towards a misunderstanding.", "- Draw a circle around it and then put a line through it.", "- There you go. - Believe in yourself.", "Be confident. You're a sweet guy", "- with a big heart. - It's the size of a giraffe's.", "- Pushes on my other organs. - Okay, you got this.", "Don't talk about the giraffe heart.", "All right, get outta here!", "- Hi, Cindy. - Hey.", "- So guess what my eye and foot have in common?", "- What?", "- Uh...", "I can't say.", "Well, bye.", "Chug!", "- Jake, this party is insane. - Forget Bonnie Raitt,", "it's like the video to \"Love Shack\" in here.", "- This is the greatest.", "Oh, God. It's my new partner.", "- You guys are texting each other now?", "- It sends alerts.", "Holt left his room. He's on his way here.", "- Well, we gotta get everyone out of the hallway.", "All right, be quiet! Everybody, be quiet!", "- They're not listening to you. - Where's Amy?", "She's great at shushing.", "- Wait, all of these dum-dums are under 35.", "- Let's use The Wasp. - No.", "It'll hurt my young, little ears so much.", "- Ah, come on.", "- Attention, our boss is headed this way.", "Everyone has to clear the hallway right now.", "- Shh!", "Wow, she is great at shushing.", "- I know, she's like a librarian.", "- You mean, like a sexy librarian?", "- No, a regular one.", "- Everyone, you will go in the rooms", "and you will go right now.", "Don't make me count to three.", "- Shh, shh, shh.", "- Hey, Captain, what's up?", "- Uh, which room is Sergeant Jeffords?", "- Oh, Terry's in here with me and Amy.", "You know, we're just having a low-key night", "watching \"House Hunters International.\"", "This orthodontist really wants to live in Panama", "with his strangely old wife and won't say why.", "- Can I talk to him? - Uh, let me check.", "- Shh, shh.", "- Yeah, no, he's asleep. - Can I help you with something?", "- I'm concerned that my presentation isn't,", "uh, \"jazzy\" enough to compete with Jeffrey's.", "- He's such a showman. - Yeah.", "- I'm thinking about augmenting the graphs", "with, um...", "- color. - Sir.", "- I know. - I'm debasing myself.", "Anyway, give this to Jeffords. He's the artist.", "I'd like him to choose the, um...", "- Color? - Yes.", "- All right. - Oh, time to turn in.", "Nighty, night.", "Okay, he's gone.", "Now just gotta wait for K-13 to give us the all clear.", "- Yeah, I wouldn't hold your breath.", "Dumb robot probably rolled into the stairwell.", "That's why you shouldn't be best friends with this tin can.", "- K-13 says we are G-2-G. - Amy?", "- The shush is lifted. - Party time!", "- Beer me!", "- Yeah!", "Mm, hey, Captain.", "- Are you just waking up? It's 11:00 a.m.", "No, no, I'm just tired", "'cause, um, I worked out so much this morning.", "- Ah. - You know, squat 400", "on the bench push fitness and whatnot.", "- What's up? - I need my laptop.", "I wanna practice my speech with the new colors beforehand", "so I'm not alarmed when they pop up.", "- Right, right. - Um, I know that Terry", "definitely did do that work,", "- so I'll just go grab 'em. - Okay.", "- Uh, you wait here. - You can't come in because...", "Amy's naked", "and she's embarrassed of her weird body.", "Terry. Terry.", "Terry. Terry.", "Why's my tongue so big?", "- Because you're a big person.", "Holt is here. He wants his presentation.", "- The presentation! - I didn't do it.", "Okay, I just need to add color.", "It'll only take two minutes.", "- Stall him. - Okay, no problem.", "I'm definitely got two minutes worth of stall material.", "Okay, Sarge will be right out.", "In the mean time, why don't you and I just chat,", "you know, for a couple minutes about...", "brumpst.", "- Brumpst?", "- Hold on.", "I couldn't stall him, he's too good,", "it's not my fault.", "Where are you on the presentation?", "- Jake, Holt's laptop isn't here.", "It's gone.", "- Where are you on my graphs? - The presentation is", "- in 90 minutes. - I'm definitely all done,", "but I'm worried, if you're going up against Jeffrey,", "will color be enough?", "I was thinking, slide transitions.", "- Oh, good grief.", "Very well. You may add cross dissolves.", "But so help me God, Jeffords, if I see even one star wipe...", "- I just need a half an hour. - Perhaps I should supervise.", "- No, you should clear your head.", "Work out. Rosa was just headed to the gym.", "She'll keep you there. Be right back.", "Rosa, I need you to workout with Holt", "for the next half hour. Cool?", "Great.", "I'll get your sneakers.", "- This is invigorating, isn't it?", "- I can't believe you lost the captain's laptop.", "You were kind of out of control last night.", "- I was not.", "Although, pretty sure my ribs are broken,", "and I think I'm wearing a pillowcase I cut holes in", "- as a shirt. - We have to think.", "Does anyone remember having the laptop?", "- Wait, we all left the room and went somewhere", "and I didn't want to leave the computer behind", "with so many strangers, so I took it!", "- Yes, Charles, you're a genius.", "All right, we gotta split up and search the hotel.", "Wait a minute. Why is my shoe all wet?", "The pool!", "- Damn it. - No sign of the laptop.", "What were we doing here?", "- Look, there's Jake's shirt. - It looks burnt.", "- Because I was on fire. - Hence the pillow shirt.", "It's all coming back to me.", "I'm a human torch!", "Nope, it was just that one memory.", "This was a dead end.", "- I remember why you were on fire.", "The State Troopers brought fireworks.", "- Yes. - We're unraveling the mystery.", "- It's like we're detectives. - We are detectives.", "- Right. - Another thing we remembered.", "This is going great.", "- Oh, Raymond.", "Of course you have beaten me to the gym.", "You live life right. It's amazing.", "- Workout your legs, Jeffrey. - Not your mouth.", "You are hilarious.", "I am so psyched for your presentation to the board.", "- I'm sure it's gonna be amazing. - I'm gonna crush you", "like a can of diet seltzer water.", "- I don't doubt it. - Well, I'm off to do some squats.", "- Dumbass.", "- Okay, so this is definitely where we set off the fireworks,", "but still no laptop.", "- How did I catch on fire?", "- Oh, no, I just remembered something.", "Terry feels bad.", "What the hell was that?", "Ah!", "- Ah!", "- Hence the chest pain,", "but what was that loud crash?", "- I think that might have been me.", "See you in hell, partner.", "- You killed her?", "- Her? - Oh, my God, it was a her.", "You were replacing Amy, not me.", "- What have I done? - Wait, the robot has a camera.", "Maybe she saw who took the laptop.", "- There's the laptop bag. - You think you're", "so much better than me.", "- You're right. - I'm just gonna fast forward.", "- Oh, hey, robot.", "I got something really cool to show you on the balcony.", "I think you're really gonna like it.", "Oh, you're heavy.", "- Fast forward. - Did you guys see that?", "He put the bag down behind the plant.", "- Let's go.", "Is it there? Is it there?", "- It's here! - We did it!", "We found the bag!", "Oh, wait, hungover. No spinning.", "- No spinning. - Okay, okay, okay, okay.", "I'm good.", "Oh, hey, hey!", "- Oh, Scully.", "You bummed about Cindy", "or you just feel at home in a body bag?", "- We use the same medicated powder.", "I could smell it.", "- She's my soul mate, Amy. - So she doesn't like you.", "It happens. I mean, not to me,", "but not everyone has my combination", "of elegance and charm and grace and poise,", "and then just gif-ability. Some would say \"jif,\"", "but then some would also say \"syrup.\"", "- Wait, what if we could give Scully our personalities?", "He would love that.", "- We could talk to him through an earpiece", "- and tell him what to say. - Okay,", "but can we attach a string to it?", "Last time I wore an earpiece, it fell in.", "- How you doing, Scully? - Nervous.", "I can feel my legs. That never happens.", "- Something's wrong. - Okay, just go up to her", "and repeat what we say.", "- I wasn't gonna... - Hi, there.", "- Scully, hey.", "Cindy, there's something I want to say to you.", "- The moment I first saw you...", "- You took my breath away.", "Whenever I'm around you...", "- My heart beats faster.", "I know you're going home today...", "But I couldn't let you leave without asking you out.", "- Cindy Shatz... - Cindy Shatz...", "- Can I buy you a drink? - Can I buy you a drink?", "- No, I'm sorry.", "I'm not interested.", "- What? - No.", "- Guys, earpiece fell in.", "- What on earth took you so long?", "- Yeah, where the frigging hell were you?", "- I was trying to get the colors right,", "but in the end,", "I decided to just go with your original black and white.", "- It's probably even one color too many.", "Anyways, in you go.", "Looking good, Diaz.", "- Bite me. - Okay.", "- Uh, hello, I'm Captain Raymond Holt,", "and if I have the pleasure of joining your board,", "here are some of the things that I would do.", "- See? - It all worked out.", "We threw a wild party with absolutely zero consequences.", "Jake, something's wrong.", "- Oh, um...", "oh, I don't know how that got in there or what it is.", "Um, I'll just, uh... next slide.", "Well, that's strange. Next slide.", "Next. Next.", "Oh, I see what's happening here.", "Uh, due to an issue with the Internet cloud,", "you are seeing a series of pictures", "that have nothing to do with me", "or the 99th precinct.", "- I don't get it. - Who even took these pictures?", "- I did.", "You guys should really be a lot more careful", "about leaving laptops lying around.", "For next year.", "- Consequences.", "- My, oh, my. - Boyle, can you even tell me", "what is happening in this picture?", "- Uh, that's me doing a Jean-Claude Van Damme split", "between two beds.", "I had to wear my underwear for flexibility.", "- Mm-hmm, and, uh, Santiago?", "- I believe that is me throwing up", "- into a pillow case. - Uh-oh.", "- You have all embarrassed the precinct.", "Now when people think of the Nine-Nine,", "they'll think of, um...", "oh, Detective Diaz filling an iron with tequila.", "- So I could make tequila steam.", "- I can quite believe I'm gonna say this,", "but I'm sorry I even came to Rochester.", "- Hey, it's all right, Scully.", "We'll find a way to make it up to him.", "- Ah, it's not about him, Jake.", "I'm just sad because I'm an unlovable sack of fungus,", "and I'm gonna be alone forever.", "- Oh, um...", "hey, there's probably someone out there for...", "- We got this. - Oh, thank God.", "- Wow, pint of milk on the rocks.", "- Real Scully move. - Can I help you?", "- Hi, we're friends of Scully's,", "and we're not sure why you rejected him?", "- Now, we know Scully's not perfect,", "his hands smell like clams, and, yeah,", "over 75% of his body has died, and...", "- Gina, you can stop listing things.", "- Point is, he's a good guy.", "You should give him a chance.", "- I know, when I first meet him, I was intrigued,", "but then Mr. Confident showed up,", "I'm not interested in that.", "Confident people are mean and selfish.", "- Wait, you liked awkward Scully?", "Giraffe-heart Scully?", "- Oh, my God, he has a giraffe heart?", "Aww, I bet it pushes on his organs.", "We'll be back in five minutes. Wait right here.", "Bartender, can you top off her milk?", "- Hey. - Hey.", "- You wanna hear a joke? - Okay.", "- I don't know any jokes. - I should go.", "- Oh, that's okay. - I don't know any jokes either.", "- I slept in a body bag last night.", "- Whoa. - They're so cute.", "Oh, no, Scully, don't put your finger in her mouth.", "Oh, she likes it.", "- Captain, I'm sorry that things got out of hand,", "but you can still be on the board.", "I read 85 pages of the convention bylaws,", "- and... - That was unnecessary.", "- I don't wanna be on the board. - But I read bylaws.", "- I wanna show you a picture from last night", "- that really upset me. - Okay,", "but in my defense, Rosa bet me 50 cents", "that I couldn't drink all that shampoo.", "- That's not what I wanted to... - You drank shampoo?", "- What? - No.", "You're the one farting bubbles.", "- This is what I wanted to show you.", "Do you know what disappoints me most", "about this about this picture? That I'm not in it.", "I can't remember the last time", "I saw the Nine-Nine so happy,", "- and I wasn't there. - 'Cause you were working", "on your presentation to get us a win.", "- Yeah, well, it wasn't a real win.", "- I wish I had been in that photo. - I know,", "and I'm sorry you didn't have more fun this weekend.", "But it's not over,", "and we are still in Rochester.", "- What are you saying?", "- I think you know what I'm saying.", "- What a thermometer.", "Look at the mercury reservoir on that mamacita.", "Oh, Peralta, this is amazing. I'm floating on air.", "- Hey, everybody, get in for a picture.", "Excuse me, sir. Can you take a picture of us?", "- Yeah, sure. - Thanks.", "- Everybody say Daniel Gabriel Fahrenheit.", "Daniel Gabriel Fahrenheit.", "- Not a doctor. - Shh."]