[">This job is eating me alive.", "I can't breathe anymore.", "I spent all these years trying to be the good guy. Ripped By mstoll", "The man in the white hat.", "I'm not becoming like them.", "I am them.", "Hey! What are you doing, weirdo?", "I'm doing the best speech from Donnie Brasco.", "Or, actually...", "Ten of me are doing the best speech from Donnie Brasco.", "What's up?", "Get it together, man. Okay?", "So, the store was hit about two hours ago.", "They took mostly tablets, laptops, and cameras.", "Sorry.", "I'd like a list of all your employees who ever had access to the store.", "I'd also like to apologize for my partner.", "His parents didn't give him enough attention.", "Uh... Detective?", "I already solved the case.", "We're looking for three white males, one of whom has sleeve tats on both arms.", "And how do you know that?", "I had an informant on the inside.", "He's been here for years.", "Watching, learning, waiting...", "His code name...", "Fuzzy Cuddle Bear.", "He's a nanny cam.", "Ugh! You got lucky.", "No, I got here five minutes before you", "and figured that in this gigantic electronics store", "there had to be at least one working camera.", "Oh! Hi, bad guys.", "You did it, Fuzzy. You busted 'em.", "It's time to come home.", "I'm not sure if I can.", "I've been undercover so long,", "I've forgotten who I am.", "I've seen terrible things.", "I haven't known the touch of a woman in many moons.", "All right.", "Detective Santiago?", "Don't walk away from me!", "PERALTA: Yes, I did crack the case.", "So, Santiago, would you do the honors?", "I hate this. PERALTA: Oh, yeah.", "I hate this. PERALTA: And you're just gonna wanna add one.", "I'm winning!", "It's a good feeling. It's a good feeling. Yeah.", "Enjoy it while it lasts.", "I will.", "J.P., update on the Morgenthau murder?", "Yeah. Good news for all you murder fans.", "Earlier this morning, someone decided to shoot and kill", "luxury food importer, Henry Morgenthau.", "Body was found by the cleaning lady.", "During her interview, I deduced using expert detective work,", "that she had something super gross on her chin.", "I think it was flan.", "Charles thinks it was flan. I think it was butterscotch pudding.", "Maybe it was just old person gunk.", "You know how old people always have that gunk on them?", "Oldie gunk. Could be. Yeah. Anyone else?", "How about we focus on the murder,", "and not the old person gunk?", "Crime techs are at the scene now.", "We're heading back when they're done.", "Okay. I want you on this.", "It's gonna be priority one for the new CO.", "Wait. Tell us about the new captain.", "Captain Holt will be here soon.", "He'll want to introduce himself.", "Dismissed.", "Hey, Gina, you know any scalpers?", "I wanna ask Rosa to go to the Rihanna concert with me,", "but it's sold out.", "Okay, two points to make here.", "First, Rihanna?", "You... And then Rihanna.", "Yeah. What's your second point?", "She's got a type,", "which is really anyone but you.", "Yeah, that was my ex-wife's type, too.", "Look, a Rihanna concert is a pretty big swing, man.", "I don't know.", "She's into watching old movies.", "Cool!", "Where would I find a place that shows old movies?", "Oh, yeah. Just go on the Internet", "and search for the phrase,", "\"I want to buy two movie tickets", "\"for a girl who doesn't like me.\"", "Great. Thank you. Good.", "Hey, have you heard anything about the new captain?", "Uh, no, and I don't care.", "I just wish Captain McGintley never left. He was the best.", "He was terrible.", "You just liked him 'cause he let you do anything you wanted.", "On your marks, get set...", "Go.", "What the hell's goin' on around here?", "Fire extinguisher roller chair derby.", "Okay.", "And go!", "What's your point?", "If I'm ever gonna make captain, I need a good mentor.", "I need my rabbi.", "Sorry, dude. But this new guy's gonna be another washed-up pencil pusher,", "who's only concerned with", "Following every rule in the Patrol Guide.", "Meep morp zeep!", "Robot captain engage.", "Is that what you think?", "New captain alert.", "You must be the new CO.", "I'm Detective Jake Peralta. Great to meet you.", "No, don't let me interrupt you.", "You were describing what kind of person I'm gonna be.", "I'd like you to finish.", "It's not necessary.", "Or I could recap very quickly. Sure. Um, let's see.", "I think I said some joke about", "being a washed-up pencil-pusher.", "Now do the robot voice.", "The robot voice you were doing when you implied I'm a rule-following robot.", "I wanna hear it again.", "Meep, morp, zarp.", "Robot.", "That's a terrible robot voice.", "The next time I see you, I'd like you to be wearing a necktie.", "Oh, uh, actually,", "the last captain didn't care if we wore ties.", "Well, your new captain does.", "And more importantly, he cares that you follow his direct orders.", "Everyone.", "I'm your new Commanding Officer, Captain Ray Holt.", "Speech!", "That was my speech.", "Short and sweet.", "Sergeant Jeffords. A word.", "Yes, sir.", "I love that guy. Same.", "He's so suave.", "Does anyone get a little bit of a gay vibe?", "No? Okay.", "Sergeant, you were in the One-Eight with me.", "Though you were significantly...", "Fatter, sir. They called me Terry Titties.", "Because I had large, uh...", "Titties. Yes. I remember.", "I never liked that nickname.", "Though to be fair, it was accurate.", "What's this I hear about you being on administrative leave?", "A year ago, my wife and I had twin baby girls, uh...", "Cagney and Lacey.", "They have adorable chubby cheeks.", "Ever since, I kinda got scared of getting hurt.", "Lost my edge.", "There was an incident in a department store.", "Hey, man. You okay? You look a little jumpy.", "Oh, I'm fine. I'm fine.", "I think he's dead.", "And I'm still not right.", "Tell me about your detective squad.", "Um, well...", "Scully, Hitchcock, and Daniels.", "They're pretty much worthless.", "But they make good coffee.", "Copy that.", "Now the good ones.", "Rosa Diaz. Tough, smart, hard to read,", "and really scary.", "Tell me who has me for Secret Santa.", "No! That takes all the fun out of it.", "It's Scully.", "He got you a scarf.", "I'll make him return it.", "Yes, you will.", "Charles Boyle.", "He's a grinder. Not the most brilliant detective,", "but he works harder than anyone else.", "He's not physically", "gifted.", "Aw, man! My muffin!", "Ah!", "Ow, my head!", "My muffin and my head!", "And I stepped on... On my muffin, and my head and my muffin.", "JEFFORDS: Amy Santiago.", "She's got seven brothers.", "So she's always trying to prove she's tough.", "Be careful. That stuff's pretty hot.", "Oh, is it? Hmm?", "JEFFORDS: She and Peralta have some big bet over who gets more arrests this year.", "Ever since the bet, their numbers have gone way up.", "Tell me about Peralta.", "JEFFORDS: Jacob Peralta is my best detective.", "He likes putting away bad guys and he loves solving puzzles.", "The only puzzle he hasn't solved", "is how to grow up.", "That was very well put.", "I've talked a lot about Jake in my", "departmentally-mandated therapy sessions.", "Look, you know my history.", "You know how important this is to me.", "This precinct is doing fine.", "But I want to make it the best one in Brooklyn.", "And I need your help.", "Absolutely, sir.", "Where do we start?", "What is happening?", "We start with him.", "Okay. So the perp came in through the window, left the muddy red footprint,", "and apparently had sex with the dish rack.", "Shell casings found here.", "Two shots.", "Bang, bang. Great work, Detective.", "You get a tie. Hey, that's mine.", "You took it from my desk.", "That's right, Charles. Good solve. Tie for you.", "Thanks! Now everyone be sure to put those on, because it's", "impossible to solve crimes unless you're wearing a tie.", "Lay off the Captain.", "That man is gonna be my rabbi.", "Okay, first of all, when you use the word rabbi,", "you know that turns me on. And that's unfair in the work environment.", "Secondly, your rabbi is a pain in my ass.", "Yeah, he's a little too serious. What do you think, Rosa?", "Seems cool. Yeah, seems cool. I agree.", "Looks like the perp stole", "a computer, a watch, and a Jam?n lb?rico ham,", "valued at... What? $6,000.", "$6,000 for a ham?", "Jam?n lb?rico is an amazing cured ham from Spain.", "They had it at my uncle's funeral.", "I gorged myself at that funeral.", "I mean, I was constipated for three days.", "Wow. That's a great story, Charles. Thank you.", "All right, listen up, everybody.", "Better contact Captain Holt and let him know we got a ten-tie situation.", "Speaking of ties, where's yours, Meep-Morp?", "This is fantastic.", "Captain! Hey!", "Welcome to the murder.", "What are you doing here?", "I like to know what my detectives are up to.", "Is that okay by you? Yep.", "Take Santiago and knock on doors.", "See if the neighbors heard anything.", "Door duty? It's a waste of time.", "Diaz and Boyle, check in with the coroner. Report back to me in an hour.", "HOLT: No, it didn't.", "He's got like, super hearing.", "Hey, Rosa. Rosa, Rosa.", "Um...", "I just happened to notice that", "there's an old movie festival", "playing at the Film Forum this week.", "You want to go?", "Sure.", "Cool! Awesome.", "There's a bunch of movie options.", "I'll probably just go with something classic.", "Like Citizen Kane.", "Citizen Kane is terrible.", "Pick a good movie.", "Good call. Smart.", "I'll do it. I'll pick a better movie than", "Citizen Kane.", "So, Gina, civilian administrators like yourself", "often have their ear to the ground.", "What do Santiago and Peralta have riding on this bet of theirs?", "I will tell you on six conditions.", "Number one, you let me use your office to practice my dance moves.", "Second... How about this. If you tell me...", "Mmm-hmm? ...I won't have you suspended", "without pay. Oh, that sounds great!", "Okay, the deal is if Amy gets more arrests, Jake has to give her his car.", "It's an old Mustang. It's pretty sweet.", "If he gets more arrests, she has to go on a date with him.", "He guarantees", "it will end in sex.", "I'd bet on at least some over-the-clothes action.", "At the very least some touching.", "Oh, that's enough, Gina. Caresses...", "I could see him showing up in a silk robe...", "That's enough, Gina.", "All right. Thank you.", "PERALTA: Let the wasting of time begin.", "Hello, sir.", "May we ask you a few questions?", "Definitely. Yeah.", "I'm actually... I'm super glad you guys are here right now.", "Are you smelling that weed smell?", "Yeah. Yeah.", "'Cause a dude broke in, smoked weed, and bolted. It's...", "Do you think it's the same dude that left that bong there on the floor?", "Yes.", "Police.", "Hello. What's your name? Hello.", "My name? Mlepnos. Mmm-hmm.", "Can you spell that, please?", "M-L-E-P...", "Clay. Did you say Clay?", "Yes. The \"Clay\" is silent.", "All right. Got it.", "Have you seen this man before?", "He was shot last night.", "Oh!", "Thank you.", "No. Sir? That's ours. We need that.", "We... And he kept it.", "Wall Street Journal on the doormat, top floor apartment.", "20 bucks says this guy's like a hot, eligible bachelor.", "I'll take that action. Police, open up.", "Hello.", "Hello, sir! How are you today?", "I am Detective Right-All-The-Time,", "and this is my partner, Detective Terrible-Detective.", "No surprises from the coroner.", "Two gunshots, shoulder and chest.", "None of the neighbors heard or saw anything.", "And what's worse, Santiago struck out with a 92-year-old.", "That is not accurate, sir.", "Wait, you hooked up with him? Ugh!", "All right. Hit the pawnshops and canvas the neighborhood.", "And while you're out, you can buy yourself a tie.", "Oh, actually, sir...", "I'm wearing a tie right now.", "Check it out!", "Secret tie!", "First of all, I think you're kind of overdoing it with the manscaping.", "But more importantly, Detective,", "why do you refuse to take my orders seriously?", "Does anyone here know why it's so important to me", "that you all dress appropriately?", "Hmm. Four highly-trained detectives and not one of you can solve this simple mystery.", "Okay, I want to be briefed on any new developments.", "Any questions? I was gonna ask you if you thought I was doing too much", "manscaping, but we solved that one, so I'm good. Mmm-hmm.", "Hey, Boyle. Yeah?", "What about this fancy ham stuff? Jam?n lb?rico?", "Yes. The perp left a really expensive TV,", "but then stole ham? It doesn't make sense.", "Is there a place nearby the crime scene that sells it?", "Beneficio's might. Let's go.", "You're gonna brief the CO first.", "We'll brief him after we catch the guy.", "My name is Ratko.", "I don't know anything. Oh.", "Okay. You recognize this guy?", "Henry Morgenthau?", "No.", "Maybe, actually...", "Look at the picture? I don't know him.", "I don't know what happened.", "No more questions!", "Well, why don't I run a scenario past you, Ratko,", "and you tell me what you think?", "You do know Morgenthau. He came in here and tried to sell you some hams.", "You knew they were worth a lot of money,", "so you tried to steal them from him when he wasn't home.", "Only he was home, so you shot him.", "Does that sound familiar?", "Uh, maybe some role-play will jog your memory?", "That's a great idea. Okay. Yeah.", "Uh, so I'm... I'm Ratko. No, no. I'm Ratko.", "Come on. I'm always the victim. So...", "Look, I'm not doing this with you right here.", "Fine. Fine.", "Oh, I'm Henry Morgenthau, owner of delicious and expensive hams.", "Don't I know you from the grocery store? Kill.", "And scene.", "PERALTA: NYPD. Everyone, down!", "Ma'am, if you could just get down.", "Or ignore me and continue shopping.", "Boyle, get the door! BOYLE: On it.", "Ratko?", "PERALTA: Back up.", "Whoa. Whoa, whoa.", "Ow! Ratko! I'm getting mad!", "That's a waste of Manchego!", "Charles!", "How are you still here?", "Jake! Little help?", "Ratko!", "We're not going anywhere, Jake.", "Ratko!", "I've got him. It's cool. I got him.", "He's all mine.", "PERALTA: So, no, I did not brief you.", "And, yes, he did get away.", "But, some bonus good news.", "I got you hazelnut.", "And, little spoon there, for you.", "Is he seriously assigning me to the records room?", "I mean, why do we even have a records room?", "The computer has been invented, right? I didn't dream it?", "You're lucky, man.", "I wish I could get assigned here full time.", "You could not be farther from the action.", "Sergeant, you know me.", "I have more arrests than anyone.", "Will you please tell the Captain how dumb it is", "to lock his best detective in a file cabinet?", "Second best.", "You're wrong about Holt.", "That man has forgotten more about being a cop than you will ever know.", "In 1981, he caught the Disco Strangler.", "It's over, Disco Man.", "Put down the yo-yo and back away from the girl.", "Wow. The man is the real deal.", "You need to listen to him.", "Going to be hard to win our bet when you're on the bench, Peralta.", "Although, I did start a new category.", "\"Murderers we let go.\"", "And look at that!", "You're winning!", "Have fun with your files.", "Yeah. You know what? I will have fun with my files.", "Have fun with your face!", "Slam!", "That was a slam.", "So? What movie did you get us tickets to?", "Oh, well, just to be safe,", "I bought tickets to all of them.", "Just to be safe? What does that mean?", "I don't know. Uh, I didn't wanna mess up,", "because you're sort of opinionated.", "You think I'm opinionated?", "Okay, here's an opinion for you.", "You're a bad judge of character and your shirt looks like vomit.", "So we can go see North by Northwest.", "We are not seeing a movie together.", "Good call. Smart.", "Keep it profesh.", "Hey, Captain. So, you found something?", "Hey, I like the tie.", "If you can't beat 'em, join 'em.", "Anyway, I think I got something good here.", "Turns out the name Ratko is made up.", "But I was digging through these files,", "one of which I literally found in a spider web,", "and it turns out there were a bunch of references to a Serbian thug.", "Street names, \"The Rat\" and \"The Butcher.\"", "He was known to hang out at a storage unit near Boerum Park,", "which has red soil, hence,", "the muddy red footprint on Morgenthau's counter.", "That's fine work, Detective.", "Thank you very much, sir.", "A testament to what can be achieved when you dress appropriately.", "Let's pound it out.", "You know what? Such fine police work.", "Let's share it with the whole team.", "Santiago, Boyle, Diaz, get in here.", "Bring everyone. And a camera.", "That's not necessary.", "Let's have a hand for the work of the fine... Oh, they're here!", "...master detective, Jake Peralta.", "Yeah. Let's have a hand, everyone. Give him a hand.", "Yeah, nice!", "Yeah. Thank you. DIAZ: Looking good!", "SANTIAGO: No record of Ratko on the ledger.", "Must have used cash.", "Well, I for one am just pumped to be on a stakeout with you, Captain.", "You know what my favorite thing about stakeouts is?", "Patrol Guide says no dress code.", "So I'm just the zip-up hoodie", "and my two best friends.", "Does he always talk this much?", "I just tune it out.", "It's like a white noise machine.", "Okay, first of all, that's racist.", "Secondly...", "Captain, Terry told me you caught the Disco Strangler?", "I mean, that's incredible.", "I've read that case.", "With all due respect, sir,", "why'd it take you so long to get your first command?", "Because I'm gay.", "Uh...", "Seriously?", "I'm surprised you didn't know.", "I don't try to hide it.", "Did anyone else get a little bit of a gay vibe?", "Manscaping.", "Damn.", "I am not a good detective.", "Here. I feel bad", "that you spent all that money on the movie tickets.", "Why don't you just go to the movies with me? No.", "Okay.", "Well, this is awkward.", "It's not awkward.", "I like your company.", "You're sweet.", "When did you come out?", "About 25 years ago.", "The NYPD was not ready for an openly gay detective.", "But then the old guard died out,", "and suddenly, they couldn't wait to show off the fact", "that they had a highly ranking gay officer.", "I made Captain,", "but they put me in a public affairs unit.", "I was a good soldier.", "I helped recruitment.", "But all I ever really wanted was my own command.", "And now, I finally got it.", "And I'm not gonna screw it up.", "Uh, Captain, I'm sorry. I...", "I feel like a jackass.", "But, on the flipside, there's Ratko.", "Humility over. I'm amazing.", "Fantastic. 3,000 identical blue doors.", "Looks like we all got door duty.", "Oh, yeah. From before.", "Good one.", "You look great.", "Clear.", "Clear.", "Unbelievable. Unbelievable!", "Ratko, great to see you.", "You can't stop me.", "I'm going. Actually...", "You're not going anywhere.", "'Cause if you take a look to your left you'll see Detectives Boyle and Diaz.", "Right there is Detective Santiago.", "And behind you is Captain Holt.", "Point is, my team has you surrounded.", "Oh, my God! I just got the tie thing!", "Captain, I just figured it out.", "Maybe now's not the best time, Detective.", "It's a uniform.", "We're a team, and the tie is a part of that team's uniform, right?", "You ask Ratko what team?", "No, Ratko, shut up.", "It's important to you, because you were kept off the team for so long,", "and now you're the coach", "and you want us to all wear that same uniform.", "Boom! Nailed it.", "Yes, you did. Now, just arrest Ratko.", "All right, Ratko, down. Drop the weapon.", "Hands on your head. Here we go.", "He's running! Go!", "Got him.", "Hands behind your back. Hands behind your back!", "BOYLE: Stay down.", "That's how we do it in the Nine-Nine, sir.", "We catch bad guys, and look good doing it.", "What's wrong with you?", "Never took off the Speedo. Big mistake.", "It is inside me.", "Great work, team! Ripped By mstoll"]