["> everyone, check your email.", "The greatest thing that could ever happen has just happened.", "The girl who beat you for high school valedictorian died?", "No, \"kevin cozner requests your presence", "At raymond's birthday party.\"", "Who's kevin cozner?", "Is he the star of \"danzes with wolvez?\"", "He's captain holt's husband. Captain raymond holt.", "We're invited to the captain's birthday party.", "Oh, the captain's party and whatnot.", "I can't wait to see the inside of raymond's house.", "I'm gonna learn everything there is to know about him.", "I bet it's really fancy, like beauty and the beast fancy.", "No, it's probably just an empty, white cube", "With a usb port in it for him to plug his finger in", "When he's on sleep mode.", "Apparently, my husband kevin has invited you all to my party.", "There is very little street parking, no gifts,", "No singing of happy birthday. Should be fun.", "Sounds fantastic.", "Did you hear that? His husband invited us, not him.", "He so doesn't want us there.", "Yes, he does.", "Mm, it was kind of a last-minute invite.", "Just stirring the pot.", "Why wouldn't holt want us there?", "Because he thinks we're going to embarrass him", "In front of his husband, which, frankly, is insulting!", "Oh, man.", "All the orange soda spilled out of my cereal.", "[upbeat music]", "♪", "[knock at door]", "Happy birthday, you sly, old fox.", "How many spankings is it this year?", "Peralta, please. Save some charm for the party.", "Oh, you mean the party that you begrudgingly invited us to", "At the last minute 'cause you don't want us there?", "I couldn't be happier you're coming.", "And it shows. I can't wait to meet kevin.", "I assume he's the fun one in the relationship.", "I'm not sure you and kevin will get along.", "Really? Well, I disagree.", "In fact, I will guarantee you that by the end of the night,", "Kev and I will be best friends.", "He hates being called \"kev.\"", "Or does he? Yes.", "[grunts] bam!", "Behold, my secret weapon for winning over kevin.", "In this box is every grisly crime", "The nine-nine has worked in the past eight years.", "Civilians love juicy cop stories.", "Oh, I call that murder where they strung", "Fishing wire through three guys.", "Hey, we solved that together.", "Well, tough tetris. I called it.", "Also, I've loaded all of my favorite karaoke backing tracks", "Onto my phone.", "Kevin and I will be duetting rolling in the deep!", "That's it, emergency squad meeting,", "Briefing room, two minutes.", "uh, adult parties?", "Sergeant, I believe they're called orgies.", "No-look five.", "I met my wife at an orgy.", "Well, she was leaving an orgy,", "And we bumped into each other on the street.", "Real meet-cute.", "Thank you for exhibiting exactly why this meeting is necessary.", "Everyone here needs some instruction", "On interacting with grown-ups.", "Sergeant, why am I here?", "I'm always incredibly appropriate.", "In high school, I was voted \"most appropriate.\"", "Ooh, self burn. Those are rare.", "I shouldn't be here either. I'm fine at parties.", "I just stand in the middle of the room and don't say anything.", "Here are the rules: No staring at your phones,", "No rolling in two hours late.", "No sweatpants, no jeans, and no shorts.", "What about dress-up shorts?", "For instance, the kind jen aniston might wear?", "No, those are still shorts. No shorts.", "And everyone bring a bottle of wine.", "Why are there so many rules? I mean, next thing", "You're gonna say is we can't be late.", "Yeah, that's, like, the first thing I said.", "Ohh.", "This neighborhood's amazing.", "Class just seeps outta every vestibule.", "Keep it in your pants, santiago.", "Scully, I specifically said, \"no shorts.\"", "Sarge, it's not my fault.", "You said so many things about shorts, I got confused.", "Man, did I screw the pooch.", "Oh. Peralta,", "Where have you been?", "I'm sorry, I'm sorry, I know,", "I am threety-five minutes late. Yikes!", "But I had to stop and get some wine.", "Hello, good sir, I'd like your finest bottle of wine, please.", "That will be $1,600.", "Great, I'd like your $8-est bottle of wine, please.", "It's from the finest vineyard in arkansas.", "[chuckles]", "Ah, samesies!", "[laughter]", "[soft piano music playing]", "Wow.", "Wow.", "Ah, welcome.", "captain.", "Raymond!", "Those slacks are a knockout.", "Come on, amy.", "I trust you found my home easy to locate,", "And thank you all for wearing appropriate footwear.", "Wow, you really let your hair down", "When you're not at the office.", "Ah, detectives, meet my husband, kevin.", "Nice to meet you. Hi.", "Evening, so glad you could make it.", "Ah, and look, he brought us some wine.", "\"drink.\" this is legally called \"wine drink.\"", "Hmm, how very thoughtful. Thank you.", "It's red. Like blood.", "You know, I worked a double homicide", "On this block a couple years ago.", "The details will astound you.", "Yes, I am sorry.", "Perhaps raymond didn't say anything.", "Our home has a \"no shoptalk\" policy.", "I don't bring home beowulf,", "And he doesn't bring home cop stories.", "Ah. So may I pour you", "Some of this wine drink you brought us?", "Perhaps all of it?", "All of it sounds good.", "Actually, ray and I met over the phone.", "Oh, they've all heard the story.", "No, we haven't, and we need to.", "Well, ray was a source for an article I was writing", "For the new yorker.", "I asked him a series of dry questions", "About police work, and his answers had me in stitches.", "There's no one funnier than ray holt.", "Amen. There isn't?", "we met for a drink that night,", "And we've been together ever since.", "Yeah.", "So, kevin, I hear you're a professor at columbia?", "That's right, yes. I head the classics department.", "Ah, interesting, classics.", "Zeppelin, hendrix, die hard. Total classics head over here.", "I'm joking, obviously. I know what the classics are.", "The odyssey and...The one you said when we got here,", "The wolf one.", "kevin, why don't we go mingle", "And let the detectives settle in?", "Boyle, what happened to your shirt?", "I spilled a wonderful winter salsa.", "Here, wear my shirt. I was gonna take it off anyway.", "Hitchcock, no!", "boyle, take my sweater.", "Fits really well. We have similar physiques.", "We've been here all of four minutes,", "And you guys have already forgotten everything I said!", "Party huddle, stat!", "Okay, gang, we need a new strategy.", "Totally. What is going on out there?", "We can't tell cop stories, kevin doesn't find me charming,", "And a native english speaker referred to captain holt", "As \"hilarious.\" I am flummoxed!", "That's a word I learned for this party, and I am it!", "Well, I'm doing fine. Really?", "\"raymond, those slacks are a knockout.\"", "do you think he heard that?", "Only 'cause you yelled it.", "Shut up.", "From now on, we play to our strengths.", "Charles, you know everything about food.", "That's all you talk about.", "Will ever know everything about food.", "It's an evolving discipline.", "That's great stuff.", "It's so boring. Don't waste it.", "Amy, you studied art history.", "That's interesting.", "Scully, opera.", "Hitchcock, nothing. Talk about nothing.", "Rosa, stick with gina.", "Make sure she doesn't say anything insane", "Or steal anything.", "Too late. [chuckles]", "Don't worry, it's just, like, hats and scarves and stuff.", "She will put those back. I will handle the chitchat.", "Well, that just leaves you, peralta.", "what's your cultural specialty?", "Easy, kevin mentioned the new yorker,", "And I've totally read that.", "[laughs]", "Keep a low profile, chuckle at anecdotes.", "Try not to start any conversations.", "Got it.", "Wait a minute, you're hitchcocking me?", "Well, not surprising. We're practically twins.", "\"be appropriate,\" on three. Quietly.", "One, two, three.", "[all whispering] be appropriate.", "Now, break it up. We look weird.", "Okay.", "Don't move as a group. You're not gazelles.", "No, no, I said, \"millimeters.\"", "[laughter]", "[mouthing]", "Oh, ray, I'm gonna choke from laughter.", "You're too funny!", "[laughter]", "Yes, great humor words, raymond.", "You know, it reminds me of a very interesting article", "I read about human trafficking in the new yorker.", "No, it doesn't. Oh.", "The one written by david remnick.", "I loved that piece, from four weeks ago.", "Or was it three weeks? No, four.", "Anyways, I was riveted.", "I'm a huge new yorker guy.", "I could talk about that article for hours.", "Great. That's unnecessary.", "Let's do that right now.", "Let's do.", "Ah, there they are. Kevin, let's greet our guests.", "Oh. Mm-hmm. Duty calls.", "To be continued.", "Totes! Can't wait!", "[whispering] I can wait.", "All I remember about that article is the title.", "I was hopped up on nitrous.", "Well, we gotta find that magazine.", "It's gotta be in here somewhere, right?", "This place is like a candy store for nerds.", "Stop eating crab wrong!", "Ah, pepper relish on your arancini.", "Very playful. Cut through the richness,", "Add a little levity. I love that.", "You really know your food.", "Well, you could say it's the only thing", "I'm allowed to talk about.", "I'm charles. I work with captain holt.", "I'm vivian ludley. I work with kevin.", "No. The vivian ludley?", "Author of stone fruits and stone-stones:", "Food of the paleolithic era? I'm a huge fan!", "It's got the best recipes for making salads out of moss.", "The trick is, you have to lean into the dirt taste.", "Aha. Mm-hmm.", "Chickpeas, tahini, smoked paprika...", "They make their own hummus.", "Santiago?", "Sergeant!", "I'm learning so much.", "We both have blue hand towels, we have the same microwave,", "And once I buy coasters made out of geodes,", "We'll both have those.", "[laughs] yeah.", "No, hey! My notes!", "This is a birthday party, not a recon mission.", "You can get this back at the end of the night.", "all right.", "Let's go interact with these dummies.", "Wait here.", "What do you teach?", "Comparative historiography", "Of the french and american revolutions.", "Nope. How 'bout you?", "Molecular biology.", "Worse. What do you study?", "Abnormal psychology.", "So, like, weirdos and freaks.", "You should meet my friend.", "Hey.", "Gina, what are you thinking about right now?", "I was thinking how I would make the perfect american president,", "Based upon my skill set, dance ability, and bloodlust.", "That is fascinating.", "[giggles]", "\"ah-shan-ti.\"", "Oh, man, it's black tom selleck and white sidney poitier.", "[sighs] come on.", "All books and no magazines?", "What kind of crappy library's full of books?", "A crap library.", "All of the magazines are in the bathroom.", "Great solve, peralta.", "Ah!", "Can I help you?", "[clears throat] captain.", "I didn't hear you silently sneak up on me.", "Oh, that reminds me, tell kevin that I am available for brunch", "On Sunday the 17th.", "The 17th is a Tuesday.", "Why are you talking about the new yorker all of a sudden?", "I always talk about smart stuff.", "You know, the jazz age, what's in a name,", "The 1950s movies that are from the '50s.", "Those were the categories on jeopardlast night.", "Don't try so hard to impress my husband.", "Yes, sir.", "To the crap library.", "April 13th, may 2nd...", "Come on! Why doesn't my life always work out perfectly?", "[knock at door]", "Uh, just a second! I'm halfway done!", "I'm halfway there, I'm halfway done...", "With what's happening in here. Okay.", "♪ una furtiva lagrima ♪", "This song gets to me every time.", "It's beautiful. You must be so proud.", "I sure am.", "How long have you two been together?", "We've been partners for almost 30 years.", "So do you two ever get harassed at work?", "Harassed? For what?", "For being a gay couple who works together in the nypd.", "Bu-u-u-ooh...", "Peralta. Hey, don't you one-minute me.", "I will break that finger off. Hang up that phone.", "I'm talking to my credit card company.", "I tried to get an online subscription to the new yorker,", "And they declined me.", "Apparently, based on my previous purchases,", "They assumed it was fraud.", "That's crazy. I'm fancy.", "One time, I had coffee-flavored ice cream.", "Shut up! Okay.", "Hang up now.", "If you're that desperate, the first two paragraphs", "Of the article are on the free site.", "Hmm. You have one minute to look it up,", "And then if I catch you on that phone again...", "Oh, my. Don't worry.", "I'm due for an upgrade, and my babies are on the cloud.", "He is so strong.", "Ah, thank you.", "Lovely party, kevin.", "These tiny pickles are hilarious.", "They're called cornichon.", "So that new yorker article about human trafficking", "We were discussing-- yes, so interesting,", "Especially the first two paragraphs.", "Right, but what did you think of the thesis,", "Vis-a-vis modern slavery and its undeniable role in the economy?", "Good.", "If you ask me, the whole thesis was way off base,", "Vis-a-vis the rest of the article", "Vis-a-vis...America.", "The article was antislavery.", "Are you saying that slavery is good?", "You know, I think you're missing the point of the article.", "You must not be remembering it right.", "Well, I just read it last night as I got in bed.", "It's quite fresh in my memory.", "Ah. You know,", "I would like to hear more of your thoughts.", "And I would love to give them to you,", "But unfortunately, I have got to hit the crap library.", "Excuse me one second.", "My last meal on earth? Mm.", "That's a great question.", "I'd go classic french. Ortolan.", "Tiny songbird, eaten in a single bite,", "Bones and all in open defiance of god.", "It's illegal to consume ortolan,", "But I actually got academic dispensation to eat one once.", "Ohh. The beak, very crunchy.", "That is literally the sexiest thing anyone has ever said.", "How are you single?", "You're not seeing anyone?", "No. There is nobody in my life.", "Sort of a sad thing to wink about, I realize now.", "Aren't you supposed to be babysitting gina?", "Doesn't need my help.", "She's over there, dazzling some psychologists.", "All men are at least 30% attracted to me.", "My mother cried the day I was born,", "Because she knew she would never be better than me.", "At any given moment, I'm thinking about one thing:", "Richard dreyfuss hunkered over eating dog food.", "I feel like I'm the paris of people.", "complete overlap of ego and id.", "It's been theorized,", "But I never thought I'd see it.", "I'm exquisite.", "[laughs]", "[both moaning]", "I can't believe I'm frenching in the closet.", "[sighs] I feel like a teenager!", "I feel like I'm 40 again.", "Chew on this shiso leaf.", "[gasps] it'll give our kissing", "Umami flavor. [moans]", "[both moaning]", "Delicious. [sighs]", "Time to put my newfound knowledge to the test.", "So, sir, popcorn setting, always too short, am I right?", "I'm sorry?", "On our microwave. We have the same microwave.", "Oh, I didn't buy it. It came with the house.", "Hummus. Thoughts?", "I have no thoughts about hummus.", "If you'll excuse me.", "Yeah.", "Blink twice if you'd like me to mercy kill you.", "I thought I had done enough recon,", "But clearly, I have only scratched the surface.", "If I'm gonna bond with him,", "I have to massively violate his privacy.", "But truffaut wrote breathless,", "And I've always considered movies a writer's medium.", "I can't agree. It's godard's film.", "Come on!", "I mean, truffaut is also important.", "Seriously? Hold this, I gotta go.", "Wow. Maybe it is truffaut's film.", "Mighty dvr, tell me the captain's secrets.", "Unveil yourself to me.", "Ooh, how it's made: Contact lenses.", "Bingo!", "[door closes]", "What are you doing here?", "I--what? I'm not. What are you doing here?", "I need to find a new yorker that kevin left by the bed,", "So I can justify this whole proslavery stance", "I've backed myself into.", "[door opens]", "Detectives!", "sarge! I see that you,", "Like I, came up here to chastise santiago.", "Amy, this is low, even for you.", "I cannot believe you would both violate", "The \"please stay downstairs\" rule,", "Which was prominently posted!", "Get outta here!", "I don't know why we have to have this discussion again.", "What do we do?", "Bathroom! Bathroom.", "Why are you upset with me?", "Your employees are the ones putting a damper on the party.", "They are acting terribly.", "You're the one who's been acting terribly tonight.", "You've been curt and snobby with my guests.", "You've been needling poor peralta so much,", "You've practically made him a new suit.", "Needled him a new suit.", "Even when we're fighting, you're hilarious.", "Stop it. Stop it.", "[whispering] oh, no! Dog, allergies, sneezing.", "No! Get away!", "Shh.", "Grab the dog!", "Look at me.", "Do not blow this for us.", "you know what, I knew this wasn't going to work.", "It never has. We should've just gone out", "For dinner to a restaurant, like we do every year.", "Why did you make me invite them?", "I made you invite them because I like them.", "They're good people.", "[amy sneezes]", "Santiago, are you hiding in my bathroom", "With a dog that you're deathly allergic to?", "no.", "Occupied?", "Well, this has been a stinky 12 hours.", "My computer bag got a hole in the bottom,", "And my power cord fell out.", "Last night was such a disaster.", "I wheeze-cried myself to sleep.", "Well, at least captain said he liked us,", "Right before he kicked us out of his house", "For violating his trust.", "Why didn't kevin want to invite us?", "We could have been really cool people.", "We weren't, but we could've been.", "Well, as soon as he unveiled his \"no cop talk\" policy,", "I was sunk.", "Gruesome murders are the cornerstone of my charm.", "Well, he spent the last 30 years with a cop.", "Maybe he's sick of hearing about it.", "Wait.", "Maybe that's not what he's sick of.", "Santiago, you brilliant bastard, you figured it out!", "Hello again, professor kevin cozner.", "What do you want?", "I'd like to tell you about a case I solved.", "Thank you, but just as with my home,", "My office has a strict \"no cop talk\" policy.", "I figured, but the case that I have solved", "Is the case of the \"no cop talk\" policy.", "There were three things that bothered me about last night:", "You didn't want the nine-nine at your party,", "Even though you'd never met us,", "Your friends immediately asked hitchcock and scully", "If they were harassed,", "And there was something interesting", "About that photo in your library--", "You and the captain were shunted off to the side.", "I don't think you dislike cop talk.", "I think you dislike cops.", "[scoffs] I'm married to one.", "I know, and I can't imagine it's been fun", "Watching the man you love marginalized, underappreciated,", "And disrespected by the nypd.", "Because he's gay, raymond has been put through hell", "By his colleagues, many of whom,", "Quite frankly, look exactly like you.", "Devastatingly handsome?", "I'm sorry, I'm uncomfortable with emotions.", "So yes, I decided a long time ago", "That just because I love raymond", "Doesn't mean I have to love the people he works with.", "Good solve, detective.", "Nice cop lingo.", "Look, I'm really sorry that we ruined your party.", "I'd like to make it up to you.", "captain, thank you for joining us.", "What's going on?", "a proper birthday dinner.", "Amy chose the restaurant.", "Captain.", "Ah, perfect. I've always wanted to come here.", "boyle picked the menu.", "Vivian helped.", "Terry chose the champagne.", "I'm sorry about your party, sir.", "I tried to keep them in line, but I failed.", "Well, that's not your job. I'm only sorry", "You didn't get a chance to enjoy yourself.", "Gina has brought back all the silverware", "That she stole from your house.", "What? Also, this clock.", "Good heavens.", "This isn't ours.", "And my contribution will be to refrain", "From discussing the new yorker for the rest of my living days.", "Enjoy. Thank you, jake.", "You're welcome, kevin. Call me \"kev.\"", "Oh. What?", "Oh, he told you to say that, didn't he?", "Well, you are always playing pranks on me, raymond.", "Just once, let me be the funny one.", "[scoffs]", "And finally, it is my great pleasure", "To introduce the nine-nine zone detective scully", "To serenade you.", "♪ ma n'atu sole ♪", "♪ cchiu bello, oi ne'", "♪ o sole mio ♪", "♪ sta 'nfronte a te ♪", "This part always gets me.", "♪ o sole o sole mio ♪", "Not a doctor. Shh!"]