[">Ant. Ant. Ant.", "Ant. Ant.", "God, they're everywhere.", "Are we sure that we've cleaned up all the food and crumbs?", "Why is everyone looking at us?", "We're the ones who eat up all the crumbs.", "Yeah, we're the solution.", "Well, there are no ants on my desk", "because I sanitize it daily.", "What do you call that?", "Ah! Those are your ants!", "They're using a monitor cable as a land bridge.", "[grunts]", "Now they're destroying our technology.", "This is an invasion.", "They're in my yogurt.", "Now it's personal.", "All right, that's it. We have gotta fight back.", "This is our planet!", "Just use Boyle's cologne. It's repulsive to everything.", "Ah! Not cool.", "You're going to Penn Station to buy me a new one.", "They bite now, sir.", "to avoid the cold weather.", "We should freeze them out.", "The plan is working, Captain.", "Yes. We won.", "Oh my God. They're in the coats.", "They're in our coats!", "[everyone screaming]", "Sync &amp; corrections by Rafael UPD www.addic7ed.com web dl sync snarry", "♪ ♪", "Okay. I don't want Sophia to know", "that I'm waiting for her, so...", "Should we pretend to have a heated argument that I win?", "Oh, or better yet: a physical contest that I win.", "What's going on?", "I thought things were good with you and Sophia.", "[grunts] Jake.", "Did you do something dumb?", "That's a really good question, but actually no,", "I don't think so.", "It's just been a little weird lately.", "She's acting kind of distant.", "Have you talked to her?", "No, I don't want to seem desperate.", "Talking to her is desperate?", "Well, it's not breezy.", "-  - Hey.", "What are you guys doing here?", "Oh, just arguing about America.", "Did you know that the Sarge doesn't think", "we should have given women the right to vote?", "That is not true.", "Oh, sure, you say that now that she's here.", "But, hey, now that we've accidentally", "bumped into each other, what are you doing tonight?", "- You want to hang out? - Oh, I can't.", "I have that event for The Association", "of The Brooklyn Public Defenders", "Remember, you called it \"Satan's Charity Ball,", "- colon, Rise of the Demons?\" - Oh yeah.", "- Defense attorneys are monsters. - Oh.", "Uh, except for you. No, you're fine.", "Oh, that's so sweet.", "- Nice, right. - But I have a minute right now.", "You want to go take a walk in the park?", "Oh, a walk in the park. How romantic.", "And I know where all the murder spots are.", "Oh. Do you want to see them or avoid them?", "The choice is yours, m'lady.", "Terry, don't wait up.", "- It's 10:00 A.M. - Yep.", "Deputy Chief Wuntch is here to see you.", "Oh, please stay, Diaz.", "I need a witness in case her head starts spinning around", "or if she turns into a she-wolf.", "Hello, Raymond.", "No flaccid rejoinder?", "Hmm. What's going on?", "I'm here on important business.", "I'm a frontrunner for a job in the Boston PD.", "Boston? But it's so close to Salem.", "You do know what they do to witches up there, don't you?", "- This is amazing. - The job is Chief of Police.", "I see. So you've come to brag.", "No.", "The only blemish on my record", "is our long history of interpersonal turbulence.", "The Boston Commissioner would like", "to speak with you about it.", "I've come to ask for your help.", "The commissioner will be calling you.", "Wait. Shh shh shh shh shh shh shh.", "Oh. Moment savored.", "So, where were we? Ah yes, you were talking", "about how I hold your fate in the palm of my hand.", "[gasps]", "Oh, I'm sorry. I lost my balance.", "You think I'm bothered by a little spilled milkshake?", "I'm a food blogger, I'm stained all over.", "Okay, what is going on with you two?", "Well, you know how our parents have been", "tender-sexing each other?", "- Ew. - Precisely, Amy. Ew.", "Boyle and I made a pact to break them up,", "and now this sticky little gummy bear is backing out.", "Look, I know you don't want our lives intertwined,", "but things have changed.", "My father want to marry your mom.", "So you choose your dad over me, your coworker who hates you.", "Papa's a gentleman.", "He won't propose until he gets Gina's blessing", "And she won't give it to him.", "Who says \"papa?\" Are you a little French boy?", "[imitates French] Oh ho-ho-ho.", "I think maybe I can help.", "I took a seminar on conflict resolution and...", "I have been waiting weeks to bust this bad boy out.", "[inhales] [sighs]", "New binder smell.", "- Mm-mm. - Amy don't do this.", "I'm gonna throw a milkshake in your face.", "This is nice.", "I feel like old people.", "[chuckles] Should we sit here?", "Jake, there's something I want to talk to you about.", "So, my boss hasn't been assigning me any of the good cases,", "and I found out it's because I'm dating a cop.", "What?", "Did he actually say that?", "No, but my colleagues did.", "You know, everybody I work with think of cops as the enemy.", "That's crazy. They're the enemy.", "I see what you mean.", "Jake, I really like you,", "but my job's really important to me, too.", "Can we press pause on this?", "Press pause?", "Just until I figure out what to do with my boss.", "Is that okay?", "So this is just about your boss?", "Okay. Yes, let's press pause.", "Let's pause the hell out of this.", "Let's pause this like I pause", "Jamie Lee Curtis in Trading Places.", "I haven't seen that movie, but I'm assuming she's naked.", "Mm-hmm.", "\"Pause\" seems bad, Jake.", "Why aren't you more upset?", "Because Sophia's problem isn't with me,", "it's with her dumb boss.", "That's something I can fix.", "I'm gonna make him like me.", "Here is the target... Geoffrey Hoytsman.", "Now, according to the internet,", "his interests are: skiing, his terrier,", "Atlantic City, the film 12 Years a Slave, and nature.", "Obviously nature is super boring,", "and the slave film is a little bit dicey.", "- It's real dicey. - Yeah.", "So I will focus mainly on skiing and Atlantic city", "when I talk to him tonight at the fundraiser", "for The Association of Brooklyn Public Defenders,", "A.K.A. The Chamber of Asses.", "No, wait. That's too sexy.", "The Chamber of Snakes.", "Anyway, it starts at 8:00,", "so you should probably get dressed.", "What? I am not going to that.", "Please, Sarge. Just come.", "Do it for me. Do it for love.", "Damn, Jake. You know Terry loves love.", "- I'm in. - All right!", "Now put on your phoniest smile", "'cause we're going into the belly of the beast.", "Phonier.", "Phonier!", "Ah, there it is. Into the beast!", "[upbeat dance music playing]", "♪ I go to work ♪", "♪ ♪", "♪ I go to work ♪", "All of our worst enemies are here.", "Brown hair guy. Pony tail lady.", "Asian Don Cheadle.", "I refuse to learn their names because it humanizes them.", "But you'll never forget their smug lawyer faces.", "Each one brings back a specific, horrible memory.", "Incompetent!", "Idiot!", "Mint?", "I could have choked on that mint", "Even the nice ones are psychopaths.", "All right. Let's get fired up.", "- Pound on my shoulders. - That's my stuff.", "Wait! Wait! No, don't hurt me!", "Ah, that was a bad idea. I'll bang my own sulders.", "Let's go.", "I am grappling with a highly vexing conundrum.", "What to do about Deputy Chief Wuntch?", "Precisely.", "I could torpedo her promotion.", "Just saying it brims my soul with joy.", "But to do so", "would mean would mean that she stays here in New York City", "hanging over me like an albino bat.", "On the other hand, if I \"praise\" Wuntch,", "she will leave this city, the clouds will part,", "and the children will sing \"Wuntch is gone.\"", "What children?", "- All the children. - Right. That was a stupid question.", "What was Sarge's advice?", "Oh, you and I both know what Mother Jeffords would say.", "\"Take the high road.\" But I asked you,", "Detective Diaz, because you understand vengeance.", "Yes, I do.", "I had a nemesis once:", "- Carla Bianchi. - Mm.", "She wronged me, and I crushed her like a gnat", "between my fingers.", "I got her suspended from the second grade.", "- Second grade? - That little turd hoarded all the good markers.", "But eventually, she came back to school.", "And she made the next ten years of my life miserable.", "It's not worth it.", "Be nice to Wuntch.", "\"Be nice to Wuntch?\"", "You may go now, Mother Diaz.", "I hate this. Everyone is looking at us.", "Only because we're equally massive, beautiful men in tuxes.", "- Yeah. - Sophia.", "Heeeeeeey, girlfriend.", "That came out saucier than I was expecting.", "Yeah. Hey, Jake, What are you doing here?", "I thought we agreed to press pause.", "We did. I'm not here to see you.", "I'm here to see your boss, Geoffrey Hoytsman.", "- We're gonna bond. - Oh, God.", "- Oh, good indeed. - You misheard me on purpose.", "Possibly. Look, I'm gonna charm him.", "He's going to start giving you the good cases again.", "- This is gonna work. - No, it's not.", "How can I explain this? Oh, Okay.", "Imagine this room is full of super-intelligent robots...", "- Oh. - Hell-bent on ending humanity,", "and you are a working-class human", "who just entered their swarm-hive.", "Okay, love this, love you, keep going.", "Oh, that's a really weird moment", "to say you love me for the first time.", "- Oh no. - Was it?", "- I'm just gonna blow past that. - Yeah.", "Look, the point is, you can't charm robots.", "So you should go before they pod you and harvest your brain.", "Look, I've done my research on Hoytsman:", "Skiing, nature, Atlantic City, I'm ready for him.", "Sophia. Sergeant Jeffords.", "Detective Peralta.", "Please, my friends call me Jakey Snowpants,", "because I'm skiing so much. [chuckles]", "Carving moguls on a black diamond.", "I prefer cross-country skiing.", "It's not a sport if gravity does the work for you.", "Yeah. Gravity sucks.", "Not the movie, the theory. Anyway, I've been spending", "most of my weekends in Atlantic City these days.", "- Oh, that place is a dump. - No.", "Now, if you'll excuse me, I need to steal Sophia away.", "You can't charm the robots.", "What in the frig was that?", "He's always in Atlantic City.", "Why would he go someplace he hates so much?", "Unless there was something there he loves.", "I bet he loves gambling.", "Just like I'm here in this dump", "because of Sophia, who I now love.", "You're really going hard on this love thing.", "Well, I said it out loud. It's on the record.", "I can't take it back. Just get on board, Terry.", "- Hello, Gina. - Ah!", "What are you creeps doing?", "You made me look away from my phone.", "You better pray I didn't miss a text.", "In your two seconds you looked away?", "17 texts. All of them important.", "Amy suggested we negotiate terms,", "so if you agree to give my dad his blessing,", "here's what I'll do for you.", "\"You will never see me in my pajamas on a family trip.", "\"We will never share a bunk bed.", "\"And I won't force you to participate", "in our annual themed Christmas cards.\"", "This year my dad was Mary and I was the baby Jesus.", "Yeah, I know. Got one. Lived the nightmare.", "Well, the list goes on. I signed it.", "- Amy notarized it. - I'm a notary.", "No big deal. I met the comptroller.", "Okay, you know what?", "This isn't about out lives getting intertwined, okay?", "I'm actually worried about my mom", "'cause she's been hurt before.", "This is all moving way too fast.", "Wow. Gina.", "That's really sweet.", "And the only reason I didn't tell you guys", "is 'cause I don't value you as people,", "so it's, like, why be honest?", "Yeah, you just went back and ruined what you said.", "Right. Mm-hmm.", "Look, I know I'm a stage five player,", "just mowing down chicks left and right,", "but my dad's not like that.", "He would never hurt your mom.", "Just talk to him, you'll see.", "Fine. I'll talk to him.", "Just to ask him some questions.", "But go get him before I change my mind.", "- Okay. - Okay.", "Oh. I already changed my mind.", "- Aww. - All right, I'm back.", "- Oh. - Oh. I'm back.", "threw it out on the spot.", "[all laughing]", "That judge has a deep voice, right?", "I'm gonna go, uh, check out the food.", "Hey.", "Bet you five buck you can't guess", "three of the hors d'oeuvres they're serving.", "I'll take that action.", "Chicken satay, tuna tartare, shot glasses of gazpacho.", "Satay, tartare...", "no 'szpach.", "Where the 'szpach, Hoytsman?", "Yes! 'Szpach!", "- No! - Well played.", "Unless you want to go double or nothing.", "I'm listening.", "I'll bet you can't tell how tall the Sarge is.", "In eggrolls.", "24. Exactly 25 eggrolls tall.", "Celebration eggroll.", "Hey, man, that was on the floor.", "You're on the floor.", "60 bucks says you can't remove one glass", "without knocking the whole thing over.", "You didn't say I couldn't grab the top one.", "[glass shattering]", "Yes!", "100 bucks says I can jump from the roof and survive.", "Oh, I don't think you can...", "[chuckles] Just messing with you, Peralta.", "I gotta hit the head. Oh, then we'll bet on", "who can shove more shrimp in his mouth.", "You're on. I got a big mouth though.", "You're in trouble.", "I thought you were leaving.", "Were you just talking to Hoytsman?", "Talking. Bonding. Betting.", "Oh, I should bet him that I can pee for longer than he can.", "- Ugh. - The trick is to pinch it.", "All right. I'll be right back.", "Oh. Gotta fill up the tank.", "Ah! Hello Geoffrey.", "Hello.", "And that's cocaine.", "This night is making me incredibly anxious.", "Oh hey, stay close.", "Someone messed with the champagne tower.", "You're all I've got.", "Jake is stupid, but he's smart.", "I think his plan is actually working.", "- Oh God. - Hey, so,", "no big deal, but I arrested your boss,", "and I never should have come here.", "Well I read that wrong.", "Oh, this is insane. This is so insane.", "I wasn't doing anything.", "He was snorting cocaine in the bathroom.", "Okay, for the last time, that is not what happened.", "And that's cocaine.", "Are you sure? [chuckles]", "Five dollars says you're wrong.", "Let me get in there. Take a good look and smell.", "No, don't. [groans]", "Okay. It was cocaine.", "Turns out I was accidentally doing some cocaine.", "Not on accident.", "You put it in your nose on purpose.", "I don't even think I have a nose, Peralta.", "I certainly cannot feel it.", "The defense rests!", "Shh. Keep your voices down.", "What is going on here?", "- Nothing. - Nothing at all.", "Sophia's cop boyfriend is arresting me", "in front of my friends and colleagues.", "Hey, everyone. I'm Jake.", "So who here saw 12 Years A Slave?", "Best picture.", "You torpedoed her promotion?", "Sadly, no.", "I gave that goblin a good recommendation.", "Your story about the marketer really hit me.", "I began to realize that if even you thought", "I should take the high road, that was probably", "the right choice.", "I'm sorry you didn't get your vengeance.", "- Mother Holt. - Good one.", "But I am still planning to get some retribution.", "I got her a parting gift.", "Tickets to Wicked?", "In Boston.", "She's moving to a second-class city,", "and I wanted to rub her nose in it.", "Enjoy the understudies, Madeline.", "Have fun watching some chubby Chenoweth knock-off", "warble her way through Popular.", "Hello, Lynn.", "Hi, Regina.", "Don't play games with me, boy.", "This is a bad idea.", "No, it's okay. Dad's got this.", "He's a real sweet talker.", "Let's cut the crap.", "- Okay. - What are your intentions with my mother?", "To make love to her every morning until we die.", "So it's just physical?", "What are you nuts?", "I'm a divorced, retired florist", "with a terrible gluten allergy.", "Your mom is a beautiful, brilliant travel agent.", "She talks to people on the phone", "who've seen the whole world.", "I'll never meet anyone half as good as her.", "She's the best thing that ever happened to me.", "You mean other than Charles?", "No.", "She's the best thing that ever happened to me.", "That's okay, Pop.", "You did what you had to do.", "I love her.", "All I want is to make her happy forever.", "Fine. I give you my blessing.", "But if you hurt my mom in any way,", "so help me God, I will cut off your son's testicles.", "Snip, snip, snip. And I'm not playing.", "Deal.", "[chuckles]", "Way to go, Dad!", "You bagged a babe. [gasps]", "The Boyle boys are planning a wedding!", "Boyle boys! Boyle boys!", "Both: Boyle boys! Boyle boys!", "Both: [laughing]", "You screwed this up, buddy.", "You thinks she's gonna still love you after this?", "She'll see who you are now.", "Hey, you don't know anything about me and Sophia.", "What? I'm talking to myself about my wife.", "She is not gonna like this.", "Who cares about you and your gross life?", "Jake, heads up.", "Oh, hey, Sophia. Thank God you're here.", "I was just gonna find you so we could talk.", "Jake, I'm not here to talk to you.", "I'm here as Geoffrey's attorney.", "Oh, I can do it myself. Watch this.", "Objection, objection, objection, objection, objection!", "Five! Five objections.", "Maybe this \"cocaine\" isn't so bad after all.", "Okay. Geoffrey, I'm gonna have to", "advise you to stop talking/confessing", "in front of the detectives.", "Okay, look, I know that you're mad,", "but I talked to the D.A. and he agreed to drop the charges.", "Geoffrey just had to do a little bit of community service,", "and nothing will even go on his record.", "Not good enough. You have no evidence.", "Sophia, there's cocaine on his collar right now.", "Oh, not anymore. [inhales]", "Whoo!", "You're really not reading the vibe right at all.", "Tell you what, that's the cocaine.", "I'm usually very tuned in.", "- Shh. - I had to arrest him.", "- I had no choice. - Really?", "'Cause I could think of 50 other ways", "you could've handled this scenario.", "Oh my God, you are such a lawyer.", "You are such a cop.", "I tell you I need some space to figure things out", "and you come kicking down the door", "with the first plan that pops into your head.", "How is it my fault that your jerk boss", "put his jerk nose into a pile of jerk cocaine?", "You followed him into a bathroom", "at a party you weren't even invited to.", "Hey, you know what? We're done.", "All right, fine. I'll talk to the D.A.", "I'll see if I can cut the community service in half,", "- how's that? - No, Jake. Not with the case.", "You and I are done.", "[Jake panting]", "Jake, what are you doing?", "I wanted to stop you.", "Grand gesture. I took the stairs.", "- A little winded there, buddy? - Yeah.", "Romance is hard!", "Can you just talk for, like, 20 minutes", "while I catch my breath?", "I don't have anything to say.", "Oh come on.", "This is just a stupid fight about nothing.", "I'm not gonna let us break up over this.", "Jake, our jobs are incompatible.", "Our lives are incompatible.", "Look, we'll just never talk about work,", "or interact with each other's friends,", "or acknowledge each other in public,", "and I know this sounds like I'm describing enemies,", "but we can make this work.", "We're Romeo and Juliet.", "It didn't work for Romeo and Juliet.", "That play ends in a tragic double suicide.", "That's how it ends?", "Why do people like it so much?", "All right, look. Jake, you're fun, okay?", "And we've only been dating for three months.", "It's just not that serious.", "Well, it's kinda serious to me.", "I've accidentally said, \"I love you,\" like,", "four times already.", "I know. I-", "I just don't think I accidentally love you back.", "Look, it's just... it's just so much work.", "That's work I'm willing to do.", "I'm not.", "I'm sorry.", "Double suicide?", "Raymond. I was just about to call you.", "I wanted to thank you for your kind recommendation.", "And I wanted to give you this.", "Wicked.", "Starring Beth Danube.", "Well played, Raymond.", "Sadly, I won't be able to use them.", "Since I'm not going to Boston. What?", "I was only interested in the Boston offer as leverage.", "I used it to get a promotion from the NYPD.", "I have never had more power over you", "than I do at this very moment.", "I wanted to give you these as a thank you.", "You're joking.", "I'm gonna call the commissioner.", "Shh, shh, shh, shh.", "I know you never would have recommended me", "for that Boston post if deep down", "you didn't think I deserved the job.", "What the...", "A thank you round of drinks", "- and a toast to Amy. - Oh.", "Your conflict resolution skills", "has made my childhood dreams come true.", "I'm gonna be a ring bearer.", "You don't think your dad will make you best man?", "Oh, I just assumed he'd ask Jake.", "Mm. Move over, please. I do have a wedding to plan.", "'Cause if this thing is happening,", "it's not going to be a Boyle brothers event.", "For starters, all the bridesmaids", "are gonna be dressed like Roseanne", "from the television show, Roseanne.", "Oh, I like that show.", "A certified shaman will conduct the ceremony,", "and the ring bearer will be an actual wolf.", "Oh man, I could do it, but I wouldn't be as majestic", "on all fours.", "This wedding sounds weird. I'm into it.", "To Lynn and Darlene Boyle.", "All: Cheers.", "Yuck.", "My lady left me.", "My lady stayed.", "Come on, sir.", "Focus on the good.", "You can hold your head up:", "you took the high road with Wuntch.", "Not entirely.", "When I was alone in her office, I changed her auto-correct.", "Now when she types \"Wuntch,\" it gets replaced with \"Butt.\"", "Ah, I should not have gone to that party.", "I shouldn't have gone to that bathroom.", "I should not have arrested her boss.", "I don't see it that way.", "You did everything right. You were a good cop.", "Good lonely cop.", "Hey, man, you put yourself out there.", "You weren't breezy.", "You like Sophia, you fought for her.", "You should be proud.", "No, you should be changing her auto-correct.", "What's her last name?", "- Perez. - No.", "It's \"Butt\" now.", "Sophia Butt.", "That's feels good, doesn't it?", "Not really.", "Okay.", "Then let's get soused.", "Ah, okay, okay, okay, okay, okay, okay, okay.", "Mine. Mine.", "Sync &amp; corrections by Rafael UPD www.addic7ed.com web dl sync snarry"]