[">Gregor minsk, the counterfeiter I've been chasing", "For two years, has finally resurfaced.", "And he's just as evil as ever.", "Right. You hate him because he has a typo", "On his counterfeit bills.", "No. Because he passed $4 million", "In fraudulent bills, jake.", "But also, two rs in \"pluribus?\"", "I mean, did none of those cashiers take latin?", "Okay, let's give amy a round of applause", "For whatever that was.", "Police briefing. Still in progress.", "And you did great.", "But let's get serious, people.", "Tomorrow is the wedding.", "My mom is marrying, shudder,", "Charles' dad, toilet emoji.", "We are gonna be brother and sister.", "To think this started with us just going to town", "Or each others sexy parts.", "[all groaning]", "Charles, promise me that is not in your toast.", "It's not.", "Come on, man.", "Look, I need everything to be perfect.", "Status update, rosa.", "How are the flowers?", "I don't know.", "Yellow. Terr-bear?", "I had my tuxedo altered", "To make it tighter like you wanted.", "Delicious.", "Jake, have you checked in with the jeweler?", "Yes. They said the ring", "Will be ready at 2:00 on the wedding day.", "I'm gonna pick it up on my way to the ceremony.", "This is very important, jake.", "Are you sure you can handle it?", "Uh, well, let's see.", "Easy, last-minute, and crucial as hell.", "Meets all the peralta criteria.", "Good. These tasks", "Are top priority around here, people.", "I don't care how many criminals go free.", "All right? Dismissed.", "Uh, I'm not done with my briefing yet.", "I said dismissed!", "[upbeat music]", "♪ ♪", "Guys, guess who I'm about to see.", "The bubes? Michael buble?", "Okay, you're the only one who calls him that.", "And no. Jenny gildenhorn.", "The girl who dumped you at your bar mitzvah?", "Yes. I can still see her slow-dancing with eddie fung.", "[air supply's all out of love] ♪ I'm all out of love ♪", "♪ I'm so lost without you ♪", "I'll never forgive that bitch for what she did to you.", "Well, you better forgive her because she's about to become,", "Uh, my girlfriend.", "Turns out gina's mom is friends", "With jenny gildenhorn's mom,", "And jenny is gonna be at the wedding.", "That's right. I'm finally gonna get", "The slow-dance that fung denied me.", "Is she even single? Uh-huh.", "For the first time since we were 13.", "Eddie fung was replaced by colin brandow,", "Then ethan stokes,", "Then tanya astor, don't tell her mother,", "Then she met her husband, matt hench,", "Who she divorced three months ago.", "Probably because he's a major loser.", "I mean, assistant u.S. Attorney? Get a real job.", "You really kept tabs on her, huh?", "It's most of what I do here.", "A-ee. A-ee. A-ee. A-ee.", "What's happening? Is charles having a stroke?", "No, he's warning me you're here", "So I won't talk about other girls.", "Just thought it might be weird for you,", "Because of your history.", "It's not weird at all. Yeah.", "I told amy I liked her, she told me she was deeply", "In love with me, and it's all in the past.", "I did not say \"love\" or \"deeply.\"", "It's in the past, amy. Move on!", "Rosa, I had a question about marcus and the wedding.", "I'm not bringing marcus.", "You guys broke up, huh?", "Mm, just hit it and quit it.", "We are so similar.", "We did not break up. I'm just not totally sold", "To some stupid wedding where he might get", "All romantic and say, \"I love you.\"", "I mean, what am I supposed to do then?", "Say \"I love you\" back?", "I've only said \"I love you\" to three people.", "My mom, my dad, and my dying grandpa.", "And one of those I regret.", "Which one? Grandpa.", "He beat cancer, so now I look like an idiot.", "Wow, man.", "Would either of you like a starring role", "In the wedding of the century?", "I already told you, I'm not go-go dancing.", "Well, someone's getting in that cage.", "But more importantly, my mom's priest dropped out,", "So I need one of you two to step up.", "[sighs] who would be better equipped", "To deliver a heartfelt, emotional speech about love?", "I have to imagine it's not me.", "I could do it. I'm already ordained.", "Mario, karen, yesterday was chest and shoulders.", "Today, and for the rest of your life,", "It's heart and soul.", "Smart. You tailored the ceremony", "To the bride and groom's interests.", "Yeah. Yeah. That's totally what I was doing.", "I mean, working out is not the only thing", "I feel comfortable talking about.", "Uh, what would you say is your mom's favorite move at the gym?", "My mom likes champagne, baked ziti, the bahamas.", "Charles's dad probably lives under a bridge", "And uses a puddle as a mirror.", "I don't know. You figure it out.", "Okay.", "I got the ring. Let's go.", "Okay, thanks. Try to stay off heroin.", "Your mom? No.", "That was my informant. She spotted my counterfeiter", "Four blocks from here. We have to go check it out.", "Uh, but I wanted to get to the wedding early", "And reserve a seat so jenny can sit on my right side.", "I'm been practicing my crying", "And it turns out this is my juicier duct.", "Please? I've been chasing this guy for two years.", "What if it was your collar?", "I would have caught him nine months ago", "In a shootout on top of a ferris wheel.", "Minsk is my nemesis.", "He's my eddie fung.", "Fung.", "All right, that I understand.", "We'll check out your lead,", "Then we'll go to the wedding.", "Let's go find eddie fung.", "Minsk. Right. Minsk.", "Fung.", "Oh, regina, everything is so beautiful.", "Well, as long as you're happy, I'm happy.", "rosa, ah, there you are.", "Can you help my dad with his cuff links?", "Sure. I would do it, but it's bad luck", "For a boy to see his father on his wedding day.", "Oh, well, in that case, no.", "Rosa, please. It's a slippery slope", "From uncuffed sleeves to lynn just wearing", "An old turtleneck down the aisle.", "Actually, my dad can really rock a turtleneck.", "Gives him a sexy elliott gould vibe.", "Charles, shut up.", "Rosa, go find lynn boyle and cuff his ass.", "There you go. Thanks. [chuckles]", "You nervous? Oh, not at all.", "I love darlene linetti with all my parts.", "Wow. I can't ever imagine", "Being with someone and not having any doubts.", "I have little doubts.", "Tiny little doubts.", "You think that's a problem?", "I mean, not if you're sure she's the one.", "Yes. Of course.", "But I was sure about my five other weddings, too.", "[chuckles] please, don't tell charles.", "He only--he only knows about three.", "Back-to-back catfish situations, you know?", "Same kid both times actually. That's okay.", "Just took you a while to get it right.", "Yeah, or maybe I'm just doing the same thing", "Over and over again. [chuckles]", "Lynn boyle rushes headlong into another mistake.", "Like that time I tried water aerobics", "And I broke my neck.", "This is a disaster.", "All right, I'm gonna go get charles.", "I wonder what jenny gildenhorn will be wearing tonight.", "Do you think she'll be in her high school", "Field hockey uniform? That'd be crazy, right?", "Yes, it'd be crazy if that's what she wears to a wedding.", "Yeah, you're right.", "Ah, well, I hate to say it, but there's no sign of minsk.", "We should really get going. Jenny awaits.", "Oh, my god. Look!", "Fung. Minsk!", "Right, minsk. I know it's minsk.", "Let's go!", "He's gotta be in here somewhere.", "Clear.", "I love this. Tux on, gun out.", "I feel like james bond", "And you're my mysterious femme fatale", "That I've been partnered with, maxi pads.", "Maxi pads? I don't know!", "I didn't want to make the name too sexual", "And I panicked!", "Clear. If we catch this guy", "In the next 15 minutes, we can still make the wedding.", "So what's your opening line gonna be with jenny gildenhorn?", "I was thinking I'd go with, \"jamie gordenhorn?\"", "You know, make it seem like I haven't been staring at her", "On the internet for the past 20 years.", "Or you could call her by her real name.", "Girls like that. I don't know.", "I think girls like being deceived.", "No? Okay.", "Clear.", "So, you're really okay with me and jenny gildenhorn, huh?", "Totally.", "Stuff with us is in the past.", "We talked about that. I know.", "But that was before you saw me in this dope-ass tux.", "I mean, you must be freaking out.", "Oh, I am. I'm really into rented clothes.", "I love how many butts have been in them.", "I know you're making fun of me,", "But that sexy voice is kinda getting me going.", "But more importantly, this is a fancy outfit, all right?", "I sprang for the three button jacket.", "It was $8 extra.", "He's heading for the alley.", "Whoa, hey. Dad, it's your son under here.", "Charles boyle.", "Rosa said you had a personal question.", "No, I'm not. I'm not. I'm just second-guessing", "Every decision I ever made.", "Oh, my god, why did I buy a cube-shaped car?", "Because you love it. Dad, listen... Oh!", "Let's just sit down-- oh!", "Screw a 2,000-year-old tradition.", "I'm taking the bag off.", "[gasps] okay, dad, listen.", "Everyone gets nervous. Everyone gets cold feet.", "I was nervous before I married eleanor.", "She ended up cheating on you", "With the guy from the mattress commercials.", "Sleepy stu? Don't bring up sleepy stu.", "Rosa thinks I should call off the wedding.", "That is not what I said.", "This is why I don't talk to people.", "I just asked him if he was feeling nervous.", "Rosa, you know how suggestible boyle men are.", "I saw one samuel l. Jackson movie,", "And I work a kangol hat for three years.", "Ah! There has been a mix-up", "And the caterer has cooked one of the doves,", "So I need some good news.", "How is that speech going?", "Do you want to hear it? Yes.", "\"darlene and lynn,", "\"I want you to remember the words of luther vandross:", "\"'a thousand kisses from you--", "[voice cracking] \"'a thousand kisses from you", "\"'is never too much--'\"", "Every time he reads it, he breaks down.", "I thought you had done this before.", "Well, yeah, but that was just workout metaphors.", "You told me to get gorgeous with it,", "And it took me to some very real places.", "Terry, I'm sorry, but you're fired.", "Captain, the speech is yours.", "It needs to be emotional and poetic.", "Can you do it?", "Well, my first captain", "Used to call me emily dickinson.", "Great.", "Of course, he meant it as an insult about my sexuality,", "But don't worry.", "I am good at emotion.", "Nypd! We know you're here, minsk!", "Freeze!", "Hey! [grunts]", "Gregor minsk, you're under arrest.", "Oh!", "I can't let jenny see me like this.", "I ripped my cummerbund.", "It's okay. I have an extra one.", "You can borrow it.", "From my high school jazz band uniform.", "I'm only gonna tell you this", "Because you were a great partner today.", "Uh-huh?", "I played french horn.", "I still do.", "Oh, whaaaaaaaaat?", "The guests are all here and nothing is ready.", "We don't have a ring, the cake says, \"darlene and lunn,\"", "And the smoke machine is not working.", "I could crouch by the altar and vape.", "You are a stone-cold atrocity.", "Okay, we just need to make sure nothing else goes wrong.", "Charles... Hmm?", "Where is your dad? Where is lunn?", "Um, he's still having a little trouble with his cuff links.", "You know us boyle men and our clumsy ham hands.", "Please say you're not gonna reference", "Your ham hands in your toast.", "Well, you made me take out the brother-sister sex stuff,", "So there was this big hole on page 18.", "Page 18? Made it!", "Made it in time. Ew, amy!", "Your dress is filthy.", "Luckily I brought you a spare outfit. Hmm?", "I knew I was gonna hate whatever you chose.", "Oh, my god. It's jenny.", "She's here. Okay, how do I look?", "You look great. Go get her, bond.", "Thanks, maxi pads.", "Jenny gildenhorn?", "I didn't know you were coming to this.", "Jake peralta? Yeah.", "Oh, my god. How are you?", "I'm good. I'm good.", "Wow.", "Oh, sorry I'm a little bit ruffled.", "I arrested a very dangerous counterfeiter on my way here.", "Ah, look at that.", "One of my three jacket buttons is unbuttoned.", "Must have happened during the fight.", "That's embarrassing.", "Hey, I don't know anyone here. Want to sit together?", "Uh, yes, I would.", "After you.", "Uh, jake, wait!", "What are you doing? Give me the ring.", "[chuckles] you sound like gollum.", "That means nothing to me. I don't see those movies.", "I'm too pretty. Okay.", "Well, not to worry.", "I've got the ring right here.", "Nope. Those are my mints.", "I eat mints. No big deal.", "Um...Uh-huh...", "I lost the ring.", "Oh, my god. Oh, my god.", "I'm so stupid! No, it's my fault.", "I made us go after minsk.", "Please don't climb in here.", "I don't want you smelling like garbage", "For your slow-dance with jenny gildenhorn.", "Oh, don't worry. The only thing", "I'm gonna smell like is the jason priestly cologne", "I wore in middle school.", "It's just called \"brandon,\" and it is overpowering.", "[gasps] jake! Look!", "Oh, my god! You found it!", "And you're on one knee.", "Are you proposing? Yes.", "Will you, jacob peralta, accept this ring", "And bring it with me to our weird friends' parents' wedding?", "Yes. A thousand times, yes!", "Oh!", "[grunts] tight.", "Yeah, it's so tight, dawg.", "And no, I mean the ring is actually tight.", "[grunts] amy, it's stuck.", "The ring is stuck. No, no, no, no, no, no, no.", "Let me try. We have to get this off.", "Jenny's gonna think I'm married.", "Also it'll ruin lynn and darlene's wedding.", "Yeah, yeah, yeah, it's just us here.", "You don't have to pretend like you care about them.", "Okay. Jake has the ring.", "I found an extra place setting for your psychic.", "Strange, she said you wouldn't be able to.", "Because she's a fraud.", "You need to start seeing my psychic.", "Best of all, I fixed this!", "it's working! How'd you do that?", "I grew up with a smoke machine in the apartment, charles.", "I liked to enter the kitchen in the morning with vivacity.", "Regina, you're amazing. Everything's just perfect.", "Thank you for making this the third-best day of my life.", "Third?", "First was having you.", "Second was sleeping with a roadie", "For the steve miller band.", "oh! I love you, mom.", "I love you. I love you.", "[both smooching]", "Grab some of those if you're throwing 'em out.", "Mwah! [grunts] mwah!", "My mom. [clears throat]", "You did so great.", "I, however, hit a small snag.", "[sobbing]", "No! Do not take off that tux, lynn!", "What are you doing? We had a deal.", "I said, \"if you hurt my mother,", "I will cut off your son's testicles.\"", "You're right. Cut 'em off!", "No! Okay.", "As much as I would love to do that,", "I would like my mom to be happy.", "So can you please have a seat? Mm-hmm.", "And just explain to me what is going on.", "I'm worried I'm just rushing into this.", "I barely know your mom.", "I don't even know her favorite kind of soup.", "Is it tomato?", "Nobody likes soup, lynn.", "You're a family of soup-haters.", "What have I done? Look.", "Do you know why my mom loves you?", "Because you take big risks.", "Like how you got her that dog on your second date.", "[chuckles] those kind of things", "Just blow up in my face half the time.", "I mean, the dog worked out great, but--", "The dog was a disaster. She hates it.", "But she loved that you took that shot.", "Do you know who never, ever rushes into anything?", "Cowards.", "That's exactly right, rosa.", "Cowards. And you're a weirdo.", "I'd call you a hobbit... Yeah.", "A human pile of mashed potatoes... Mm-hmm.", "But you are no coward, lynn boyle.", "Lynn linetti. I'm taking your mother's name.", "Oh! You're making this hard.", "My mom loves you. You love her.", "Now follow your big, weird heart.", "Oh, you're right.", "It's time for a wedding!", "Pants, dad! Pants!", "A wedding with pants! Yeah.", "Wedding's starting soon. How are things going?", "But I'm having some trouble with my speech.", "All I've got so far is a poem.", "Ooh, a poem. Sounds romantic.", "\"marriage is a contract between two adults", "Of different families.\"", "It's a haiku... And a fact.", "It works on two levels.", "Uh, it feels a little impersonal.", "What did the officiant say when you got married?", "Not much. When gay marriage was legalized,", "We weren't sure if or when it was gonna be struck down,", "So speed was of the essence.", "Do you, kevin-- yes.", "And do you-- yes, yes, we do!", "We're married!", "I remarked afterwards", "That I wished the officiant had been more efficient.", "[chuckles] it was very funny.", "Kevin still talks about it.", "Aha! Maybe I should open with that zinger.", "It is amazingly funny. Oh.", "I'm just not sure this is the right crowd for it.", "No zinger? No haiku?", "Then I have nothing. Maybe I should wing it.", "Love: It sustains you.", "It's like...Oatmeal.", "Okay, okay. Not bad for winging it.", "I lied.", "Took me two hours to write that.", "How do I look? Oh!", "You look incredible!", "Up high! Down low!", "butts, butts, butts.", "You're the worst family in history,", "But at least you're ready.", "Scully's run out of songs.", "Right now, he's singing.", "♪ don't, don't, don't, don't ♪", "♪ don't you forget about me ♪", "Best rock and roll song ever written.", "tied with kokomo.", "Hey! So we have good news", "And we have great news.", "The good news is we found the ring.", "The great news is we'll never lose it again.", "What are you trying to say?", "The ring is stuck on his finger.", "I told him not to be cute about it.", "I'm cute about everything.", "Okay, okay, what do we do?", "I could pull the ring off,", "But it might hurt your little fingers.", "That's fine. I just won't look", "So I don't know when you're gonna do it.", "Jenny! No!", "[bone pops] [screams]", "To carry me bodyguard-style, so...", "Absolutely not.", "20 years later and I've been funged again.", "She funged me!", "She doesn't seem that great.", "We just saw her making out with a guy", "She barely even knows.", "No, it's not her fault.", "Did you see that guy's tux jacket?", "Four buttons.", "We did this. Our sex made this happen.", "Charles, mic's on. We can hear all this, bud.", "I'm captain raymond holt. Welcome.", "Marriage is a contract...", "But it's so much more than that.", "Marriage is love.", "It's commitment,", "It's joy, it's understanding,", "It's patience, it's anger,", "It's reconciliation, it's everything.", "It's like oatmeal.", "It...Sustains you.", "Darlene, do you take lynn to be your lawfully wedded husband?", "I do.", "Lynn, do you take darlene to be your lawfully wedded wife?", "I do.", "I now pronounce you husband and wife.", "You may kiss the bride.", "[cheers and applause]", "Yeah! Get it, daddy!", "[applause continues]", "Yeah!", "I gotta hand it to you, captain.", "That was some ceremony.", "It wasn't difficult.", "I simply said what I wish had been said", "When kevin and I got married.", "Oh, then I never would have heard your hilarious", "\"efficient-officiant\" quip.", "Mmm, you're right. I regret nothing.", "But all this does make me think I might enjoy a more...", "Festive expression of our commitment to one another.", "Are you suggesting we hold an honest to goodness wedding?", "Nothing too elaborate.", "We're not the kardashian-wests, after all.", "They are a musician and a celebrity personality", "Who recently wedded.", "Yes, yes, I know.", "They were answers on jeopardy.", "I think you mean questions.", "[both laugh]", "You guys are fun.", "He's not playing my playlist.", "Congratulations, charles. Marcus!", "Rosa said you weren't coming.", "Yeah, I wasn't.", "Just got the call about an hour ago.", "Oh, but, hey.", "I'm dvr-ing bones, so no spoilers.", "Don't worry. I don't watch.", "Too scary.", "I'm gonna ask the dj to play kokomo,", "And get this place turnt up.", "So...I didn't ask you to the wedding", "Because I was being a coward.", "I was scared things were moving too quickly,", "But I don't give a crap.", "I love you.", "That's all I wanted to say.", "If you had plans tonight, you can get out of here.", "I love you too.", "Doesn't have kokomo.", "You guys are in the middle of something.", "I'm gonna go to the car, get my cds.", "[air supply's all out of love] ♪ I'm all out of love ♪", "♪ I'm so lost without you ♪", "How is this song playing?", "♪ I know you were right ♪", "♪ believing for so long ♪", "[sighs] hey.", "Sorry you missed your chance with jenny gildenhorn.", "It's not a big deal. She's just a girl", "That I've been obsessed with since I learned what love was.", "Well, we got the bad guy today.", "Thank you for helping me.", "And I know it's not jenny gildenhorn,", "But if you wanted to slow-dance tonight,", "I know somebody who'd be into that.", "Okay.", "Perfect.", "This is gina's great-aunt susan.", "Hi. She's been asking about you all night.", "She thinks you're very handsome. Says you have a dancer's frame.", "Well, you have a good eye, milady.", "Shall we?", "[sighs] oh...You.", "♪ I'm all out of love ♪", "♪ what am I without you? ♪", "♪ I can't be too late ♪", "She's very handsy.", "Not a doctor. Shh."]