[">No! No, no, no!", "You can't take her from me, you bastard!", "Don't do this, Scully.", "You have to be strong for her right now.", "What's going on?", "Unit's being replaced.", "Come on! No!", "That machine's been here forever.", "It's basically part of the force.", "Take Scully instead.", "Yes, please, take me to the land of vending machines.", "Can we at least have five minutes to say a proper good-bye?", "Whatever.", "Let me just start by saying", "that this machine is the best restaurant in Brooklyn,", "and it always had a table for me.", "I knew just where to punch it to get free food.", "Now I have to go back to punching Hitchcock.", "Look, she still has the bags of baby carrots", "I requested they put in.", "They're black now, but they're there.", "Good-bye, beautiful machine.", "Thank you for your service.", "Okay, squad salute.", "You can take her away now.", "Well, I think we handled that with dignity.", "Free candy!", "Okay, Nine-Nine, say hello to Michael Augustine,", "Brooklyn's most prolific identity thief.", "Last week, he walked into a government building", "and stole a computer containing", "over 100,000 social security numbers.", "My C.I. says that tonight Augustine", "will be handing off the laptop to a buyer from China,", "AKA the Land of Dragons.", "Make sure that phrase is not in your official report.", "Okay, sorry, The Country of Dragons.", "I want you and Santiago to tail Augustine", "until he makes the drop, and then arrest him and the buyer.", "Sounds good, although I could probably just take Boyle.", "I know Amy has a ton of work, so...", "- No, I don't. - Really?", "I could have sworn I overheard you telling Rosa,", "\"Girlfriend, please.", "I got hella open cases.\"", "That's something you think I said?", "Word for word.", "No diggity, no doubt.", "That's enough.", "Peralta and Santiago will tail Augustine.", "Boyle and Diaz will join them in a surveillance van", "unless you have a problem with that.", "Sounds great.", "In the immortal words of Amy Santiago,", "\"Girlfriend, please.\"", "Hey, did I do something to you?", "Are you mad?", "Is this because I brushed all the crumbs off your desk?", "What? No, I don't care about that.", "- Do you know where they are? - In the trash.", "All right, if it's not that,", "then why are you trying to keep me off this case?", "Oh, that.", "All right, look, the reason that I didn't want", "to work with you is... should I do this in an accent", "so that I can undercut some of the awkwardness I'm feeling?", "- No. - Good call.", "Remember when you told me that you didn't want to date cops?", "That really bummed me out, man.", "- Jamaican? - Yeah, it was a bad choice.", "I'm much better at German.", "All right, fine.", "I was kind of thinking about asking you out.", "Oh, okay.", "But I know that that's not what you want,", "and I totally get it.", "I think it just took me a while to totally-totally get it,", "and now I totally get it.", "Jake, this is weird.", "The whole point of me not dating cops", "is so it wouldn't be weird at work.", "Okay, so let's just make it not weird, right?", "This is a case; we work cases together all the time,", "and we're really good at it, so, you know, we're professionals.", "That's all I want, for us to be professional.", "We're in agreement.", "It will be good and professional.", "Come in and shut the door.", "I have some news, which you must promise to keep secret.", "Madeline Wuntch is making me head of public relations", "for the NYPD.", "I'm being forced out of the Nine-Nine.", "I don't wish to make a big deal of it,", "so please limit your reactions to one second; go.", "- What in the world? - Are you kidding?", "That's plenty.", "You can't leave us.", "I'm not going anywhere.", "Madeline's not some invincible succubus.", "She's a regular succubus, and she can be defeated.", "We just need to find the letter.", "What letter?", "Before our current police commissioner was hired,", "a mutual friend told me Madeline wrote a letter to the mayor", "telling him it was a mistake.", "She apparently called her now-boss a \"simpering buffoon\".", "Amateur; always say your insults to someone's face.", "No paper trail.", "A copy of that letter exists in the mayor's archives.", "I can't go snooping around without alerting Madeline,", "so it won't be easy, and we don't have much time,", "but I need you to find that letter.", "Are you with me?", "Oh, hell yeah.", "I'm turning my phone into airplane mode.", "Oh, my God, she doesn't even do that on airplanes.", "Rosa,", "I know you don't like anyone wishing you a happy birthday,", "so crappy day to you.", "Still too much.", "I assume you're not doing anything to celebrate tonight.", "Anyone over the age of six celebrating", "a birthday should go to hell.", "So since you're free, I need your help moving", "this old Ms. Pac-Man machine I just bought.", "Why are you so obsessed with that game?", "Because it's the sexiest video game ever.", "She's insatiable, Rosa.", "Insatiable. Insatiab...", "Stop saying \"insatiable.\"", "Anyway, I bought this old machine from a bar,", "and I was hoping you'd help me move it.", "- You want me to go to a bar? - Mm-hmm.", "You are obviously trying to get me", "to go to a surprise party.", "Did Marcus put you up to this?", "What? No, that's crazy talking.", "We just need to be there at exactly 9:45 p.m.", "and not a minute earlier.", "Also, there's a particular door I want us to enter through.", "Why is he getting out here?", "I thought your C.I. said the drop was happening in a park.", "Maybe he's having dinner with his sidepiece first.", "Augustine has the laptop with him.", "We should just arrest him right here.", "No, the buyer's the bigger collar.", "We've got to follow him in and wait for the handoff.", "Okay, if you're going in,", "I've heard this place has an amazing bone marrow custard.", "Not that I've ever had a bad one.", "No. All right, let's go.", "No, wait, we look like cops.", "We're never gonna blend in dressed like this.", "Okay, there, how's that?", "Uh, I don't know.", "All I see is clothes hanging off of a genderless blob.", "You look fine. Here, wear this.", "Jake, you need a jacket or something.", "Well, Scully left his sports coat back there.", "Oh, but it will never fit Jake's athletic body.", "- Unless... - No, I don't want to do that.", "- You have to. - I'm not gonna do it.", "You're doing it.", "What? What do you have to do?", "Don Johnson it.", "Don Johnson it!", "I look like an idiot.", "I didn't even have time to lotion my forearms.", "It's so weird wearing Rosa's jacket.", "There's a piece of barbed wire in the pocket.", "Cool.", "All right, do you have a visual on... the hostess stand?", "Hi. Table for two, please.", "I'm so sorry. There's nothing available.", "We're totally booked up.", "Oh, no, that's horrible.", "Tonight's a really important night for us.", "Johnny and I just got engaged,", "and this is where our first date was.", "Oh, yeah, it would mean so much to Dora and me.", "I would have made a reservation,", "but I didn't know if she was gonna say yes, so...", "Oh, I love how nervous you were, you little goose.", "You are just so sweet together.", "You know, I'm sure I can find room for two young lovers.", "Yeah, we are lovers... together... in beds.", "Okay.", "Thank you so much for waiting.", "- Your table is almost ready. - Great.", "Sorry about springing the engagement", "and romantic stuff on you.", "No, no, no. That was great.", "I mean, it's what got us in here.", "Cheek kiss was a bit much. Very wet.", "Well, I don't know what to tell you.", "Dora's sloppy.", "Okay, and if you'll just follow me.", "Well, the honeymoon's over, Dora.", "We're back to being Jake and Amy,", "two normal cops working a job.", "All right, there you go.", "Thanks.", "You're the couple that just got engaged.", "That's us, Johnny and Dora, a couple for sure.", "Okay, according to my sources in the assistant community,", "the letter is right here in the fourth-floor archives,", "cabinet J-13.", "Nice job. What's the plan?", "You sneak in and get the letter.", "I'll distract the file clerk.", "Apparently, he's very into bird watching,", "so talking to a woman should blow his mind.", "And talking to this woman, it could kill him.", "Here, can you look at this map of a park", "and tell me where them hot birds hang out?", "Well, you're gonna want to, uh, avoid the, uh,", "great lawn, because it's basically just grackles.", "- Ugh, grackles? - Yeah.", "I hate grackles.", "They're the worst.", "Well, a lot of people think grackles are just a common bird", "up here, but you know what?", "On the West Coast they don't get grackles.", "Can you give some more info", "for a novice bird watcher such as myself?", "You have got to know the difference", "between your water birds.", "I mean, so many people don't know the difference", "between an anhinga and a snake bird and a swamp hawk.", "A lot of people don't know they're all the same bird.", "Are those the ones that sound like Rihanna", "kind of when they sing?", "I'm not familiar with who that is.", "They're like, \"Eh, eh.\"", "That sounds like that might be a crested woodpecker.", "Or is it more like...", "Well, that's a crested titmouse maybe?", "Oh, my God, that's it.", "Wayne, you are a damn treasure trove.", "We got the letter.", "Well done.", "Now get me Madeline and a bucket of water.", "It's time to melt a witch.", "Who else is going?", "Rosa, listen to me, there is no party.", "Just get off my doughnut already.", "Don't lie to me, Boyle,", "or you will be eating your bone marrow custard through a straw.", "That's exactly how you're supposed to eat bone marrow...", "- Charles! - Ah!", "All right, there's a party.", "I can't give you details.", "All I can say is I know you,", "and I know you'll have a good time.", "If you knew me, you'd know I hate surprise parties,", "so clearly you don't know me at all.", "What? We're friends.", "I was building up to calling you \"Ro-ro\" one of these days.", "That will never happen.", "In fact, you just lost \"Rosa\" privileges.", "From now on, you can call me \"Diaz\" or \"Hey, you.\"", "Come on, Rosa.", "Come on, hey, you.", "Wow, champagne and oysters.", "You really shouldn't have, guys.", "Well, it's a special night.", "So when did you guys meet?", "- Last year. - Five years ago.", "We first met five years ago,", "but we don't count it, because...", "I was dating a speedboat model at the time.", "And I was dating a super handsome comptroller", "of a major U.S. city.", "Anyways, about a year ago, we bumped into each other at a bar,", "and we haven't been able to keep our hands off each other since.", "Mm.", "So how did you know she was the one?", "I'd love to answer that.", "Um, you know, just whenever I look at her face", "and the attached physique.", "And you?", "Uh...", "He makes me laugh.", "And, you know, there's really no one else's opinion", "who I care about more than hers, so...", "Okay, so enough chitchat Let's see the ring.", "I don't have it on me.", "She has gigantic fingers.", "What I mean to say is that the ring I got", "would never have fit on her fingers,", "because they are that of a giant, behemoth person.", "Madeline, thank you for coming.", "Raymond, always a pleasure to call on a vanquished foe.", "I feel like Jackie Joyner-Kersee", "congratulating one of the other slower runners.", "Buckle up.", "It's gonna be a hell of a ride.", "Care to sit?", "I'm sure you'd like to take some weight", "off your cloven hooves.", "Calling me the devil?", "How original, Raymond.", "Actually I was calling you a goat, you goat.", "Oh.", "I'd like to talk about my promotion.", "Very well, but first,", "how do I know you're not wearing a wire?", "I need to pat you down.", "If you must.", "What is going on?", "Shh. I'm watching something.", "Can you get the car from the valet, babe?", "I'm gonna in the back and say hi to the chef.", "Good luck on your wedding, guys.", "Oh, have fun on your honeymoon.", "We will. We're going to Waco, Texas.", "Huh. Okay, bye.", "Bye.", "- Waco, Texas? - I don't know.", "It was just on Dateline.", "All right, well, Augustine took the laptop case with him.", "He's gonna make the drop. Let's go.", "Look, there's the buyer.", "Or maybe he's just actually saying hi to the chef?", "Why isn't he making the handoff?", "Oh, crap, he saw us.", "Uh...", "Excuse me.", "Oh, hey.", "We were just looking for a place to, uh...", "Boink.", "Yep. Boink.", "That's my preferred term for it as well.", "I get it.", "Newly engaged kids. Enjoy.", "Thanks.", "Good. Good, good, good, good.", "We kept our cover intact. Ce work.", "Quick, professional thinking out there.", "Very quick Very professional.", "- Detective. - Detective.", "- Let's get back on the case. - Yes.", "So how was the restaurant?", "Such a normal time!", "Why are you being weird?", "Amy and I kissed.", "What?", "To keep our cover from being blown; we didn't have a choice.", "Tell me everything!", "Charles, it was just a kiss, okay?", "It was for work. It was nothing.", "Yeah, who cares about a kiss?", "Call me if you grab each other's asses.", "He's pulling over. It's going down.", "You guys are so naive.", "It's never nothing.", "In high school, I played Daddy Warbucks in Annie,", "Becca Murse played Annie,", "and we were supposed to hug onstage.", "And at first, that seemed like nothing too,", "but by opening night, we were full-on making out.", "As Daddy Warbucks and Annie?", "Mm-hmm.", "The audience was not on board.", "Playwright sued the school.", "Guys, guys, it's not a handoff.", "He's leaving the package.", "Okay, you and Rosa follow Augustine.", "Right, and you and Amy follow your hearts.", "No, we're gonna stay with the package.", "And each other forever.", "Come on, man!", "So here's how I see this going down.", "You plead for your job back. I refuse.", "You start weeping like a war widow.", "Does that sound about right?", "Don't count your gross fish babies", "before they've hatched, Madeline.", "How did you get this?", "Gina and Terry got it, you grackle.", "It doesn't matter how I got it.", "Sorry, sir, didn't realize that was how you wanted to play it.", "I see you've got an audience for this little stunt?", "Yes, well, who wouldn't want to see a man fight a crocodile?", "Now, Madeline, before one of us starts weeping like a war widow,", "would you like to give me my precinct back?", "It's not that simple; I can't just reverse your promotion.", "You have until tomorrow, you grackle.", "We can't pull him over this close to the drop site.", "It'll alert the buyer. I say we follow him for a mile.", "Copy that.", "How's your mom enjoying the new phone you got her", "for her birthday on March 16th?", "Dude, stop saying random facts to try to prove you know me.", "That's not what I'm doing.", "I'm simply making small talk with my friend Rosa,", "who went skydiving once.", "Enough!", "I'm going to the dumb party but only because", "I don't want to hurt Marcus.", "I'm still super mad at you.", "Mm, like how you're still super mad at Gilmore Girls", "for how the finale went down?", "Oh, I just want to see Lorelai happy, and shut up!", "Ah, see? I knew you so well, I knew it was co... ah!", "Hey, seriously, we're cool, right?", "Yeah, totally.", "- We're fine. - Good.", "Gosh, you know, I'm actually a little bit hungry.", "I never ended up eating at that dumb fancy restaurant.", "You know what I'm getting on my way home?", "Yeah, you're gonna go to the Polish place", "and get perogies, potato pancakes,", "and a cup of hot chocolate.", "That's exactly what I'm gonna get.", "Yeah.", "I will be having pizza,", "two slices of meat supreme from Tony's,", "served display temperature.", "Meat supreme is a million red flags,", "and eating it cold is just insane.", "No, no, no. It's not cold.", "- It's display temperature. - Jake.", "There's a difference, Amy.", "No, Jake, he's looking at us.", "- Well, this is happening. - Huh?", "NYPD! Freeze! We are police colleagues!", "You're under arrest. This is a work event.", "Hey, can you sign this arrest report", "for Augustine and the buyer?", "Sure.", "Great.", "Man, I forgot how long your signature takes.", "I'm just gonna watch Braveheart on my phone real quick.", "Given the circumstances,", "I could see how that might have seemed like", "flirty teasing or something,", "but I was legit being critical.", "You have a problem.", "No, even that sounded like banter now.", "All right, there's only one way out of this for me.", "I just got to get super cruel.", "Prepare to have your physical flaws pointed out, Amy.", "I'm talking about your tall butt and your weird elbows.", "Jake, it's okay.", "Thank you.", "This whole night was really weird.", "I know.", "I just... ugh.", "I want everything to go back how it was, you know?", "It's so awkward.", "- Yeah. - And you're right.", "We shouldn't date cops, 'cause we're a great team.", "We work great together.", "I don't want to mess that up.", "Yeah, I don't want everything to change.", "Yeah, me neither.", "Okay, then that's that, Detective Peralta.", "Detective Santiago.", "See you around the precinct.", "Yep.", "Tall butt.", "Okay, before we go in,", "remember you have to pretend to be surprised.", "How's this? Oh, my God.", "It's so much worse than I imagined.", "The energy was great, but the message was flawed.", "All right, let's get this over with.", "Surprise.", "What's going on?", "I rented this entire bar", "so you and I could celebrate with no people anywhere near us.", "I probably should have hired a bartender, though.", "I have no idea how to make drinks.", "This is incredible.", "It was all Charles' idea.", "I told you I knew you, Ro-ro.", "Thank you.", "But never call me \"Ro-ro\" again.", "Oh, but I will.", "I've earned this.", "Happy b-day, Ro-ro.", "Whoo!", "Welcome, Madeline. Have you thought things over?", "I have, but first, how do I know you're not wearing a wire?", "So I've thought it over, and perhaps you should go ahead", "and show that letter to the commissioner.", "And let him fire you?", "I'll deny I wrote it.", "It will take months to authenticate,", "which will give me plenty of time", "to make some personnel changes around here.", "There's an opening for a detective down in Brighton Beach.", "I think I'll transfer Diaz there.", "Detective Boyle I'll send to Long Island City.", "Santiago will be a great fit for Pelham Bay.", "And Peralta, your little pet project,", "I'm gonna ship him off to Staten Island.", "Hope he likes breaking up tanning salon fistfights.", "Looks like you've got a decision to make, Raymond.", "What are you gonna do?", "Squad, if I could have your attention please?", "I am being transferred to the public relations office.", "I'm leaving the Nine-Nine effective immediately.", "- What the hell? - I don't understand.", "- What the hell? - Why are you doing this?", "What the hell?", "I want to say it has been a pleasure", "to have worked alongside all of you for the past 21 1/2 months.", "I'm sorry for getting so emotional.", "A pretty consistent tone, actually.", "These have been the...", "these have been the best years of my career.", "Oh, no. This is new.", "And I know that everyone of you gave me everything you had,", "and I will never forget it.", "Go back to being robot captain.", "Meep-morp.", "Zeet.", "Dismissed.", "Sir!", "I'm coming with you.", "- Thank you, Gina. - I'm also coming.", "Not necessary.", "- Hey. - Hey.", "Thought I might find you in here.", "I just needed to process the captain's news.", "I feel so bad for him.", "So how are you holding up?", "I don't know. I'm still in shock.", "You?", "Um, basically handling it the way I dealt with my dad leaving,", "just repressing the hell out of it.", "So a lot of change around here, huh?", "Hey, Jake, the new captain's here.", "Who do you think it's gonna be?", "I have no idea.", "I bet it's me.", "I just hope I'm ready.", "Wow.", "Come on, guys.", "I know you're sad,", "but let's do our best to make a good first impression here.", "Smart. Good call.", "Jake, you be up front.", "Okay, here we go."]