[">Look, we all know Scully has the hardest head,", "but what concerns me is the speed factor.", "- Squad, listen up! - Not now, Terry.", "We're having an argument about who would win in a fight", "if we couldn't use our arms.", "Everyone agrees, I'd bite the best.", "Meaningless! True strength comes from the pelvis, not the mouth.", "- There's been an assassination attempt! - What?", "And you let us just sit around talking about Boyle's pelvis?", "I didn't let you!", "Councilman Bosworth was giving a speech at Garfield Plaza.", "He was shot in the shoulder.", "Now, he's in stable condition,", "but the shooter's still at large!", "We have to move!", "We're locking down a ten-block radius around the scene.", "No traffic in or out.", "We think our man is still inside the area.", "ESU is on-site.", "I'll be leading the op from a mobile command center.", "Santiago is running perimeter control.", "Peralta, you're in charge of the manhunt for the shooter.", "Oh, my God, it's a manhunt.", "And I'm the Manhunter.", "And I'm your sidekick, the Boyhunter.", "- Come on, dude. - I'm gonna be on the news.", "I'm gonna look straight into the camera and say,", "\"If the shooter is watching, I hope you like living", "between St. Charles Place and Connecticut Ave.\"", "- I don't get it. - It's from \"Monopoly.\"", "That's where jail is.", "Whatever, it was a good line. Keep briefing!", "- _ - Diaz, Santiago,", "the Command Tent's on the northeast corner.", "We need to work fast.", "The mayor's only given us five hours", "until the barricades are lifted.", "Five hours? Tell him the Manhunter only needs one.", "Love that, but I'm gonna keep it at five.", "It's already way too little time.", "All right, I'm seeing security cameras.", "I need all that footage.", "I need forensics to run a full sweep of...", "Hey, what are all these civilians doing here?", "Who's responsible for securing the area, who screwed this up?", "Hi, I'm Officer Debbie Fogle.", "I'm so sorry, my partner's on crowd control.", "I don't know where he went.", "It's his first week on the job,", "so he's still learning the ropes.", "All right, listen, Fogle.", "We have a councilman in the hospital and his shooter is still at large.", "We don't have time for this incompetence.", "I want your partner off the case, what's his name?", "It's Raymond Holt.", "Oh!", "It's Dad... I mean, Captain Holt!", "I mean, Captain Dad.", "I mean, Officer Holt.", "I mean, Officer Dad.", "Yep, that was it. Officer Dad, I found it.", "Detective, I thought I saw a clue on the sidewalk.", "I apologize for not properly securing the scene.", "No need to apologize, I wasn't even that mad.", "You said you wanted whoever messed up off the case.", "It doesn't matter.", "The point is, no one needs to get in trouble.", "Look, you don't have to pity me", "just because Madeline Wuntch demoted me for a year.", "I've been stripped of my accomplishments", "and lost the respect of everyone in my life...", "including my dog.", "Cheddar? No.", "Yes! Now...", "- he only poops for Kevin. - Oh, sir.", "We don't have time to take all this in,", "there's a shooter on the loose!", "Are you guys gonna be okay working together or not?", "Of course we will, I took an oath to protect this city", "no matter what my rank.", "I have no problem", "with Detective Peralta being my commander.", "And I have no problem commanding him.", "Here, watch this.", "Captain, will you please lock down North 3rd Street,", "if that's okay with you, Captain?", "It certainly is!", "Impressed?", "You said \"please\" and you called him \"Captain\" twice.", "Yeah, we don't have time for this, Lieutenant.", "There's a shooter on the loose!", "- _ - Traffic is shut down.", "Civilians are being funneled into the checkpoints.", "Good, just wish my guys over here", "could be a little more efficient.", "Yeah, I'm looking at you,", "Detective Fuzzy Paws!", "Is this Amy-hates-dogs-Amy or Amy-extra-stressed-Amy?", "It's both Amys! I'm under a lot of pressure.", "And also, that dog is a piece of trash!", "Okay.", "I can tell something else is going on,", "you don't have to pretend to be mad at the dog.", "First of all, I'm not pretending.", "That dog sucks!", "Also...", "My period's late, I think I might be pregnant.", "- Oh, damn. - I can't be pregnant!", "Jake and I agreed to wait at least a year until we tried.", "I haven't found an OB,", "I'm not on any preschool waiting lists,", "and I spent all of yesterday", "in a room with Hitchcock and his new cologne,", "which can't be good for the baby...", "it is literally called", "Zika!", "Okay, relax,", "You're probably not pregnant, it's entirely possible", "Hitchcock's cologne disrupted your cycle.", "Right, yes.", "That is a very real possibility.", "- Santiago! - Ah!", "What's going on here? Is everything okay?", "Yeah, totes!", "Right, Rosa?", "Uh, totes.", "Why is everyone being all weird today?", "Just get back to work and be normal.", "Yes, sir! Will do, we'll be normal.", "Nothing to stress about here.", "Hey, Fuzzy Paws!", "I'm paying you to work, not lick your butthole!", "Yeah, I'm gonna get you a pregnancy test.", "_", "Okay, I know you haven't done this in a while,", "so here's a tip... keep your hat on.", "Because of all the standing still,", "the pigeons think we're statues", "and they will poop on you or peck you.", "Both are bad.", "Thank you for the helpful tip.", "Oh, I've got a ton of them.", "They're mostly about the dangers of standing.", "A year on the beat without prescription insoles", "can take two years off your life.", "Any way to speed the process up?", "Okay, I've got a funny guy for a partner.", "But seriously, you have to monitor your foot health.", "I'll gonna send you a pedometer app that I use.", "You're gonna love it. It has robust social features.", "We can give each other \"foot-fives\"!", "No, thank you,", "I keep count of my steps in my head,", "like a normal person.", "I'm up to 6,743 for the day.", "- _ - Okay Boyle, it's time for the Manhunter", "to hunt... man.", "♪ Ooh, here he comes ♪", "♪ Watch out, men, he'll hunt you down ♪", "♪ Ooh, here he comes ♪", "♪ Jake's a manhunter! ♪", "Charles... I love that.", "Keep doing the song while I work the scene.", "You got it!", "Okay, bullet lodged there", "is 4 feet below the hole in the backdrop", "indicating a trajectory of about 15 degrees,", "which means the shot was taken", "from either the second or third floor", "of one of the buildings across the plaza.", "♪ Ooh, here he comes ♪", "That building's windows don't open.", "♪ Watch out men, he'll hunt you down ♪", "- That one's obscured by trees. - ♪ Ooh, here he comes", "Which means that the shooter must've been located...", "On the sky bridge.", "♪ Jake's a manhunter ♪", "- Officer Holt. - Mm.", "I thought I stationed you...", "not here!", "Right.", "I'm just here in the plaza", "looking for, um...", "this!", "A half-eaten box of McNuggets?", "- Yup, it's my lunch. - Uh-huh.", "And what type of food is a McNugget?", "Some type of a... paella?", "You had to know that was a bad guess.", "Well, the point is, I needed my paella", "and I noticed the sky bridge,", "so I thought I might be of some help,", "but I'll just go back", "and stand next to a piece of police tape", "and do nothing.", "Wait, stop.", "How would you like to stick around", "and assist on the case?", "You sure, Jake, I mean,", "there's only room for one Manhunter.", "Boyle is right, I don't want to overstep.", "You're not overstepping.", "I mean, he interrupted the song, but whatever.", "Great, I'll just leave my paella", "on the ground, save it for later.", "We all know that's not your lunch!", "So, the shooter was standing right here.", "A standard long gun would've ejected the casing", "right over...", "there, where Holt is already putting down", "an evidence marker.", "Yes, I found it quite quickly.", "Great, thank you for saving me the trouble of doing my job.", "Oh, sorry.", "Would you like me to pick the evidence marker back up", "so you can place it on the ground?", "- Yes! - No, of course not.", "Good work.", "I bet the shooter went that way.", "- Sorry. - Yeah, it's okay.", "Follow me to the service entrance.", "Ugh, we did it again. I'm so sorry.", "- It's really no problem. - Great!", "Follow me, everyone!", "Wait, what?", "Security footage showed no cars leaving the area,", "so our shooter must've left here on foot.", "He's taking over your case, Jake.", "You have to stop him.", "Well, you know, it takes a true leader", "to let someone else lead.", "Ugh, sounds exactly like something I would say.", "Snap out of it.", "Look, it's fine, I just...", "I feel sorry for him, okay?", "His assignment was standing next to tape.", "I'm still gonna crack the case.", "- I cracked the case. - Come on!", "Hot dog man, tell them what you told me.", "I saw a guy, mid-height, brown hair,", "and a green hoodie with an owl on it.", "He had a big bag and he was running like hell.", "It sounds like our guy.", "All right, let's call it in to give a statement to the press.", "Great idea.", "He knows that I meant I would give the statement, right?", "And if the shooter's watching,", "I hope you like living", "between St. Charles Place and Connecticut Avenue.", "Because that's where jail is in \"Monopoly.\"", "A great line from a great man, or should I say,", "Manhunter.", "Yeah, he overstepped.", "- _ - Boyle, gather everyone up.", "Oh, we starting a burn book about Holt?", "Let's drag him, baby!", "No, someone saw our hoodie guy.", "Right, we'll do the burn book later.", "Attention, everyone, we have a possible sighting", "of our shooter on Hoyt Street.", "Detective Boyle and I will take Alpha unit.", "- Smith, Fox... - You guard the burn book.", "- Charles, no. - Stand down.", "You take Bravo unit.", "The rest of you, continue to sweep the area", "in case this lead doesn't pan out.", "The clock is ticking, go, go, go!", "Where should I go, Detective? I'd love to be of service.", "Captain Holt! I mean... dude!", "I haven't seen you since your big news conference", "which I just loved.", "Ray, there you are!", "I can't believe you left your post again.", "Detectives, I'm sorry for my partner's bad boy behavior.", "I am not a bad boy,", "I'm trying to catch bad boys!", "If anything, I'm a good boy.", "That's exactly what a bad boy would say.", "It's definitely not, and no need to apologize,", "we have a job to do.", "Great! Where do you want us?", "Someone matching our shooter's profile", "was just seen over on Atlantic and 4th,", "I need you both there immediately, can you handle it?", "Absolutely not,", "it sounds like way too much responsibility.", "Don't listen to Debbie. We're on it!", "All right. Bye!", "What's going on? The guy's on Hoyt Street.", "I know, I gave Holt a fake lead to get rid of him.", "Don't worry, I'm still...", "the Manhunter.", "♪ He's the Manhunter!", "♪ And the boy who he hunts with ♪", "- What's that song? - The Boyhunter song!", "♪ Boyhunter", "♪ Down by the schoolyard", "Why is he by the schoolyard?", "- He's gotta protect the kids! - Sounds terrible.", "- Really, I don't hear it! - Let's just go.", "- _ - Okay, good news.", "I found a bodega in the containment zone", "and got a bunch of pregnancy tests.", "- A bunch? - Yeah.", "It's a New York bodega, you can't be too cautious.", "Good point. Yep, expired ten years ago.", "Open. And used!", "Made of gummies? Why?", "Weirdly vibrating.", "This is for teens. That's dark.", "This is good.", "Great, let's do this.", "Hey, Santiago, nice work at checkpoint one.", "Wait, why are you guys being all weird again?", "We're not being weird.", "Do not dab!", "I wasn't going to.", "I know what's going on here.", "- You do? - Yep.", "You're talking about me.", "I know 'cause my daughters are doing the same thing.", "Every time I go in that room, they get all weird and quiet.", "That's 'cause they're making fun of Daddy.", "Is that what you're doing, making fun of Daddy?", "First off...", "- Yeah, I heard it, I'm sorry. - Great.", "Secondly, we're not talking about you.", "What are you talking about, then?", "Our favorite...", "porns.", "- What? - It's true.", "We have specific favorite porns.", "- And we're talking about 'em. - Yeah.", "Okay, legally, I feel as though I need to back away.", "But I want it to be known that I still do not believe you.", "Get back to work!", "Eh, that went well. All right.", "Let's take this thing and get it over with.", "- I can't. - What? Why?", "I have no pee inside of me.", "I'm pee-free, Rosa!", "What do I do, what do I do?", "Drink water.", "Oh, yeah. You're smart.", "You're a very good friend, I'm glad you're here.", "Street's clear.", "No sign of the shooter, where'd he go?", "- Shh, shh, shh, shh, shh. - Why are you shushing me?", "I'm doing that thing where I listen", "really closely for a noise clue,", "like glass breaking or trash rustling.", "Cool! Is it working?", "No, not yet.", "- Because I'm talking? - Well, it's not helping.", "Right, right, right. I'll be quiet.", "You don't have to say you'll be quiet, just be quiet.", "Okay. I'm sorry for not being quiet.", "Once again, don't have to say.", "Just wanna be clear what I'm doing.", "- Understood. I'm just gonna listen. - Okay.", "I'll be very quiet.", "Don't have to say it.", "Just wanna make sure you know what I'm doing.", "- Please stop. - So I don't throw you.", "Okay, stop talking.", "- I'll stop talking. - Great.", "I'll make sure I don't do that again.", "All right, Charles, I love you, but you ruined it.", "Trash rustle!", "He's running, call it in!", "I'll follow, you cut him off!", "Damn it!", "Nice, Charles!", "Name's not Charles, it's...", "Boyhunter.", "You know what, you earned it.", "Way to get your boy, Boyhunter!", "All right, let's get our perp back to the Nine-Nine.", "I'll tell Jeffords to lift the lockdown.", "Detective Peralta!", "I see you got the man you were looking for.", "With your help, officer!", "I really couldn't have done it without you.", "No, this was all you.", "We were in a completely wrong location.", "Which was a huge relief to me.", "Plus, we got a lot of steps in.", "I'm drowning in foot-fives.", "Well, no need to focus on who was where", "or what a foot-five is,", "we gotta start brainstorming headlines for tomorrow's paper.", "I got one.", "\"The Only Assassin in this City is Jake Peralta", "Because He Just Killed This Case.\"", "I don't know if we want to make it seem", "like I'm the assassin.", "Yeah, good thinking.", "How about this, \"Hero Cop Saves City,", "\"Pitt, Clooney Circling To Play Him In Biopic.\"", "- Hunks! - I have a headline.", "\"Pitt, Clooney Laugh At Jake Peralta", "For Arresting the Wrong Man.\"", "Well, I don't know if they would laugh at me for saving...", "what, did you just say I got the wrong man?", "What do you mean we got the wrong man? What are you talking about?", "You know how you sent Debbie and me off", "- on a wild goose chase? - Oh, so you figured that out?", "Well, Debbie did. She's quite the detective.", "Oh, I'm really not.", "I'm just always being given meaningless tasks", "and I'm not complaining.", "So what, you're just saying we have the wrong guy now,", "because you're upset about the fake lead?", "No, I'm saying you have the wrong guy because you do.", "When I realized your lead was nothing but hooey,", "I went back to re-interview the hot dog man, but he was gone.", "And why was that? Debbie, tell 'em!", "Oh, no, I don't want to be a part of this.", "Because the hot dog man is the shooter.", "What? That seems like a reach.", "Sometimes, when you reach, you grab the truth.", "- Sorry, Jake, he turned it around on me. - Come on!", "The hot dog man gave a false statement", "to throw us off the scent and then vanished", "while we were off looking for the wrong guy.", "Face it, you're no Manhunter.", "If anything, you're a Wrong Manhunter.", "How dare you.", "You know what? This is crazy.", "You're just making up a solve", "because you can't stand the fact that you got demoted.", "You've been trying to hijack this case all day.", "I was only trying to help.", "If I'm such a headache,", "then why didn't you reassign me?", "Because I felt sorry for you.", "I told you to treat me like any uniformed officer.", "It's not my fault", "that you don't know how to give an order!", "Okay, fine. Here's one.", "We're lifting the lockdown, go pick up cones.", "- Ooh, I love cone duty! - Debbie, can it!", "We have the wrong guy.", "You cannot lift the lockdown.", "- Go pick up cones, that's an order. - No!", "- Fine, then you're off the case! - Good.", "Do I still get to pick up cones?", "No!", "Amy, stop. You've had enough water.", "I can hear it sloshing around inside you.", "I know, but I still can't pee!", "- I'm too stressed. - You need to calm down.", "You know what helps me relax?", "- Kicking stuff? - Absolutely.", "So, what or who do you wanna kick?", "That guy looks pretty kickable. Hey!", "I'm not kicking anybody, okay?", "I just need, like, some calming noises.", "Okay, close your eyes.", "Okay.", "Glub, glub, glub.", "- What is that? - It's a babbling brook.", "Glub, glub, glub.", "You know what? It's pretty good.", "Thank you. Everybody, shut up!", "Glub, glub, glub, glub, glub, glub.", "Why is the tent so quiet?", "Is everybody talking about me now?", "- Nobody is talking about you. - Sure.", "Terry walks into a tent", "and everybody just happens to stop talking", "at the same damn time?", "You are gaslighting me just like my daughters!", "Terry, I think you're being paranoid.", "I'm not paranoid!", "I put a recording device in my girls' room.", "You planted a bug in your daughters' room?", "I do what I have to do.", "They said I look like a giant triangle!", "- Is that an insult? - I don't know!", "But they were laughing like it was,", "and it hurt just the same!", "Don't have kids!", "Well, that ruined everything.", "I know we got kicked off the case,", "but there is good news.", "I unlocked a new accessory for my Foot Friend avatar:", "a sandal!", "Debbie, wait. Change of plans.", "We're not going back to the precinct.", "Are we gonna go rogue and pick up cones?", "Oh, we're going way more rogue than picking up cones.", "Listen, it's unlikely our shooter", "had his own hot dog cart... where'd he get it from?", "Please don't make me help you with this.", "My guess is the food cart garage", "just two blocks away from our crime scene,", "or, shall I say, 238 steps.", "Don't tempt me with steps.", "This is a defining moment for you.", "You can either obey orders for the rest of your life", "and make no impact on the world, or stand up!", "And solve this case with me.", "Is there a third option?", "- Nervously tag along. - Great.", "I choose the nervously tag along option.", "Okay, the reporters are all set for your press conference.", "It's your big moment, are you excited?", "- No. - Oh.", "Are you worried about your voice cracking?", "Do you want me to help you warm up your throat?", "- What would that entail? - I'll just show you.", "Don't show me, tell me.", "I blow hot air into my hands and I stroke your neck.", "That's not gonna happen, and it's not why I'm stressed.", "I think Holt got into my head.", "We might have to delay the press conference.", "But this is the moment we've been waiting for.", "My dad's driving home early", "from his brother's funeral to watch it live.", "Wait, he's doing what?", "If you want me to put it in a better context, I can't.", "This was very important to him.", "Holt is a great cop,", "and I know the demotion's driving him crazy,", "but his gut is usually right.", "I think we need to find that hot dog cart guy.", "Okay, fine.", "But who do we know that could find us", "a random New York hot dog guy?", "♪ Hey", "♪ Hey!", "♪ Hey!", "So, you need a little help from the Weiner Warriors.", "Well, I hate that.", "Just tell us what you know, please?", "There's Lou's Dogs, he serves 'em up real plump.", "Big Mike's does two dogs per bun.", "Hank's Franks... great mustard selection.", "Vicki's Vegan?", "I'd rather eat [bleep].", "Charlie does an al dente dog, it's got a really nice chew.", "Johnny Arkansas serves it Little Rock style,", "although he can serve it Razorback-style.", "Okay, enough, enough!", "We don't have time for this!", "Just tell us who has a cart at 6th and 11th.", "Oh, there are no hot dog carts there.", "What? Never?", "- No way. - Not a chance!", "Zoning issue. Forget about it, Jake.", "It's Hungertown.", "Oh my God, Holt was right.", "We have to call him.", "Officer Holt?", "Officer Holt, do you copy?", "Okay, cop. Turn it off.", "Nice try.", "My partner doesn't follow orders.", "Debbie, you're misreading the situation.", "Oh. I'm so sorry.", "We both... both follow orders.", "So you were the shooter, just like I said.", "And the man in the hoodie", "was just some random bystander on whom you tried to pin it!", "No, he was in on it too.", "Oh.", "Well, I'm still half right.", "Sure. Is that important to you?", "- Very. - I'm gonna die.", "I'm gonna die before I ever got to find", "my twin sister's killer.", "What?", "That's the reason I joined the force, remember?", "To find the man who murdered my twin sister.", "That's my whole story!", "Debbie, there's no way you told me that.", "Nothing's working!", "Maybe you just need to laugh.", "Here, look at this video of a man being trampled by a moose.", "Dear Lord, that's horrifying!", "I know, it's hilarious.", "What are you laughing at? Is that a video of me?", "Oh, no, is it that time", "Terry fell off a Lime scooter?", "Why would any of us have that footage?", "Don't skirt the question!", "I want to know what I'm falling off of in that video.", "Stop it, Terry, okay?", "We haven't been talking about you!", "Oh. Kicking.", "I think kicking's working.", "Told you. Go with it.", "Keep kicking that can.", "It worked, I have to pee! I finally have to pee!", "Wait, this is about you having to pee?", "- Yes! - Wow.", "I guess I owe you guys an apology.", "I may have been bringing some things from home", "into the workplace.", "Yeah, that was clear from the start, okay?", "Now, move, I need to find a bathroom.", "Stop, we have an emergency!", "Everybody stop what you're about to do.", "Yeah, but I gotta pee really bad.", "Well, hold it, Amy. Holt's not answering his radio.", "I think he and Debbie might be in trouble.", "It's just us, man, you don't have to pretend", "to care about Debbie.", "- Rosa! - What?", "We barely know her and she's annoying.", "She's always trying to get people to be friends with her", "on that weird app for pedicures.", "It's a pedometer app. It's a pedometer app!", "We can use the social features to track her!", "It's $80.", "Uh, Boyle, you should download it,", "you get better service here.", "Smart!", "And I'll upgrade to ad-free too.", "- Smart. - Okay, let's move!", "Sweet! We're running, okay.", "If I die, will you look after my cat?", "I'm really more of a dog person.", "I understand.", "- NYPD, nobody move! - You're surrounded!", "Don't do anything stupid.", "Looks like we got ourselves a standoff.", "Fine by us, we got all the time in the world.", "What? Uh-uh!", "I gotta pee!", "Perp secured.", "Great, okay, cool!", "I gotta go! You guys are good, right?", "Bye!", "Thanks for saving us, Peralta.", "Thank Debbie, we tracked you using her pedometer app.", "Oh, my goodness, I helped!", "And I got four new Foot Friend requests!", "What a day, guys!", "Detective.", "I believe I owe you an apology.", "No, Officer, I owe you one.", "No, I owe you.", "Great, 'cause I hadn't thought of", "what I was gonna apologize for yet.", "I should not have disobeyed your order.", "I was wrong.", "Not about the case, of course,", "my hunch was impeccable.", "Interesting apology strategy,", "a little heavy on the brags.", "Point is, you were right.", "I hijacked the case because I need to feel respected.", "Listen,", "it's weird that I'm your boss now,", "and that's not going anywhere,", "but no matter what uniform you wear,", "I'm always gonna love you...", "I mean, cherish...", "I mean, respect.", "- You said respect, right? - Yes.", "Yep.", "And I feel the same about you.", "So, do you have any orders for me, sir?", "Well, I do actually", "still need those cones picked up.", "We're on it.", "We got cone duty?", "Yes!", "Best birthday yet.", "It's your birthday?", "Hey, so...", "today was pretty intense.", "You mean catching the shooter?", "I know, it's a great story.", "I just hope Pitt can get in good enough shape", "to play me in the movie, you know?", "Mm, yeah.", "Um, also, something else happened.", "I thought I might be pregnant.", "- Really? - Yeah.", "I'm not, I got my period.", "And I took a pregnancy test, but it didn't work", "because I drank 11 gallons of water.", "Told you water was bad for you.", "- That's not the takeaway. - You're absolutely right.", "How are you, how do you feel? Are you okay?", "I mean, I was really stressed.", "This wasn't our plan, and we agreed we'd wait a year", "and there's so much to do first,", "and it would've been crazy, right?", "Yeah, it would've been.", "Okay.", "But...", "also might've been...", "kinda cool.", "Honestly?", "I was secretly bummed when the test came back negative.", "Should we just start trying?", "Seriously?", "Yeah, seriously.", "Okay. Yeah.", "Oh, wait! It's after 11.", "My interview!", "It's supposed to be on the news.", "An incredible conclusion", "to a terrifying day,", "and we were able to get a comment", "from the men who helped solve this case.", "They call us the Weiner Warriors.", "No!"]