[">- Clear in back. - Copy.", "- All clear on the main hall.", "- Clear. - Clear.", "- The service road a quarter mile away is also clear.", "Hold on. There's a pigeon approaching.", "Hold the mission.", "Shoo.", "Shoo. Shoo.", "Shoo.", "- Great work with that pidge, officer.", "- Detectives, switch to channel five.", "Anyone else getting a sense Holt is upset", "about the new captain coming tomorrow?", "- It's bad. This morning he sighed for the entire length", "of our elevator ride.", "- I wonder who Wuntch is gonna stick us with this time.", "Clear. - Clear.", "- I'm sure it will be someone terrible,", "but we've had bad bosses before,", "and we've always managed to get rid of them.", "Let's just do that again. - Hey, listen.", "I'm taking this weekend off.", "Do you think you can have the new captain gone by Monday?", "I'm kind of over meeting new people.", "- Gone by Monday. Challenge accepted.", "Clear. - Clear.", "We got a runner.", "- NYPD, freeze!", "- Ugh!", "- Taking down the bad guys without breaking up our convo.", "That how we do it in the Nine-Nine.", "- You're going the wrong direction.", "- Damn it. All these hallways look the same.", "That was such a cool walk-off.", "♪", "♪", "- 'Sup? - What is happening?", "- Well, with the new captain coming in,", "this is my chance to reinvent myself.", "So say hello to Chuck Boyle, office badass.", "- Wait a minute. Is that Rosa's jacket?", "And follow-up question,", "does Rosa's jacket fit you perfectly?", "You tell me.", "- You know, just put on a leather jacket", "and become a badass.", "You also need a chunky bracelet with fringe.", "- Wrong. Ever since Rosa gave me this baby,", "people have been treating me like I'm cool.", "The girl at the coffee shop", "even got the name on my cup right.", "It says \"Charles,\" not \"Cassie.\"", "- You know, I think it's less about the jacket", "and more about the fact that you're feeling confident.", "Maybe this cool version of Charles", "was in there all along.", "- Amy, I love you, but that's insane.", "It's a magic jacket.", "- Okay. - So just to be clear,", "you think we're dealing with", "a \"Sisterhood of the Traveling Pants\" situation here?", "- Don't know, not familiar.", "- You made me watch it.", "Look, there's no point in rebranding yourself", "for the new captain... or should I say \"craptain\"...", "because they're not gonna be here", "for very long anyways, remember?", "- Peralta, stop it. I don't want to hear you bad-mouthing", "my replacement around the office.", "Do it surreptitiously.", "Watch this.", "I hear that new captain's a pill-popper.", "- They're on their way up. - Everyone hide your pills.", "- Brace yourselves.", "You're about to look into the face of pure evil.", "- Ah, good morning, good morning, good morning.", "I'm Captain Julie Kim.", "- And I'm Chuck.", "If you want results, stay the hell out of my way.", "- Okay, wow, I guess I know who the office badass is.", "Anyway, I just want to say", "how excited am to be here at the Nine-Nine.", "I hear the best things about this place.", "From who? Madeline Wuntch, per chance?", "Oh, I've never actually spoken to Acting Commissioner Wuntch.", "I requested the posting through the C.O.P's office.", "I didn't prepare a speech, but a little about me:", "I was the first female Asian-American captain", "in the NYPD.", "My guilty pleasure is charity work.", "And what do I do for fun?", "Well, basically just design and build skate parks", "for marginalized communities; and that's me.", "- What a gigantic turd.", "- Agreed, an unformed pile.", "- I don't know; she seemed kind of awesome to me.", "- The thing is, she can't be awesome", "'cause she's here to replace Holt.", "- But she said as soon as his year in uniform is finished", "she's moving on.", "- That's a pretty generous interpretation", "of what she said, Amy.", "- As soon as his year in uniform is finished,", "I'll be moving on.", "- Okay, fine. It's exactly what she said.", "But she seems like a liar.", "Someone told me she's a pill-popper.", "- Pop-pop.", "- Well, she's not lying about her résumé.", "Did you know The Rock's character", "in \"The Fast and the Furious\" was based on her?", "Hobbs. Or Shaw.", "- She's not a Hobbs or a Shaw.", "If anything she's a Trevor.", "That the guy my mom dated after she divorced my dad.", "- So this is all about your daddy issues?", "- Step-daddy issues. This is a new thing.", "I'm complicated.", "Anyways, Trevor seemed perfect too, you know?", "He was nice to my mom, he drove a limousine,", "he would take us out to restaurants.", "But then my mom caught him cheating,", "and we never saw him again.", "So it turns out when people are too good to be true, they are.", "- That sucks, Jake,", "but I don't think Captain Kim is a Trevor.", "Oh really? She could have had her choice of any precinct.", "Why would she choose this lame temporary posting here?", "I'll tell you why.", "Because Madeline Wuntch sent her.", "- So what do we do? - I'm glad you asked.", "You know how she wants to have individual meetings with us", "to assess our \"personal strengths\"", "and help us \"achieve our goals?\"", "Stupid B.", "- I say we use those meetings to figure out why", "she's really here.", "She may seem perfect,", "but I guarantee there's a \"but.\"", "And I'm gonna find that \"but and drill down on it.\"", "- Come on, man. You have to know how that sounds.", "- Shut up, cool Charles. I hate this new dynamic.", "- Lieutenant, thanks for coming in.", "First off, do you have any questions for me?", "- Just one. Why would someone with your pedigree", "choose the Nine-Nine?", "- Well, why did you choose to stay here", "as long as you have?", "- This is my family... second family.", "I have a wife and three kids at home.", "- Oh, please tell me you have pictures.", "- I may8 have one or two... hard drives at my desk.", "Let me grab them real fast, okay?", "- So, Captain Kim, I've been going through your files...", "- And I've been going through yours,", "very impressive stuff.", "- Oh. - Not just the case work,", "but look at how they're organized,", "the penmanship, color coding.", "How do you get such straight margins", "on a hand-written document?", "- Oh, well, I like to say when it comes to margins...", "both: There's no margin for error.", "Both: Ah-ha-ha-ha-ha!", "- So you supposedly build skate parks, huh?", "What are your three favorite tricks?", "- Oh, gingersnap, plasma spin, roast beef grab.", "What about you?", "- Ollies. And the roast beef one that you said.", "It doesn't matter. We're both skaters.", "Let's move on. - Well, I went over your", "recent evaluations,", "and I don't think you belong here.", "- Oh, I knew it. You want to get rid of me.", "Well, you know what? You can't fire me,", "because I quit... metaphorically.", "Obviously, for medical insurance reasons,", "it's actually much better if do you fire me.", "- I'm not firing you. I'm impressed by your talent", "and record, and it just so happens", "have a friend in the FBI who is looking for", "an NYPD liaison officer.", "So what do you say?", "- So what did you say?", "- I told her I'd rather stick my entire head", "inside a giraffe's long blonde butt", "than accept a job offer from her.", "- Mm-hmm. - You said that?", "- In my head.", "In my mouth I said I would think about it", "and get back to her.", "She'll get the message when I dillydally.", "- Working with the FBI. That's your dream job, Jake.", "- First of all, my dream job is spy", "falsely accused of betraying his country,", "forced to work alone to clear his name", "by taking down the mysterious organization that framed him", "known only as S.H.A.D.E.", "Secondly, it wasn't a real job offer.", "She's up to something. - Mm-hmm.", "- Maybe she's just a nice person.", "I mean, she did seem genuinely interested in my kids.", "- Look, did any of you get a straight answer from her", "about why she's at the Nine-Nine, hmm?", "Right, me neither. But guess what.", "I called the C.O.P. office,", "and they said the form to transfer her here", "wasn't signed by them.", "It was signed by Wuntch.", "She lied. - Mm-hmm.", "- Just because Wuntch signed an order", "doesn't mean they know each other.", "- Will you wake up?", "That woman is a demon, and it couldn't be more obvious.", "- Oh, here you are.", "I have to say how great it was talking to you all,", "and I wanted to let you know about a party I'm throwing", "at my house tomorrow night.", "Are you interested?", "- Oh, well, we will think about it and get back to you.", "- Great. Just let me know.", "- Great.", "And now we dillydally.", "- Mm-hmm.", "- What are you guys doing here?", "- What do you mean? We're going to the party.", "- You said you weren't coming.", "You said that Captain Kim was a Trevor", "and that she only invited us to earn our trust", "so she could have sex with our mom.", "- It was very confusing.", "I never said that.", "But it's not confusing.", "I mean, our \"mom\" is obviously the precinct,", "and Captain Kim having sex with the precinct", "is actually her teaming up with Madeline Wuntch to destroy it.", "It's a perfect analogy, Which I never used.", "- What's up, guys?", "Why are we standing around outside?", "- Is your walk different? Are you strutting?", "- Don't know what you're talking about.", "It's how I always walk, bitch.", "Let's roll.", "- Bitch?", "- Welcome. The bar is in the back.", "And they're coming around with food.", "I use the most wonderful catering company.", "They only hire ex-convicts to give them a second chance.", "- Oh, that's wonderful.", "- Get in here and meet everyone.", "Oh, Lieutenant, I want to introduce you", "to my old neighbor, John.", "He's the head of admissions at the Calder Academy", "in the Bronx.", "- Calder? That's the best elementary school in the city.", "Their mock trial team gets hired to work real cases.", "- And, Chuck, my friend from \"Major Crimes\" is here.", "You're gonna love him. - Maybe I will; maybe I won't.", "- Well, come on. Let's go.", "Oh, let me talk you coat. - No, I need it.", "- Oh, this way.", "- All right, I know what's going on here.", "You two still don't trust Captain Kim,", "and you're here to snoop on her.", "- I don't know what you're talking about.", "- Please. Look at your shoes.", "You only wear sneakers for their literal purpose:", "sneaking.", "- That's crazy. He's wearing perfectly normal...", "- No, she's right.", "The clown shoes gave me away.", "- Okay, look, Captain Kim lied to us.", "There's something in this house that proves she's conspiring", "with Madeline Wuntch, and we're gonna find it.", "- I am not letting you snoop around in her stuff", "and ruin this party.", "- Oh, okay. Well, good luck trying to stop us.", "- Oh, Jake.", "You don't know who you're dealing with, do you?", "I was a student chaperone", "at every dance from middle school on.", "I've stopped more horny teenagers from making out", "to Savage Garden than you can count.", "- Cool story, but we're not horny teens.", "We're horny adults.", "And tonight we're going all the way.", "Come on, Holt, let's shake this narc.", "- That's right, I am a NARC,", "a Nationally Accredited and Registered Chaperone.", "- So what grade are your daughters in?", "They're in sixth grade.", "Oh, wait, I'm sorry, that's their reading level.", "They're in second.", "- Wow. They sound quite impressive.", "- Oh good, the food. I'm starving.", "- Hello, Detective Jeffords.", "- Do I know you?", "- Ronald Palmer.", "You arrested me ten years ago.", "You testified at my trial.", "- Oh, hey.", "What have you been up to?", "- Prison. - Prison, yeah.", "I shouldn't have asked.", "- I spent ten long years thinking about what I would do", "if I ever saw you again.", "Lettuce cup?", "- Uh...", "- Oh, do you think I'm trying to poison you?", "Am I always gonna be a criminal in your eyes", "even though I've served my time?", "- No, no, no.", "I'm just not hungry right now.", "- Oh, you said you were starving.", "- Yes, John. Thanks for reminding me, John.", "- All right here we go, approaching the mail.", "Stay cool, and... doink.", "Now we've just got to find a private place", "to look at these.", "- Through here to the guest bath.", "- Ahh! - Seriously?", "The bathroom sneak-off?", "It didn't work for Dana McAlpin trying to smoke a joint", "at the Winter Carnival Dance,", "and it's not gonna work for you.", "Gimme the mail.", "You just chaperoned, O-W-N-E-D.", "- Spelling is never cool.", "- Wrong, that was extremely cool.", "Now I understand why you're \"into her.\"", "- Now you understand? You officiated our wedding.", "Whatever. We need to figure out a way", "to get her off our tail.", "- Good luck with that. - Ahh!", "- What are you two doing over here,", "waiting for the caterers", "before they make their way into the crowd?", "- We're snooping on Captain Kim, but let me guess.", "She seduced you as well.", "- Is she doing that to people? - Not literally.", "- Oh, Michael, Norm, I didn't realize you arrived.", "Come with me, I want to make an introduction.", "- Don't worry, Jake.", "You're our friend; we're on your side no matter...", "holy crap.", "Look at those chairs.", "- I know you two like to sit,", "and these are the most comfortable chairs ever.", "Give 'em a try.", "Both: Ohh.", "- It's like there's something great at this party", "for everyone, even me.", "She's serving my favorite dessert: carrots.", "- Wait a minute. That's it.", "If there's something great for everyone,", "there's something great for the narc.", "Babe, hi. How are you enjoying the party?", "- Trying to chat me up? It won't work.", "Chaperone's code forbids fraternization", "with chaperonees.", "- Okay, fine, I'll just leave you alone, then.", "I really quickly did want to introduce you", "to someone, though.", "This is Margo.", "She's a friend of Captain Kim's.", "And apparently she invented a new type of binder.", "- What?", "- \"New type of binder\" seems reductive.", "Would you call a car a new kind of horse?", "- No. - This is the future", "of organization.", "- Oh, my God. Tell me everything.", "- And you've been chaper-powned.", "- What? - Nothing. Love you. Binders.", "- So Cap tells me you're in \"Major Crimes.\"", "- Yeah, working something big.", "Can't tell you who our target is,", "but let's just say he's done a bunch of disturbing things,", "and he's on the Yankees.", "- You play poker?", "- Eh, used to, got tired of winning all the time.", "- Well, I have a weekly game.", "It's mostly Broadway stars and celebrity chefs,", "not exactly my crowd, but they are high rollers.", "Spot opened up; you want in?", "- I don't know, seems kind of lame, but I'll stop by.", "- Excuse me.", "I know you from somewhere.", "Do you go to my gym?", "- Oh, nah. I work out in my garage,", "throw the tire around,", "grab a couple big ropes and do this.", "- Mm-hmm.", "Here's my number.", "Maybe I could come over some time and...", "I don't know... you could work me out.", "- Okay, we've got her meeting the mayor,", "her dog-sitting for Bo Obama, Malala giving her an award,", "but no photos of Wuntch.", "- That's because vampires don't appear on film.", "Perhaps we should be looking for", "a 17th-century woodblock print.", "- Good idea. Let's keep moving.", "- Hello? - She's coming. Hide.", "- Title of your sex tape?", "In here.", "- Hello. Is anyone up here?", "- Well, looks like we just found the key", "to exposing Captain Kim.", "- It's the key that's in her pocket.", "- Yes, obviously that's what I meant.", "- We need to get that key.", "How are you at picking pockets?", "- Does this answer your question?", "- Whose wallet is that? - It's mine.", "But it came out so smooth I barely even felt it.", "All right, fine, I'm terrible at pickpocketing.", "But if she was distracted, I bet I could pull it off.", "Maybe you could create a drunken scene or something?", "- Why? What would my motivation be", "for such poor behavior?", "- I don't know. Anything.", "- No, I need something to draw from.", "Have I had a row with Kevin?", "Did something happen to Cheddar?", "Has a new captain moved into my precinct,", "usurped my position, and won the affection and admiration", "of people I've spent seven years", "building relationships with,", "people I once considered my chosen family,", "whom I foolheartedly hoped would provide me", "the unconditional support that I never got", "from my own flesh and blood?", "- I think you should go with the last one.", "- Yeah, the last one seemed good.", "- Yeah. - Yeah.", "- This is the best night of my life.", "People believe I work out with ropes,", "a mega-babe hit on me,", "and the bartender didn't assume I just wanted a Bay Breeze.", "- Hey, you, cool guy.", "Were you flirting with my girlfriend out back?", "- Calm down, hotshot. I'm taken.", "Look, I'll throw away her number.", "That's it, you and me outside.", "- Oh, brother.", "Come on, guys. I've got to go squash this bug.", "- Of course, at Calder we're not just looking", "for good students.", "We want compassionate members of the community.", "- Great. Terry has a passion for compassion.", "- Turkey pinwheel? - Oh, you're back again.", "You seem to working this one spot a lot.", "- Well, we're old friends, remember?", "I'll ask again, turkey pinwheel?", "- Why is there just one?", "- I made it special for you.", "- How is it special?", "- There's a little something extra in it.", "Wait, are you still suspicious of me?", "You don't think I deserve a second chance?", "- Impossible.", "Lieutenant Jeffords has a passion for compassion.", "- Yeah, you're right.", "You know what? I will take this pinwheel.", "Mmm, delicious.", "- Excuse me, but does it seem slightly warm to anyone?", "I feel it is quite warm.", "- What was that?", "You were supposed to cause a drunken scene.", "- I was. I raised the volume of my voice 9%.", "As inebriated people do,", "and I spoke of the resultant rise in body temperature.", "- Well, you need to do more.", "- More than that? Pfft, okay.", "Oh, I love this song.", "Oh, I'll have one of those.", "- That was more?", "- I paired a crab cake with a cooked Côtes du Rhne,", "like an animal.", "- Okay, we need a new plan.", "- No, no, I have just the thing.", "- It's gonna be too small again.", "You have to really...", "- I'm going to throw myself down the stairs.", "- What?", "- Ahh! Augh!", "Ohh.", "- Raymond, are you okay?", "Someone call a doctor.", "- No need. I'm fine. I'm fine.", "- Look, man, I don't want any trouble.", "- She's gonna leave me, isn't she?", "- Oh, you're crying?", "- Of course she wants someone like you.", "You're so cool.", "- Thank you. It's true. - What's your secret?", "How can I become more like you?", "- Here. This is all you need.", "It will change your life. Trust me.", "- Did you just give away your magic jacket?", "- Oh, Terry, it wasn't the jacket.", "I realize now that Chuck was in here.", "I've had another man deep inside me this whole time.", "- Welcome back, Charles. - Oh, right away?", "It was the jacket.", "- Now let's see if you do know Madeline Wuntch.", "Gotcha.", "Oh, boy.", "Hey.", "Easy.", "What happened? Am I okay?", "Oh, I see what happened.", "He went downstairs and killed everyone else.", "Phew. That worked out.", "♪", "- Terry. Terry.", "Terry, are you okay?", "- I'm fine. But that dog came right at me.", "And I have no idea why.", "- It looked like you had a lot of food in your pockets.", "- What? No. That's not true.", "This jacket never had any pockets.", "This is the style. - Oh, my God.", "You did think I was poisoning you.", "- I mean, you were the one who said he spent", "every day in prison dreaming of the day we'd meet again.", "- So I could prove to you I'd changed.", "- You said you put something extra in my food.", "- Love.", "- Well, you said it so creepy.", "Look, tone is everything, man.", "- I've been talking to a cinder block wall", "for the last ten years.", "I'm sorry if my social skills leave something to be desired.", "- That is a really good explanation.", "- Everybody, the dog's leashed up out back.", "Did anyone get hurt?", "- We're all fine, thanks to this guy.", "Tackling a pit bull without spilling your whiskey, badass.", "- Eh, it was nothing.", "His teeth couldn't even penetrate the jacket.", "- Hey, I have a spot opening in a weekly poker game.", "You interested? - But you said I could come.", "- I just think Broadway star Sutton Foster", "is gonna like the other guy a little bit better.", "- No.", "- Everybody, I am so, so sorry.", "I don't understand how Linus got out.", "I had him locked upstairs in my bedroom.", "I have the key right here.", "Wait, where's the key?", "- All right, quit joking around, guys.", "Who's got the key?", "- You broke into my bedroom?", "- Well, this wouldn't have been a problem if didn't have", "a vicious guard dog that's protecting her secrets.", "- Linus is not a guard dog, and he's not vicious.", "He was locked in my room,", "because she gets skittish around crowds.", "I just rescued him from a dog-fighting ring.", "Aww.", "- Don't aww her, all right.", "She's a liar, and I have proof.", "Remember how she said she' didn't know Madeline Wuntch?", "Well, then explain why she has an email from her", "dated two weeks ago, subject: Raymond Holt.", "- Mm-hmm.", "- Peralta, why don't you read that email aloud for everyone?", "- Oh, you'd love that, wouldn't you?", "Wait a minute. Why would you love that?", "This is gonna be bad for me, isn't it?", "Amy, you read it. - No.", "- I'll do it, Jakey. - Oh, the old Charles is back.", "- \"Julia, we've never spoken...", "- Mm-hmm, four words in, and it's already pretty bad for me.", "- \"But your transfer to the Nine-Nine is a foolish one.", "\"They are a dysfunctional precinct commanded by\"", "a rancid old prune, Raymond Holt.", "\"But in recognition of your exemplary service,", "I will honor your wishes. Wuntch.\"", "- But then why are you at the Nine-Nine?", "- I'm here for you. - Aha!", "- Because you're my hero.", "- Oof. I am off today.", "- You overcame so much to become a captain.", "It made me feel like I could accomplish anything.", "So when the chance came up to work with you,", "I jumped at it.", "- But why not just tell me that?", "- Because you were so down about being in uniform,", "I didn't want it to come across as pity.", "- Oh, well, what a sweet and thoughtful moment,", "which would not have been possible without my meddling.", "- How dare you try to weasel out of this", "when the love of my life is splattered", "all over that room.", "- The chair?", "- Get her name out of your mouth.", "- Her name is the chair? - I warned you.", "- So you think things will be weird with Captain Kim?", "- Nah, she's so perfect.", "I'm sure she's already moved past it,", "and we'll have a great year together.", "- Yeah. - Yeah.", "- Captain Kim asked for an immediate transfer.", "She is no longer a part of the Nine-Nine.", "- What? - She said that she respected", "you all, but there was obviously", "too much history here", "and she'd always feel like an interloper.", "- Oh, man, you guys.", "I almost feel like this is all my fault.", "- Agreed. - What?", "You encouraging me.", "You kept saying, \"Mm-hmm.\"", "- I was going through something difficult.", "You have no excuse.", "- He's kind of right, Jake.", "What was going on there? - I don't know.", "I guess I'm just overly paranoid", "from everything that's happened here, you know,", "with Kelly and Wuntch and Trevor and Rolf.", "- Who's Rolf? - Oh, mom my dated Rolf", "after she broke up with Trevor.", "He was also a limo driver, and he also cheated on her.", "The problem is with limo drivers.", "- Babe, it's not. - It's not?", "- No. - Okay, thanks. I love you.", "- Look, man, I get it.", "There's no question we've been burned a bunch as squad.", "But you not giving someone the benefit of the doubt", "cost us a good captain.", "- I know. You're right. Look, I'm really sorry.", "- But your heart was in the right place.", "- And I had to pay Captain Kim, like, $3,700 in damages.", "- You did what? - The point is,", "everyone accepted my apology, Amy, right, Charles?", "- You betcha, Jakey. - See?", "- Not a doctor. - Shh."]