[">What's this meeting about?", "Did someone find my meatball sub?", "A, we would never have a meeting about that.", "- B, you are holding it. - Oh.", "Meeting adjourned.", "Meeting's not over, dummy.", "Terry said he had some news from the office", "of Commissioner Wuntch.", "What does that human blister want now?", "Does she intend to demote me even further?", "Or perhaps she'll transfer me to the swamps of New Jersey", "so I can patrol the sinkhole where she was spawned.", "Or it's possible the announcement has nothing", "- to do with you. - Oh, good thinking, Peralta.", "You're right.", "Maybe Madeline wants to inform", "us all that she's a Cheuksin.", "- A what? - A Cheuksin.", "A Korean toilet ghost, lives in an outhouse,", "wraps her hair around your throat and chokes you to death", "- while you move your bowels. - You know what?", "I will give you $6,000 if the announcement", "is she's a Cheuksin.", "- Okay, everyone. - I have some news.", "That Madeline Wuntch is a Korean toilet ghost?", "Boring. We already knew that.", "Madeline Wuntch is dead.", "Say what now?", "- Wait, Wuntch is dead? - Yeah.", "The Commissioner's office just notified us.", "No way that's true.", "As Wuntch says when she sees deodorant,", "\"I'm not buying it.\"", "- Sir, she's dead. - Oh, Terry.", "Zombies can't die. This is some sort of scam.", "If she were dead,", "we would be hearing the sounds of children", "- singing in the streets. - I don't know, sir.", "You didn't believe it when we told you", "the Disco Strangler died, either.", "- And I was right. - He was faking it.", "Maybe she's alive.", "Why would Wuntch fake her own death?", "The same reason she visits Mexico once a year", "and sucks the blood from all the goats.", "For kicks.", "Look, I don't know what to tell you,", "but she's dead. What do you want?", "To open up her coffin and check for yourself?", "Oh, she's very dead.", "Hello, gentlemen.", "Guess who's walking the red carpet this Saturday?", "- Chord Overstreet. - Who?", "- Sam Evans from \"Glee.\" - No, me.", "Why would you guess that? I was clearly talking about me.", "Okay, but for the record,", "I bet Chord Overstreet will also be walking one.", "Stop talking about Chord Overstreet.", "No, I'm going to the world premiere", "of \"Kwazy Kupcakes: The Movie.\"", "- Whoa! - How'd you get the invite?", "- My buddy Mikey J. - Hooked me up.", "- Oh, your ska friend? - Did he work on the movie?", "No, he submitted an unsolicited script", "that a producer accidentally opened", "so legally they had to give him a \"story by\" credit,", "and now I've got four tickets.", "- Wow. - So who you bringing?", "You know, Cagney and Lacey love \"Kwazy Kupcakes.\"", "- They are crazy Kwazy fans. - Huh, cool.", "Well, if you guys are free this Saturday...", "Stop, before you say anything you regret,", "you should know that \"Kwazy Kupcakes\"", "means a lot to Nikolaj.", "At the orphanage that game was his only friend.", "Touching, but Cagney and Lacey", "don't have any friends at all.", "Maybe they can make some at this event.", "So what do you say, Jake?", "- Whose kids do you like more? - What?", "Wait, wait, wait. That's not what this is about.", "No, Boyle's right. Whose kids do you like more?", "- Tell us now. - Okay.", "You guys are being really intense.", "I like all of your kids an equal amount.", "Just give me some space and I'll figure out", "- who I'm gonna take. - Okay, backing off.", "- Stepping away. - Making room.", "- Letting you breathe. - Thank you.", "Did you both just send me pictures of your kids crying?", "Both: No.", "Ding, dong, the Wuntch is dead.", "Bagels for everyone!", "So I guess you believe it now.", "Yep. Wanna see the selfies I took?", "- Actually, yes. - I'll share the album with you.", "Oh, my God!", "I just heard about Wuntch!", "She was so young!", "For a redwood tree.", "Uh, I don't understand what's going on.", "- Why are you crying? - A person is dead.", "- I feel sad. - That's insane.", "You don't feel sad when a monster dies", "in a monster movie.", "In \"E.T.,\"", "do you feel sad when E.T. dies?", "- Yes. - He wasn't a monster.", "- He caused a real commotion. - It isn't just Wuntch.", "I started seeing a fertility doctor", "and she has me taking hormones to help with ovulation", "and my emotions are in overdrive.", "Well, I know just the thing to cheer you up.", "Wuntch is dead! Bagel!", "Bagel! Bagel!", "Sir, I am loving this color on you,", "but don't you think you should tone it down?", "Why, in case I run into her family?", "I'm not planning any trips to the Bronx Zoo.", "Wait.", "Does this mean you're gonna be captain again?", "It does.", "The Chief of Personnel called", "to say the promotion is in the works.", "Her death means I've won.", "It's finally over.", "An email from Madeline Wuntch?", "Subject line, \"It's not over.\"", "My friends,", "I have a proclamation to bestow upon ye.", "Why are you talking like that?", "And why'd you have us come in here?", "Is this about the tickets?", "It is indeed about said tickets,", "and said proclamation about said tickets is in fact...", "Jake, just tell us. No one is liking this.", "I'm loving it. You sound so smart.", "Oh, thank you, my loyal subject Charles.", "Now, as you know, this decision has been quite hard upon me...", "Title of mine sex tape... but I have made it at long last,", "and it is my decree that the recipient shall be...", "- Both of you. - What?", "Did you talk to Mikey J. And get more tickets?", "Indeed I did not,", "but it is my decision", "that I will cut all", "- of said tickets in twain. - Twain?", "Terry doesn't want a twained ticket to \"Kwazy Kupcakes.\"", "That's not how tickets work.", "- You'd just be ruining them. - None of us would get in.", "- Are you dumb? - No!", "All right, full disclosure.", "I was trying to do that Bible thing", "and then one of you was gonna take the high road", "and say that rather than see the tickets destroyed,", "you would just bow out,", "and then that person", "was gonna get the tickets.", "Nope.", "If I don't get them, no one does.", "Agreed. Boyles or bust.", "- Cut them up. - I'm not gonna do that.", "I'm just gonna have to think of another way to figure this out.", "Stupid Bible with stupid lessons never solved crap!", "So you were right.", "Wuntch was not able to claw through her coffin", "and write the email herself.", "It turns out, the lawyer for her estate sent it.", "I wish I had taken the LSATs.", "Not to be a lawyer. Just seems like a fun test.", "- Dude, you're bumming us out. - All right.", "Uh, the email contains a link to a video.", "I'm going to play it. Brace yourselves.", "If it shows Madeline,", "be sure not to look directly into her eyes.", "- Because we'll turn to stone? - No.", "Because her eyes are ugly.", "Hello, Raymond. Surprised to see me?", "Well, I didn't say Bloody Mary three times,", "- so yes. - When did she record this?", "Judging by the flames around her,", "it could be a livestream.", "Very good, Rosa.", "I'm sure you consider my untimely death a victory,", "but I'd never let you win.", "I told everyone that in my final days,", "we reconciled and you insisted on hosting and organizing", "my NYPD memorial service.", "I know you won't be able to resist badmouthing me", "at the service.", "All the top brass will be there,", "and when you speak ill of me,", "it will end your career.", "It's over. I won.", "Bye, Raymond.", "- Oh, no. - I'm doomed.", "Seriously?", "All you have to do is not insult a dead woman", "- at her own memorial service. - Exactly.", "It's impossible.", "Oh, you must be feeling better.", "You're heating up your favorite meal; beans.", "They're refried.", "It's bad enough they were cooked once,", "let alone twice,", "and now the toaster oven makes it three times.", "I couldn't be crying for help any louder.", "So I take it you couldn't get out", "of organizing Wuntch's memorial.", "Oh, no. It's impossible.", "She has bested me yet again.", "Well then stop being such a moron, you idiot.", "- Amy! - Sorry, it's the hormones.", "They're making me really irritable.", "Angry Amy's right.", "All you have to do is say a few nice comments", "- during the memorial. - As God said", "when Wuntch tried to sneak past the gates into heaven,", "\"It ain't happening, honey.\"", "I tried to write a kind speech about her last night,", "- and this is what came out. - Oh.", "It's, like, 20 pages long.", "- Why is it in all caps? - So I remember to yell it.", "Oh, well, you obviously can't read any of this.", "Look, since you can't say anything nice,", "try saying the opposite of whatever you're thinking.", "Interesting.", "I'll give it a whirl.", "Madeline Wuntch was...", "- A friend. - See?", "It's not that hard to say something ni...", "Oh, you're vomiting.", "- Hi, Jake. - It's me, Nikolaj.", "Hey, bud. What are you doing here?", "It's Thursday.", "Shouldn't you be at tailoring class?", "I want to say thank you.", "Dad said that you were giving us tickets", "to the \"Kwazy Kupcakes\" movie.", "- Oh, he did, did he? - Excuse me one second.", "- Of all the twisted moves! - Don't hate the player.", "Go ahead. Tell Niko he's not going.", "I dare you.", "Hey, listen.", "Niko, there's something I gotta tell you.", "Both: Uncle Jake! Uncle Jake!", "- Slow down, girls. - No need to run.", "Uncle Jake is family.", "Now, what do you wanna say to Uncle Jake?", "Both: Thank you for the tickets.", "Oh, that's so cute how you said that", "at the same time without rehearsing it in the car.", "- It sure is. - Hey, Terry, Charles,", "can I speak with you in the break room for a moment?", "Uh, hey, kids, look at this.", "Pimping out your kids?", "I hate to say this, but you two", "are acting like bad dads, and I should know.", "One time my father forgot to pick me up from school", "'cause he was having sex with my best friend's mom.", "Oh, my God. That's terrible.", "Yeah. I was 15.", "I just walked to the mall", "and watched \"Empire Records\" by myself,", "but the point is, you're both acting ridiculous.", "No, this is on you, Jake.", "- You need to make a choice. - That's not fair.", "You both want to go and I don't want to hurt either of you.", "But maybe I don't have to.", "I can let fate hurt you. We'll flip a coin.", "Terry, call it in the air. Heads or tails.", "Neither.", "Oh, my God.", "Did you just fold my quarter in half?", "Fate's a bitch.", "You make the choice.", "Wow, wow, wow, wow, wow, wow.", "Just so you know, I would never bend your money.", "- Yeah, 'cause you can't. - Correct, I cannot.", "- No one can. - How did he do that?", "Now these fertility drugs are making me sweat.", "- Is it noticeable? - No.", "- Yes. - Oh.", "I thought we were gonna lie to her", "because it's so upsetting to look at.", "Just tell me what room the memorial is in.", "We don't have a lot of time to set up.", "About that.", "Yesterday before you convinced me", "to hold a respectful service,", "I sent some instructions for how I wanted the room to look.", "We may need to make some tweaks.", "- So many balloon arches. - I know.", "It all has to go. Okay!", "Everyone, we have work to do.", "- Better? - Much.", "But to be clear,", "the first version was dope", "and you have my respect for life.", "Excuse me.", "Is this the memorial for Madeline Wuntch?", "Yes, this is the memorial for Madeline Wuntch.", "Just saying her name brings tears to my eyes.", "Why, because her heart was made of onions?", "Excuse me?", "Madeline Wuntch was what you get", "when you cross a slug with an anal fissure.", "We spent our entire lives trying to destroy each other.", "I was her one true nemesis.", "No.", "Hey there, Jake.", "I felt bad about folding", "your quarter in half,", "so I got you a new one.", "Thank you. But that's not a quarter.", "Wow, you're right.", "That happens to be an 1883", "Carson City silver dollar in near-mint condition", "complete with commemorative case.", "That's gotta be worth $138.", "You know what? Keep it.", "Shame.", "Shame, Terrence Jeffords, shame!", "You probably didn't realize this, Jake,", "but the lieutenant over here is trying to bribe you.", "Yeah, I don't think he's hiding that.", "- I am not. - Well, neither am I.", "Here's a check for $200.", "Another silver dollar.", "Ooh, looks like I'm up to 276.", "Well, here's a second check for $77.", "- I am up one dollar. - Four more.", "How many silver dollars do you have?", "As many as it takes.", "Well, this checkbook is only on 304,", "so I can write checks all day long.", "- Well, you know what? - Here's my watch.", "- Yeah, melt this down. - Enough!", "I'm tired of being stuck in the middle of this.", "You figure out who gets the tickets and tell me.", "That should keep them busy for a little while.", "Hey, Jake, we've decided how to settle this.", "We're gonna duke it out in the ring.", "What?", "That man is lying.", "I don't believe Wuntch had another rival.", "I saw it in her eyes.", "She only had hate for me.", "- Are you jealous? - Of course I am.", "I despised her with my entire being", "while she was only despising me with a fraction of hers?", "Sir, you were doing so well, okay?", "Don't let this rattle you.", "Are you wearing sponges in your armpits?", "If you have a better way to soak up sweat,", "I would like to hear it.", "Where are you going?", "To find out if there was another man.", "- So, um, Adam is it? - Mm-hmm.", "I only ask because Madeline never mentioned you.", "Interesting, 'cause she mentioned you to me,", "- as a friend. - Friend?", "- Mm. - I think you added an \"R\"", "- to the word \"fiend.\" - No, I'm sure it was friend.", "I mean, based on context alone,", "I wouldn't say somebody was one of my closest fiends.", "Oh, you might.", "We had a very contentious relationship.", "She never forgave me for embarrassing her", "in front of Derek Jeter.", "Well, I embarrassed her in front of A-Rod", "and J.Lo together.", "For 15 years I replaced her anti-wrinkle cream", "with sour cream.", "I replaced her Lactaid pills with Tic Tacs.", "Dead moron was crapping her pants for months.", "She hacked into my Netflix account", "and watched the \"Lizzie McGuire\" movie", "on repeat to ruin my algorithm.", "She made me guard that doctor", "who came back to New York with Ebola.", "Sir, maybe you want to keep it down.", "There's people... That witch ruined my life!", "She demoted me from captain to uniformed officer.", "Eight years ago she had me kicked off the force entirely.", "You were not her greatest rival,", "and the proof is right here.", "Hello, Adam.", "I may be dying", "but I burned down your cabin in Maine.", "You were my one true rival.", "There you have it.", "I meant nothing to her.", "That cockroach Madeline was two-timing me!", "No sign of Holt anywhere.", "I know that's important,", "but I don't think I can just breeze past", "the outfit, \"Sister Act.\"", "I sweat through my clothes", "and I found this in the back of a closet, okay?", "- Deal with it. - You look great.", "- Oh, there he is. - Sir, over here.", "Where are you?", "Why are you holding the mean yelling speech?", "Because I'm gonna yell it, meanly.", "I wasted half my life hating that duplicitous hag,", "and she didn't even have the decency", "to truly hate me back.", "Well, screw her.", "- I'm gonna ruin her memorial. - No, you can't do that.", "If you read that speech, you'll be fired.", "You're right.", "And that would ruin my career.", "And it's worth it.", "I'm giving the speech.", "No, that's what Wuntch wanted.", "- You're letting her win. - Sweaty Amy's right.", "If you really wanna get back at her,", "you'll team up with Adam", "and give her a nice funeral.", "It's like \" The Durrells of Corfu\"", "when Prudence and Louisa joined forces...", "To sink the catamaran of the bookseller Yorgos", "who wronged them both. Yes!", "I will team up with Adam.", "Wow.", "For a moment there,", "I almost forgot who the real villain was.", "- The woman who recently died. - Mm.", "Charles, why did you let Terry choose boxing?", "- He didn't. - I picked it.", "- But you'll die. - Don't worry about it.", "Boxing's in my blood.", "My Nana Boyle boxed in the Navy.", "I'm sure she did but... And hear me out...", "What if you're not as strong as your Nana Boyle?", "I can handle myself.", "She taught me her signature punch;", "- the Strawberry Basket. - That does not reassure me.", "Hey there, big guy.", "You sure you're feeling okay about ending Charles' life?", "Yep, my girls are gonna see this movie.", "Right, well, before you commit manslaughter,", "I do feel compelled to tell you that the movie", "only has a 38 on Rotten Tomatoes.", "Jake, stop yapping and let them fight.", "I wanna see the big guy pop the little guy's head off.", "Yeah, let's start the fight!", "I wanna pop that little guy's head off!", "You're clearly the little guy.", "Good one, Jake.", "- All right. - I guess this is happening.", "Touch gloves.", "Charles, it's been very nice being your friend.", "Terry, I'll visit you in prison.", "And...", "- Fight. - Strawberry basket!", "Whoo, yeah!", "You mess with Grandma,", "you're gonna get the basket!", "Charles, you punched him in the nards.", "Yeah, Nana fought nasty.", "Now if you don't mind, I'd like those tickets.", "I didn't hear no bell!", "Jake, I think those tickets are mine.", "Strawberry basket!", "- Guys, stop! - It's a movie about cupcakes!", "- You don't understand! - You don't have kids!", "Wow, that speech would have been amazing.", "I had to look up what a toilet ghost was.", "Uh, yes, I took a trip to Korea", "just to research a new Wuntch insult.", "In fact it's been a motivation", "for most of my international travel.", "- Mm. - So you guys are friends now?", "Uh, yes, it seems we have a great deal in common.", "Well, one thing.", "Both: Hating Wuntch.", "I read him the obituary I wrote for her,", "but the \"Times\" wouldn't publish it.", "It had too many obscenities.", "And I read him my all caps speech.", "- And I loved it. - It was like poetry.", "Madeline smelled like dog crap.", "Raymond convinced me the best way to get back at Wuntch", "is to make sure he doesn't get fired.", "Also I'm just gonna chisel a penis onto her headstone.", "And I'm gonna watch.", "Please take your seats.", "Well, uh, time for me to go", "make a tear-jerker of a speech.", "Hey, I thought of the best hashtag", "to post with my photo of the grave penis.", "I'm not on board with that friendship.", "Yeah, there's something weird about that guy.", "Hey, when did he say he got kicked off the force?", "- Eight years ago. - That doesn't add up.", "He said Wuntch sent him to guard the Ebola doctor.", "- Wasn't that six years ago? - Yeah.", "Oh, my God.", "Wuntch sent him to destroy Holt.", "Good afternoon.", "On this sad day,", "I'd like to say a few words about Commissioner Wuntch.", "Madeline smelled like dog crap.", "I'm sorry.", "I... I don't know what...", "From a sick dog.", "Adam, what are you doing?", "I'm showing everyone your true colors, Raymond Holt.", "Enjoy the show, people!", "Madeline Wuntch will not soon be forgotten.", "Trick or Treaters will dress like her for generations.", "- Hey! - Diaz, delete all the videos.", "Deleted.", "- It's over. - Yeah, for you.", "Everyone who's anyone in NYPD", "just saw you for your true self.", "- Your career is ruined, Ray-Ray. - Who are you?", "- Why are you doing this? - I'm Madeline Wuntch's nephew.", "She sent me here to carry out", "the final phase of her master plan,", "and now it's all over. Wait, why are you smiling?", "Because, Adam, this isn't the real memorial.", "- It's all a ruse. - What?", "Yeah, what?", "I knew Wuntch had one", "final trick up her sleeve.", "I didn't know what it was,", "so I had to be prepared for anything.", "This whole thing was staged.", "None of these people are real mourners.", "They're not even in the NYPD.", "- You hired actors? - Worse.", "They're members of local improv troupes,", "and they did it for \"the exposure.\"", "This has been a blast,", "but we have to go start a flash mob at the Freedom Tower.", "Oh, check out our YouTube channel.", "- No. - Sit down.", "I have to hand it to you, Adam.", "You almost fooled me,", "but no other man could possibly", "have what Wuntch and I had.", "We were star-crossed haters.", "Whatever.", "I still inherit half her estate", "- just for trying this. - Cool.", "Who gets the other half of every child's nightmares?", "- I love it, Rosa. - Great work all day.", "So how are you two feeling after your little boxing match?", "- My head hurts. - I can't feel my strawberries.", "I meant more emotionally and less groinally,", "but listen, ever since I brought these tickets up,", "you guys have made my life absolutely miserable,", "but that ends now, because I've made a choice.", "- Cagney is sick. - We don't know how long she has.", "- We do know for Nikolaj. - It's 36 hours.", "- Just stop, all right? - Stop lying.", "This is exactly the type of behavior", "that has led me to decide that I'm not taking either of you.", "- Seriously? - Oh, man.", "The kids are gonna be so disappointed.", "No, they won't, because they're going.", "That's right, I'm bringing all three of them", "by myself and you two don't get to go.", "Your childish behavior has led you to miss out", "on the most exciting movie premiere event", "in the state of New York this Saturday.", "I hope you've learned your lesson.", "Good day.", "Wait. He's taking the kids for us?", "It's just like getting a free babysitter.", "This is incredible.", "People without kids are so stupid.", "- They're gonna destroy him. - Yeah.", "So just to be clear,", "this service is actually real, right?", "Oh, yes.", "I figured if I needed two fake memorials", "to smoke out Wuntch's plan,", "she deserved to win,", "but she didn't win. I did.", "Finally beat the old fishwife.", "It's crazy.", "After today you never have to think", "about Madeline Wuntch again.", "Yes, I suppose you're right.", "Sir, does that make you sad?", "I don't know.", "I think maybe...", "Yes?", "Well, I think it's natural", "to feel a little down about her death.", "For the last 20 years, your lives have been entangled.", "Because of her ratty hair.", "No, it's not the same.", "Now it just feels like I'm insulting", "- a helpless dead person. - You are.", "It's what you've been doing all week.", "Yeah, it's been tight.", "Well, it's time for my speech.", "Sir, what are you gonna say?", "I don't know.", "Maybe I'll just be honest.", "Did he say he was gonna be honest?", "Yeah, this is gonna be bad.", "As many of you know,", "Madeline and I were bitter rivals,", "but I've come to realize", "she held a special place in my life.", "No one challenged me like she did", "or made me feel as alive.", "Our relationship was like an epic chess match.", "And it's hard to believe that...", "She'll never make another move.", "Unless...", "No, it's just a notification.", "Cheddar's doggy toothpaste has shipped.", "So she is gone,", "and I wish she were not.", "I will miss you, Madeline Wuntch.", "Wario, why are you like this?", "Hey, so I don't know if you noticed,", "but ever since I started those hormone treatments...", "I didn't notice anything.", "You said that way too quick.", "I mean, you did cry at that one car commercial", "and it wasn't even an emotional one.", "- It was about towing capacity. - Yeah.", "Well, I called the doctor", "to see if that was a common side effect", "and apparently, it isn't.", "Oh, no.", "- Is everything okay? - Yeah.", "She did have one guess as to what might be causing it.", "And, um, she was right.", "Ames.", "- Are we having a baby? - We're having a baby.", "It happened!", "- Not a doctor. - Shh.", "Fremulon."]