[">Can you believe this, Scully?", "Looks like we're the only responsible people", "who show up on time anymore.", "And they're always calling us lazy, but where are they now?", "- I don't see them. - They're not here.", "- But you know who is? - Hitchcock and Scully.", "The oafs - The bozos.", "- The... - Idiots!", "What are you doing here? The building's being fumigated.", "There were so many emails.", "There were? We didn't...", "- Lightweight. - That's your takeaway?", "It just doesn't seem like he should be that fast", "for how big he is Gah, I hate Wario.", "Peralta, my office.", "Oh, Kevin's here And you both look so upset.", "Oh, no, did they stop funding the arts?", "They did, but that doesn't matter anymore.", "Nothing does Cheddar has been kidnapped.", "- Someone took our fluffy boy. - Oh, my God.", "What happened?", "Well, Cheddar and I walked to the bakery together,", "we shared a plain scone Then we went to the park,", "and I let him off leash He never came back.", "- Someone took our fluffy boy. - Right, you mentioned that.", "Now, just to be clear,", "you didn't actually see someone take him, right?", "So there's a chance Cheddar just ran away.", "- You know like some dogs do. - Cheddar isn't some dog.", "He would never do that Someone took our...", "Fluffy boy, yes, I understand", "I need you to drop everything.", "Nothing in the world is important to me as this dog", "I wouldn't say nothing.", "For example, you and I are very close.", "- We don't have time for this. - Okay.", "In kidnappings, the first 48 hours are the most crucial.", "Right, and in dog years, that's only seven hours.", "- Why would you say that? - This is why everyone", "- prefers that dog to you. - Everyone?", "Okay, look, I'm just saying", "that before we jump to any conclusions.", "We should consider the fact", "that there's no actual proof that someone kidnapped Cheddar.", "It's a text It reads,", "\"I have kidnapped your dog\"", "I see Well, that seems", "like pretty hard proof.", "That's good Good proof.", "- Whoa? - What?", "Oh, sorry, didn't see you there.", "Yeah, that was clear What's going on?", "- Why you dork dancing? - A baby store in Dumbo", "is having a contest to win a Snoog.", "Who or what is a Snoog?", "- Are you kidding me? - It's only the best roller.", "It has the versatility of Sporjule,", "the safety rating of a Fajerb,", "and an even smoother ride than the Kinderbuscht.", "Are you having a stroke?", "All the best strollers are from Scandinavia,", "where they don't hate people for having children", "I saw \"Midsommar\".", "Those people have their own problems.", "A Snoog is my dream stroller,", "but it's way too expensive.", "What's the contest?", "It's an endurance competition.", "Everyone has to stand with one hand on the stroller,", "and if you let go, you're out.", "Last person holding on wins.", "Sounds painful Can I come?", "Aww For moral support?", "Sure That.", "Okay, sir,", "the kidnapper should be calling with his demands any minute.", "If we trace his location, we can find your fuzzy boy.", "Not fuzzy He's fluffy.", "We don't know what he is anymore.", "He could be fuzzy, he could be anything", "Raymond, he could be scruffy.", "Now you've upset Kevin I hope you're happy.", "Why would I be happy?", "I clearly just mixed up fuzzy and fluffy.", "\"Just?\" You're fired", "I want your shield and your piece.", "- That seems a little extreme. - Jake is right.", "- Thank you, Kevin. - Just suspend him without pay.", "Why did you ask for my help?", "He's calling - Sir, remember,", "we need two minutes for the trace.", "Two minutes, understood.", "So just keep him talking and stay calm.", "Peralta, I'm in complete control.", "- Hello? - Shut your damn mouth", "- I'm the one talking here. - Then this is over.", "And he hung up.", "Well, that could've gone better.", "Come on, Terry You can pick up that paper.", "No, forget it It's only a first offence.", "Is everything okay, Lieutenant?", "You've been groaning all morning", "I'm sore from my workout My muscles hurt so bad.", "Look Ow, ow, ow, ow, ow, ow, ow.", "Come with me, friend I have exactly what you need.", "Bone broth!", "It's an old Boyle family recipe", "I drink it after every workout, and I'm never sore.", "Boyle, I don't think we're maxing out", "at the same weight at the gym.", "Oh, Terry, they're just numbers.", "You'll get there.", "Hey, there you are, and oh, my God what is happening?", "I've gotten mad, and now I'm getting even.", "Okay, look, Sir, I know you're upset,", "but you need to stay calm and treat this like any other case", "I mean, I can't believe I'm gonna say this,", "but now is not the time to go all John Wick.", "Who's that? A friend of yours?", "I wish, but he's not a real person.", "He's a movie assassin that goes nuts", "when someone messes with his dog.", "Then call me \"John Wicks,\" 'cause I'm about to go nuts.", "It's \"Wick,\" singular, and you already did go nuts.", "It cost us the trace, remember? Look, I need you to focus.", "The kidnapper texted his demands.", "How much does the bastard want for my little doggy?", "Oh, that's just it He doesn't want money.", "He requested all the files we worked from May 2004.", "It's a lead.", "He's gotta be connected to one of those cases somehow.", "Interesting.", "You know what else is interesting?", "- Hmm? - Grenades.", "Just please, stop it I'm gonna take Kevin", "to the park where Cheddar was kidnapped and look for clues", "I need you to stay here, go through those files,", "and put together a list of potential suspects.", "- Can you do that? - Okay, fine", "- I'll go through the files. - Great.", "You realize I can't leave", "until you put the grenades back, right?", "Oh, but you let John Wicks have grenades?", "It's \"Wick\" Singular.", "Just put 'em back.", "Okay, Kevin, we need to recreate your morning", "and see if we can find some clues.", "All right, Cheddar and I entered", "on the east side of the park over past those trees...", "Oh, how he loved those trees", "Jake, I don't know if I can do this.", "Yeah, you can do this, I'm right here with you.", "We're gonna get through it together.", "Now let's go -", "Oh, hey, Kev, bud, couldn't help but notice", "that when I said, \"let's go,\" you didn't go.", "You stayed here and stared at that bench.", "Cheddar loved benches.", "He'd run up to them Sniff their legs.", "Paw at them with his...", "Paws, sure, that's what you paw with.", "I'm sorry This is impossible.", "Everything I see reminds me of Cheddar.", "The grass, the asphalt, squirrels...", "- Cheddar loved squirrels. - Oh, stop.", "He loves to chase them I suppose I should say loved.", "He'd never get there He's like...", "Eeyh, Kevin, stop, all right?", "We need to get over to that gate and recreate your morning,", "and if seeing all these things is too much,", "- then just focus only on me. - Okay.", "All right, stare straight into my eyes.", "Very good, I will stare straight into your eyes.", "Okay Oh, wow.", "Piercing Huh, okay, so let's do this.", "And we are heading to the east gate, we're doing great.", "This is working I can do this.", "Here we go - I'm doing it.", "- You're looking away. - No, I'm not.", "Stop looking away - I'm not.", "- Don't look away. - But I see leaves.", "- No! - Cheddar loved", "playing in leaves Didn't matter what kind.", "Oak, maple, elm.", "Wait, I hate to cut you off, but look what I found.", "Security camera.", "Cheddar loved security cameras.", "How is that possible?", "Oh, Rosa, there she is The Snoog!", "Look at those sexy lines.", "Oh, I just wanna get behind that thing and push.", "Aw, man, you're grossing me out.", "What is Teddy doing here?", "- Teddy? - Oh, my gosh, hey Amy.", "Right, boring ex-boyfriend Teddy.", "Hey, Teddy - Hey, Rosa.", "- What are you doing here? - You promised you would stop", "showing up places to propose to me.", "Quit flattering yourself I only did that four times.", "Also, I'm taken now", "I got married, last year, in the spiciest little city", "Phoenix It was very posh.", "We served a flight of large batch Pilsners", "I don't know if you remember, but I love...", "- Pilsners. - Yeah, we remember.", "Yeah, long story short, we're pregnant now,", "and I'ma... I'ma try and win this sexy little number.", "Oh, God, is that what I sound like?", "Yep - Excuse me.", "Are you here for the competition?", "Uh, yes, hi I'm Teddy Ramos.", "Took my wife's last name Very brave.", "He's the worst.", "Hi, I'm Amy Santiago", "I am so sorry,", "but pregnant women aren't allowed to compete.", "Not after what happened last year.", "Are you gonna say what happened?", "It's part of the settlement We can't.", "Okay.", "Well, uh, good news: I'm not pregnant!", "- I just had a huge lunch. - I'm so sorry, I just can't.", "All right, I'll compete for her.", "What? You will?", "But I know you think these strollers are dumb.", "They are, but I can't let that boring bastard win.", "So we decided to paint the baby room white", "I mean, you used to have sex with him", "I know.", "Charles, this Boyle bone broth is incredible", "- I'm not sore at all anymore. - I told you it works.", "The Boyles used to drink it during potato digging season", "to keep everyone healthy in the furrows.", "You know, I bet we could sell this stuff.", "You really think so?", "We can call our company \"The Bone Boys\".", "No! \"More Bone, Less Moan\".", "No! \"Workplace Bone Buds\".", "That's the one I'm registering it.", "Ewh, we can name the company later.", "Anyway, I know just who to pitch this to.", "My buddy who invented Muscle Malt.", "This is great!", "We're the perfect partners.", "When it comes to cooking, you got me.", "When it comes to being ripped, you also have me.", "And you have a little connection.", "We're gonna be rich -", "Sir, we're back.", "Find anything in the case files?", "Yes, most of them were useless, but one caught my eye.", "On May 15th, 2004 detectives arrested Frank Kingston,", "leader of the 16th Street Gang.", "Thanks to the testimony of confidential informant,", "Kingston served 16 years He just got out last month.", "And you think he wants the file to figure out", "which one of his guys turned on him to get revenge.", "- It's a Vendetta. - Vendetta.", "Sure.", "So now I know who the sumbitch is who took my dog.", "The only problem is,", "I have no idea where to find that sumbitch.", "Well, Raymond, I think we can help you find that sumbitch", "Jake?", "Sumbitch We all got to say it.", "Let me show you what we found: A security camera grabbed", "some footage of Cheddar being picked up and put into a car", "which was registered to an anonymous shell company", "on Dean Street We can be there in 15 minutes.", "That's weird It's sunny outside.", "Why's that weird?", "Because a storm is about to rain down", "on that punk.", "Oh, my God, I fell for it, and I loved it.", "All right, let's gear up Kevin, you stay here,", "and don't worry We're gonna get your dog back.", "So we did not get your dog back.", "Unfortunately, he wasn't here No, no, no", "I think Captain Holt's taking it really well.", "So we'll see you soon.", "Wow, five hours.", "This is the most exciting contest we've had.", "Of course, the incident last year was exciting,", "but we all know how that ended.", "No We don't.", "Right Because of the gag order.", "Are you sure you wanna keep doing this, Rosa?", "You really don't have to.", "My feet hurt a little, but I can go as long as it takes.", "We're having a great time back here", "I was just telling my buddy Reggie here", "about this great salsa that I make.", "It's so mild you barely taste it.", "That's it I can't take any more", "I'm out - Bye, Reggie", "I'll send you that article about mailboxes.", "- Please don't! - Oh, my God,", "Teddy is boring people out of the competition,", "and he doesn't even realize it Can't let him get to you, Rosa.", "It's fine, I can handle boring We're friends.", "Ooh, guys, you will never believe", "who I saw at Bush Gardens last SUMMER: My neighbor.", "Yeah? Just walking around.", "The kidnapper said he would call with drop instructions", "- at 8:00 am It is now... - 01.", "Cheddar's dead.", "Cheddar is not dead It's just one minute.", "Perhaps the kidnapper's watch is slow.", "Oh, dear God, if his watch is slow,", "there's no telling what else this psychopath is capable of.", "Raymond, Cheddar is fine He's coming back to us,", "and that is why I bought a new GPS tag to put on his collar.", "Thank you, Kevin.", "At least some of us are thinking clearly.", "Yes, crystal clear In fact I bought 5 GPS tags.", "One for his collar and one for each arm and leg", "I'm going to make bracelets to put them on,", "and I'll never lose my Cheddar again.", "Okay, a little unsettling, but I like your positivity.", "Three minutes after 8:00.", "This man is unhinged.", "You said you'd call at 8:00 My watch is slow.", "Put the files on a flash drive,", "and have your husband bring it", "to the 9th Street entrance of Prospect Park at noon.", "My husband? No", "I'm not involving him in this I'll bring them myself", "I don't trust you", "I told you not to look for me, but you did.", "Send your husband or the deal is off.", "Clearly, we're not doing this.", "No, it's fine We can just alter the files", "and give him fakes.", "He'll never know - It's not that.", "It's that I refuse to put Kevin in harm's way.", "Understood, but I think maybe I have a way", "to put Kevin in danger", "without putting Kevin in danger.", "Well, hello there Raymond.", "It's me, Kevin!", "And I am Detective Jacob Peralta.", "We didn't have anything else to wear so we just switched.", "He understands.", "Okay, if we're gonna pull this off,", "we need to teach you", "how to move, talk, and act exactly like Kevin.", "In other words we have a \"Pygmalion\" situation.", "Exactly, a \"pig mailman\" situation.", "Raymond - It'll be okay.", "- What'll be okay? - Let's get started.", "- Yes, let's get started! - It's getting worse.", "Spot on, Kevin.", "Look, Raymond A yellow crested warbler.", "Look, Raymond A yellow crested warbler.", "No, you're too excited The warbler's a common bird.", "Ah - And then I said,", "\"Which 'Metamorphosis'? Kafka or Ovid?\"", "He loves it.", "He loves it -", "So that's the joke Now, you tell it.", "Oh, okay,", "so a professor walks in to a rare books collection...", "No, you've ruined it Now it's not funny.", "Look, Raymond A yellow crested warbler.", "Look, Raymond A yellow crested warbler.", "Ugh, not excited enough.", "They may be common, but they're still birds.", "At the 92nd Street Y,", "I had a wonderful symposium on just that topic.", "That's it You're getting it.", "Ah, cool, cool, cool, cool, cool, cool, cool.", "Don't say \"cool,\" instead say \"indeed\".", "Oh, indeed, indeed, indeed, indeed, indeed.", "It's weird.", "Look, Raymond A yellow crested warbler.", "Yes!", "That's the right level of excitement for such a bird.", "You captured the essence of Kevin.", "You've done it.", "Correction, I've accomplished it.", "Indeed - Indeed.", "Indeed, indeed, indeed.", "Indeed, indeed, indeed, indeed, indeed.", "It's growing on me.", "Oh, my God, Rosa", "I can't believe you're still here.", "And I can't believe Teddy looks so normal", "I'm 'onna win you that Snoo Slog.", "Snat... whatever, my brain is broken,", "I haven't slept in 72 hours.", "You've only been doing the competition for one night", "I mean, you're allowed to not sleep for other reasons.", "- Okay, I got you a coffee. - Oh, thank you.", "Just need to put my left hand on the stroller.", "My right hand grabs the cup My mouth do the sippin'", "What's happening?", "My broken brain won't talk to my body, so I'm doing it.", "Blink.", "Rosa, you don't have to do this.", "You can stop - Snarl at Amy.", "Teddy and I are the only ones left", "I'm 'onna win this", "no matter how much he talks about light rail systems.", "Ooh, you should ride the one in Akron, by the way.", "Very little noise - Oh, my God.", "Enough about light rails Let's talk trams.", "- Amusement parks get it. - I can't, I can't, I can't.", "If more cities adopted amusement park", "I can't, I can't.", "Oh, put your hands over your ears.", "Oh no, wait, Rosa!", "Hands are off We have a winner!", "Me?", "I won a stroller? Whoo-hoo!", "Oh, I see what I did wrong.", "It's okay Come on, let's get you home.", "Excuse me Amy.", "You can have the stroller for the right price.", "Okay, how much?", "Amy Santiago, will you marry me?", "No!", "Okay, I'm approaching the drop site", "I don't see anything unusual.", "We have eyes on you.", "Just be natural - Indeed, I will.", "Oh, look, a yellow crested warbler.", "Very good.", "He's calling Wait, Kevin,", "we didn't go over how you answer the phone.", "There isn't time Just answer.", "Okay.", "You've reached Professor Kevin Cozner.", "Please start speaking when I finish this sentence.", "Pick up the book on the bench and head south.", "He hung up.", "And he had me pick up a copy of \"The Tempest\".", "\"Tempest?\" Oh, no, Raymond.", "Do you know what's happening in the park today?", "The Shakespeare Festival which will be attended by...", "Guys, I'm in a sea of Kevins.", "Okay, between us, I think we made enough broth.", "Did you edit the presentation like I asked?", "You mean did I remove", "the tasteful photos of me stretching?", "- They weren't tasteful! - You were in a thong.", "All right, Muscle Malt Kenneth is on his way up.", "Hey, I just wanna say, no matter how this turns out,", "it was really fun working on this with you.", "Aw, Terry, it's gotta turn out well", "- I invested $11,000 in it. - $11,000?!", "It only costs 30 bucks to make the broth!", "Yeah, but it cost $11,000", "to buy the domain name \"workplacebonebudscom\"", "I am all in.", "Boyle, why in the world would you do that?", "You are such a... An amazing business partner", "Kenneth, I'd like you to meet", "my amazing business partner Charles.", "Hey - Hello", "I'm excited to see what you guys have here.", "Well, take a sip and feel the soreness", "start to drain away.", "Mmm.", "It's good Very tasty.", "Not only is it delicious, it's high in amino acids,", "and low in sodium.", "Well, not exactly low in sodium.", "It definitely has salt in it.", "Not in the batch I made I left it out", "Terry doesn't like to get all bloaty.", "- You left out the salt? - That stops the fermentation.", "The salt keeps it stable.", "- Oh, ah! - God, what is happening?", "They're all gonna blow! Take cover!", "So, uh, do we have a deal?", "Still waiting for instructions, over.", "Wait, we don't have eyes on you.", "- Kevin, do you see Jake? - Yes, he's right there.", "Oh, no, that's a different gentlemen", "wearing a handsome jacket Everyone is so well dressed.", "Peralta, head for the north gate.", "We're having trouble finding you.", "All right, Professor, I'm assuming you're wearing a wire.", "A what? A... huh?", "Ah, yes, a wire.", "My husband asked me to wear that.", "We lost comms Something happened.", "Cheddar! Uh, my fluffy boy!", "I've missed you so.", "All right, put up your hands I'm gonna tap you down.", "There's no need for that I have the drive.", "Just take it - Thanks", "I'm still gonna pat you down.", "Be my guest, but you're not gonna find anything.", "Here's a gun - Whoops.", "- And another gun. - I forgot about that one too.", "So, the Professor's got two guns on him,", "and he's wearing a fake beard.", "Oh, please don't rip it off It hurts so much", "I think the Professor's actually a cop.", "Something tells me I should check that drive.", "There's a laptop in the front seat.", "Get it If these files", "aren't the real deal, you and the dog are dead.", "Oh, no need to worry Because everything", "is on the level and will be completely fine.", "Cheddar, go!", "Go, boy!", "Hey cop.", "Would you like to buy a laptop?", "There's no sign of Peralta out here.", "Did you hear anything on the wire?", "No, it never came back on Do you think he's okay?", "- Shh! - What?", "- Do you hear? - Yes, I do.", "That's the jingle of Cheddar's collar.", "And that's his bark!", "Oh, that's our fluffy boy!", "Good dog Good dog.", "Oh, Mr Cheddar, how I've missed you.", "We both have", "I'm putting that GPS tag on your collar immediately.", "Oh, damn it, it's not here I'm wearing Peralta's pants.", "Ugh, and now my hands are sticky.", "Wait, Peralta's wearing your pants which means...", "- He doesn't have sticky hands. - Yes, but also", "he has the GPS tracker -", "Hey, so, given the fact that you haven't slept in forever,", "I feel like I should drive you home", "I'm not going home I'm going out.", "What? Really?", "- What is your life? - It's pretty good actually.", "Huh - By the way,", "I'm sorry that I didn't win you that stroller.", "No, no, no, you were right I don't need a Snoog.", "It's way too fancy.", "It is stupid - It's not stupid", "I said you didn't need it", "because I already bought you a stroller", "for your shower this weekend,", "and it's just... isn't as fancy, and I felt bad.", "Rosa, I would love any stroller you got me", "- because it came from you. - It's a Luftroller.", "Oh, that is... That is a great stroller", "- I got you a gift receipt. - Thank you so much", "I cleaned up as much as I could,", "but I think that couch", "is gonna smell like bone broth for a while.", "So did you talk to your friend?", "Any chance he'll reconsider investing?", "Yeah, that's not happening.", "He said that was the most scared he's ever been,", "and he was on that plane that landed on the Hudson", "I guess that's it", "I'm never gonna make my $11,000 back.", "Actually, I called another guy from my gym.", "He wants to buy the domain", "workplacebonebudscom off of you.", "That's amazing!", "I can't believe you found someone else", "who runs a bone broth company with a coworker.", "What are the odds?", "No, obviously he wants to make a website", "that helps people hook up with their coworkers", "I don't see it - Charles.", "It's called workplacebonebudscom.", "All I hear is friendship and broth.", "But yeah, I mean he wants to burn his money,", "I'll light the match Yeah, tell him to call me.", "His loss.", "So what's your plan here, Kingston?", "You gonna torture me?", "You gonna put my beard back on and rip it off again?", "No, I'm gonna cut off each one of your fingers", "until you tell me who the rat is", "I see Well that's bad news,", "because I don't know who the rat is,", "and I need all my fingers if I'm gonna beat Wario.", "- You can't beat Wario? - You can?", "- How do you do it? - It's simple.", "When he's approaching, you just tap the...", "Damn it!", "- Motion detector! - I'm sorry, what do you tap?", "- Get up, let's go! - Kingston!", "What do you tap? What do you tap?!", "Split up! Cover the exits!", "- Freeze! - Captain!", "- Captain! - He's not getting away!", "- He took my dog! - Oh, my God.", "It's happening!", "Aah!", "Oh, I see you have a knife.", "But what you need is an umbrella.", "Tell him why Tell him why!", "'Cause there's a storm gonna rain down on you, punk.", "Ooh.", "My goodness.", "- Awh! - Ooo-hoo-hoo!", "You took the wrong fluffy boy!", "He's done Cuff him.", "Yes, sir.", "That was the single coolest thing that has ever happened.", "Relax, Peralta.", "That wasn't even the coolest thing I've ever done.", "What have you done that's cooler?", "It was the '80s It was nothing, I mean,", "they made a movie out of it, but whatever.", "What? What movie?", "I don't remember the title.", "Uh, there was a crime on a plane, I was a passenger.", "- Was it \"Passenger 57?\" - I honestly don't know.", "It had to have been Just say it was that.", "You know, Peralta, sometimes I don't understand", "the words coming out of your mouth.", "Oh, my God, was it \"Rush Hour?\"", "What? No.", "You know what? I'm too old for this crap.", "- It was \"Lethal Weapon?!\" - Sir, are you Murtaugh?!", "Does that make me Riggs?", "I'm Riggs!", "Fremulon.", "Not a doctor Shh"]