[">Hey, Gina! We got an anonymous gift basket.", "Yeah, it's full of treats.", "It's got meats, cheeses, candies,", "all the food groups.", "The cheese is amazing.", "It melts in my mouth and in my hands.", "Hmm, French chocolates, French cheeses,", "tiny French pickles.", "Did none of you detectives think this might be a gift", "for Captain Holt from someone in France?", "Like his husband, par exemple?", "What? No way.", "This is a nice present from an unknown, appreciative citizen", "that wanted us to munch.", "Hmm, what's this, then?", "\"Dear Captain Raymond Holt, thinking of you.", "Best, Dr. Kevin Cozner, Ph.D.\"", "He even used their pet names.", "Oh, no, I ate the chocolate-covered strawberry.", "That's the most intimate snack of them all.", "Holt's gonna be back from his meeting in 30 minutes.", "- What do we do? - Eat the note!", "No! No.", "It's okay. We can fix this.", "Check it out, sir.", "A lovely gift basket that Kevin sent you all the way from Paris.", "Straight from Paris!", "Stapler, scissors.", "Rubber bands.", "That man really knows me.", "Sync &amp; corrections by Rafael UPD www.addic7ed.com/", "Attention, squad. I just received a call.", "A very important, very high profile celebrity", "was robbed in our precinct.", "What celebrity, sir? Is it a Chris?", "Hemsworth? Evans? Pratt? Pine? Brown? Cross?", "Is it a non-Chris?", "This is a sensitive matter, and I can only disclose details", "to the lead detective on the case.", "Sergeant, let me know who's available, ASAP.", "Yes, sir.", "Sarge, Sarge, Sarge.", "You know that I'm your guy for this.", "You can't give a celebrity case to Amy.", "The last movie she saw was a documentary about spelling bees.", "Wrong; it was about the font Helvetica,", "and it played like an action thriller.", "You already have a case, Peralta.", "I assigned it to you this morning.", "That was just some kid with a little bit of pot on him.", "Meanwhile, Chris Rock is tied up in his basement", "calling out for my help, and you're standing in my way.", "Just work the case I assigned you.", "Can't I just give my case to Hitchcock and Scully?", "I mean, they clearly have a ton of time on their hands.", "Hitchcock hasn't even gotten out of his chair today.", "Hey, Jake, I can go anywhere in this thing.", "But... shouldn't.", "Hitchcock and Scully are house mouses.", "They do paperwork and they're good at it.", "They don't go out in the field.", "Boyle, you take the celebrity case.", "Me? Instead of Jake?", "Have you lost your damn mind? I am so sorry, Jake.", "I don't know what's wrong with Terry.", "Don't worry. I'm gonna work it with you.", "I'm giving my drug bust to Hitchcock and Scully.", "It's time to get these mice out of their hice.", "Oh, that was lame. Life is meaningless.", "We're all gonna die.", "Mouses out of their houses. Yes, I am the greatest.", "Every breath is a gift. Sorry about the roller coaster.", "I'm just happy I'm tall enough to ride.", "Hey, Rosa.", "Saw you hadn't signed up for the blood drive yet,", "so I brought you the sheet.", "Sorry, can't. I'm... under 17 years old.", "Wait, you didn't sign up last year, either.", "Or the year before.", "Are you afraid of needles?", "I don't like being stabbed by someone", "so they can steal my blood.", "I'm crazy.", "This is amazing; you're scared of something I'm not.", "I'm tougher than you. I'm tougher than Rosa.", "Eh, I take it back. I'm so sorry.", "Look, it's okay. We all have fears.", "I'm so claustrophobic, I can't even go", "into the downstairs supply closet.", "I hear they have some hot new binder clips,", "but I'll never know.", "I'm scared of businessmen.", "A whole army of gray-suited Brads and Chads trying", "to suck my soul and redeem it for frequent flyer miles.", "Great, so you guys get it.", "- Conversation over, bye. - No, no, no, no, no.", "What if we each agree to face one of our fears today", "for ourselves and for all of womenkind?", "Ugh. That sounds terrible.", "But I'm in.", "Fine, I'll do it too.", "Guys, come on.", "I really think this'll be good for... oh, wait.", "You... we're doing my thing? Okay.", "Thanks for taking us to lunch, Jake.", "Of course. Get whatever you want.", "Oh, man, I already ate.", "I guess I'll just have a cheeseburger deluxe,", "couple slices of pie, maybe an egg cream.", "- Okay. - And a waffle.", "So look, a big, important drug case came across my desk,", "and I need your help.", "Only problem is, Sarge doesn't think you can handle it.", "- He's right. - No, he's not.", "Look, you're Hitchcock and Scully.", "You guys are legends.", "You single-handedly caught the Prospect Park Flasher.", "Well, he was being chased by other cops,", "but he did slip on my spilled chili.", "And who bumped into Scully, causing the spill? Me.", "Damn right, and who fell asleep under their desks", "and caught the janitor stealing evidence?", "We did.", "And who sued the department", "and got triple-ply toilet paper in every precinct?", "We did.", "Terry thinks you guys", "are too old and too lazy to handle this,", "but I know what you're really made of.", "You're gonna take this case and prove him wrong!", "- Yeah! - Whoo-hoo!", "We're still gonna eat lunch, right?", "Obviously, a high profile celebrity case such as this one", "needs to be handled with the utmost discretion.", "I promise I'll be professional,", "even if it's Dianne Wiest.", "Oh, my God, I can't believe I'm gonna meet Dianne Wiest!", "She's so sexual!", "No, our victim...", "is John... William...", "Weichselbraun.", "Remind me who that is again?", "You're kidding. He's a world-renowned oboist,", "first chair with the New York Symphony Orchestra.", "Kevin and I are huge fans of Weichselbraun's work.", "We are what the Internet sometimes refers to as...", "Weichselbraun fans.", "Not Weichselbrauniacs?", "Oh, that's very good.", "I'm gonna use that liberally.", "Anyway, Weichselbraun's $40,000 oboe", "was stolen from his apartment,", "and you need to find it.", "I'd work the case myself", "if it didn't smack of preferential treatment.", "Don't worry, sir. I can handle this.", "So you do think it smacks of preferential treatment?", "I don't know what you want me to say.", "Okay, you've convinced me. I'll work the case with you.", "Great.", "I think you owe me an apology.", "I'll apologize to you in hell.", "I actually don't know what this is about.", "Sorry I took such a hard stance.", "Holt's celebrity was just some lame oboist.", "Meanwhile, we just linked your little dumb pot bust", "to a major narcotics ring.", "This might be the biggest drug case", "the Nine-Nine's had in years.", "Cool.", "Uh-oh.", "I know a real \"cool\" when I hear one.", "That wasn't a real \"cool.\" What did you do?", "Well...", "I may have given that very huge drug case", "to Hitchcock and Scully.", "- What? - In my defense,", "I was pretty sure you were never gonna find out.", "I don't know where Hitchcock and Scully are.", "They're not answering their phones,", "and they signed our dealer... the one link to our drug ring...", "out of holding.", "I swear, if they mess up this case, Jake, it's on you.", "They're detectives.", "They've been on the force for 500 years.", "They know what they're doing.", "The only item on Scully's calendar for the entire year", "is \"eat peanut butter.\"", "Yeah, we got to find them.", "And to do that, we have to think like they do.", "I'm going in.", "All right, there's the butt indentation,", "and...", "I'm docked.", "Ugh. Still warm.", "All right, residual cushion fart is about a six out of ten.", "He's been gone an hour, maybe two.", "- But where? - Hot dogs.", "- They went for hot dogs. - How do you know?", "There's a water stain on the ceiling in the shape of a bun.", "Let's go.", "Excuse me, have you seen Hitchcock and Scully?", "Three times a day for 12 years.", "Twice as often since I started serving sweet wieners.", "Sweet wieners?", "It's a normal hot dog with a little chocolate sauce.", "- One please! - No, Jake.", "- No, Terry. - Have you seen them recently?", "Half hour ago... they ate, and then they took off in a hurry.", "Half an hour.", "They could be anywhere by now. Nope, there's Scully.", "Where's Hitchcock?", "I'm taking you guys off your drug case.", "Of course you are.", "Jake said you didn't believe in us.", "What? He didn't believe in you either.", "He was just pumping you up with lies so you'd work his case.", "Jake, is this true?", "I just thought, you know,", "the two of you might be better off", "mousing around the old house.", "Oh, I get it.", "Just because I got my finger stuck in a glue trap once,", "I'm a mouse?", "I got the cheese out, by the way.", "- Oh, my God. - Look, man,", "we need to know where Hitchcock is.", "I am ordering you to tell us everything.", "Fine. We're setting up a sting.", "I'm going undercover as Tex Dallas,", "billionaire oil man from Dallas, Texas,", "with ties to the cowboy mafia.", "- Oh, boy. - Hitchcock's my middle man,", "Reno Vegas, mobster from Reno, Las Vegas.", "I said my \"oh, boy\" too soon.", "In 20 minutes, he's going in totally alone, unarmed,", "without a cell phone, to meet with one of their guys", "to set up a buy.", "So how do you like our plan now?", "It's a disaster, man! We got to stop it!", "Disaster? Tell me one thing that's wrong", "with Operation Beans.", "Operation Beans?", "Good afternoon, sir. I'm Detective Charles Boyle...", "From the Nine-Nine.", "My precinct. I'm the captain, Raymond Holt.", "Okay. Uh, please, come on in.", "I'll show you the back room where they broke in.", "You're an incredibly gracious host, Mr. Weichselbraun.", "Wow, that pronunciation is flawless.", "I must admit, I'm a bit of a Weichselbrauniac.", "Hmm, I saw you perform Bach's \"Oboe Sonata in G Minor\"", "at the Brooklyn Academy of Music.", "I was in the front row.", "You were escorted out for gasping too loudly.", "Ah.", "This is a pretty modest apartment.", "How did you afford a $40,000 oboe in the first place?", "I admit that there's not as much money", "in classical music as there once was...", "Which is the real crime here.", "Boyle, can I talk to you privately?", "Sure.", "What are you doing? You just insulted", "our celebrity victim to his face.", "You keep saying \"celebrity,\" but he's drying his socks", "on a George Foreman grill.", "This is John William Weichselbraun,", "the Silver Spit Prince.", "I'm making myself primary detective on this case.", "You can wait in the car.", "Oh, but first, take a picture of the two of us together.", "Make sure we're laughing.", "Ha-ha!", "Ah.", "Okay, so, I'm going to face my fear of confined spaces.", "When I'm ready, you will shut the trunk", "and leave me here for 30 minutes.", "I left a juice box and a diaper in there for you,", "so you're gonna be fine.", "Or we could all give in to our fears", "and keep our blood in our bodies like normal people.", "No, Rosa, we are doing something important here.", "We are women, standing up and supporting each other", "and becoming...", "New fear: listening to Amy inspire us.", "Be back in a half hour, Ames.", "Wait! Come back!", "Come back, I can't do this!", "No, you're the best!", "You did it. How'd it go?", "Well, the first ten minutes were really terrible.", "The diaper did not fit. It was for a baby.", "But then I relaxed, and I found my inner strength.", "I think the lesson here is that, as women, we...", "No, no, no, no!", "You close that trunk again and I will kill you!", "You hear me? I will kill you!", "We're almost there. Slow down, Pinto.", "I didn't agree to a bean name.", "We are not doing Operation Beans.", "You know, the only reason Hitchcock and I took this case", "is because you said we were great.", "I'm beginning to think you were lying to us.", "I was lying! I already admitted that.", "Well, if anything happens, it's because of you.", "- Right, Mung? - Right.", "If Hitchcock dies, it's 'cause of Pinto.", "Terry, I know that you're mad,", "but you don't have to jump on the bean train.", "Uh-oh.", "Chickpea! No!", "Looks like they're taking Hitchcock", "inside that building, and it looks like they're armed.", "Dammit, Jake!", "You couldn't just do the case I assigned you?", "Hitchcock's life is in danger. He has a wife, man.", "Don't worry. If anything happens to him,", "she'll be taken care of.", "If I die, I want you to marry Lucille.", "I can't stand the thought of you being alone.", "Deal. Let's make it a blood pact.", "Oh, look, I'm already bleeding.", "So just normal friend stuff.", "- So what's the plan? - We stick with Operation Beans.", "We knock on the front door. I say I'm Tex Dallas.", "You're my buddy, Alamo, and you're Black Fred.", "Black Fred? Why Black Fred?", "There's no other Fred!", "Yeah, but they don't know that.", "I say Terry and I go in", "through the roof and do some recon.", "Scully, you stay here and call for backup in case we need it.", "Oh, no way.", "That's my partner in there. I'm going in.", "Also, I can't call for help. I don't have any quarters.", "Hard to argue with that logic.", "- You know I... - Sir, I need to talk to you", "about the Weichselbraun case.", "Oh, I didn't realize you were here, Mr. Weichselbraun.", "I was in the area, and the captain is a fan,", "so I came by to give him a little gift, as a thank you.", "It's a signed copy of his book of mouth exercises.", "\"Reed It and Weep.\" \"Reed\" with two Es?", "It's my favorite joke of all time.", "- I'll come back later. - Oh, nonsense.", "I'm sure John... he insists I call him \"John\"...", "I'm sure John would appreciate an update", "on the whereabouts of his oboe, wouldn't you, John?", "- Yeah. - Well said, John.", "- Did you hear what John said? - I did,", "but it's an open investigation,", "and I don't think it's proper to share information", "with the parties involved.", "Well, that's why you're no longer the primary.", "John played oboe for Lynne Cheney.", "I'm sure we can trust him to be discreet.", "- Out with it. - Okay, well,", "John, you're under arrest.", "- What? - Excuse me?", "He staged the robbery for the insurance money", "because he's broke, because oboists are not celebrities.", "This is ludicrous, Boyle.", "Do you have one iota of evidence?", "I found the oboe for sale online.", "We traced the IP address back to Mr. Weichselbraun's computer.", "Oh, John.", "Okay, Sarge, everyone knows you're a superhero,", "so you lower Scully and I into that skylight", "and then fly down to meet us.", "- You know that's impossible. - Fine.", "We'll lower Scully down together,", "and then flop onto him like a giant mattress.", "No, you go first, then I lower Scully,", "and you... you get to catch him.", "Great. I love that plan.", "Come on.", "Whoa!", "I got him.", "- Look what I found. - French fries?", "What? No, it's Hitchcock.", "Where would I have found French fries in a weed farm?", "Oh, man, look at him. This is bad.", "He hates standing up.", "To conquer my fear of businessmen,", "I must walk among them.", "I will shake their clammy hands", "and listen to them talk about things like", "how hard Wednesdays can be.", "Does this outfit look drab and lifeless enough?", "Also, thanks, Amy, for letting me borrow it.", "You're welcome. I wore that suit to prom.", "Student chaperone.", "I guess this is really happening.", "How about those quarterly write-offs?", "And did you hear about the merger?", "Also, we all need to go in on those flowers for Beth.", "Aw, Wednesdays.", "Who are you again?", "Gina, from Sales. I have the plant on my desk.", "Oh, yeah. You want to sit with us.", "We'll all be dead so soon.", "What?", "I would love to sit.", "Ugh.", "That was a nightmare. I ate a Caesar salad wrap.", "I'm so proud of you, you lioness.", "You faced your fear.", "And I emerged victorious.", "Yay!", "That was a wig?", "You didn't think I'd put my actual hair in a ponytail?", "Are you insane?", "Oh, there's the boss.", "I ask only one time. Who do you work for?", "DEA? FBI? Police?", "I'm in the cowboy mafia.", "I work for the Dallas Buyers Club.", "- I came up with that name. - No, you didn't.", "It's a movie about AIDS.", "You're lying. Let's try again.", "- FBI? - Oof!", "DEA?", "- Police? - Aah!", "Oh no, he's not gonna last.", "Oh, Jake, you got to do something.", "I don't want to marry Hitchcock's wife.", "Here we come, Chickpea.", "Hey, hey, hey, hey! Easy!", "Howdy there!", "I'd really appreciate it kindly", "if y'all would stop punching my associate Reno, there.", "Let me introduce myself. My name is Alamo.", "This here's Tex, and this is...", "Fred. Just Fred.", "And we are...", "the Dallas Buyers Club.", "Okay. We make a deal.", "Sounds good.", "No, I just told them to surround you.", "Dagnabbit. Oof!", "Look, Sarge, I'm sorry that we're in this mess,", "but on the bright side,", "we don't have to deal with some lame oboist.", "You should be apologizing to Hitchcock and Scully.", "You took them out of their house mouse comfort zone,", "and now they might get killed.", "You really think they're going to kill us?", "Oh, no, now I'm starting to panic sweat.", "Starting to?", "What have you been doing for the past hour?", "- Normal sweating. - Wait a minute.", "If you get killed, what happens to all your debt?", "Loophole!", "Oh, you sweaty, chair-spinning morons.", "You're gonna get us out of here.", "Boyle, may I speak to you?", "I don't know.", "Are you still mad that I arrested John?", "No.", "I know he's guilty. I'm just chagrined.", "Deeply chagrined.", "I finally understand the old adage, \"Never meet your heroes.\"", "This is just like when I found out Robert Frost was from...", "California.", "Or when I saw Mario Batali with his hair down.", "Well, you've handled this case with the utmost professionalism,", "while I've behaved crassly.", "I think I've figured out a way to make it up to you.", "Oh, my God, is Dianne Wiest here?", "No, I've hired a trio of classical musicians", "to perform a Shostakovich cantata,", "originally written as an apology to a dear friend.", "Are you stealing kitchen supplies?", "Just let us have this stuff.", "You have so much, and we have so little.", "Perhaps I'll just buy you a drink instead.", "Yeah, that would be best.", "Classical musicians are savages.", "They're not gonna kill you fast, Scully.", "They're gonna make it real slow.", "First they're gonna scalp you,", "and then they're gonna rip your tongue out!", "No. That's my cupcake taster!", "What are you doing? Lay off him!", "Never! For my plan to work, he's gotta be basting in sweat.", "Hitchcock, you once told me you could roll that chair anywhere.", "Think you could take it up those stairs?", "I once rode a chair home in a blizzard.", "So, yeah, I can go up stairs.", "So do it.", "Oh, he's amazing.", "He's like a big, lazy Michelle Kwan.", "But how's he gonna get up the stairs?", "Jake! He already did.", "Okay, it's go time.", "Help! My man's having a heart attack!", "Help!", "Hitchcock, now!", "Scully! Grab his gun.", "It's not sticky because I'm so juicy!", "Told you I knew what I was doing.", "Black Fred, think quick.", "No, no, ow! That was a gun, man!", "Scully, grab that dude's knife and cut us loose.", "We're gonna get the rest of these guys.", "It's time for Operation Beans, phase two, the refrying.", "Sure you're ready to go through with this?", "You know what? Today was stupid.", "But seeing you both overcome your fears did help me,", "and I think we've all grown as women.", "Okay.", "I'm ready.", "Stab me! Stab me!", "Do it, just do it!", "- Rosa? - I'm psyching myself up.", "Don't look at them! Look at me!", "Do your job! Drain me!", "There they are!", "Everybody give it up for Hitchcock and Scully.", "To thank you for all you did,", "bringing down a drug ring,", "we have a little present for you:", "brand-new, top-of-the-line desk chairs,", "extra padding, with adjustable height and recline.", "Hey, chair!", "Get ready to meet your new best friend:", "my ass.", "That was very nice of you.", "They did good.", "Also, I was worried they might want", "to go out in the field more,", "and I need something to keep them at their desks.", "You really think that that is going to keep them at their...", "and they're both asleep already.", "And the city's safer for it.", "Sleep tight, you magnificent oafs.", "You deserve it.", "Sync &amp; corrections by Rafael UPD www.addic7ed.com/"]