[">- Listen up, everyone.", "While Captain Holt's out of town at his conference,", "I'm in charge, which means, Jake,", "I order you to throw out that gingerbread house.", "It's from Christmas. - Fine", "But you're gonna be leaving a lot of ants with no home.", "- Check it out, losers. Guess who got their dealer!", "- Nice! How'd it go down?", "- We chased him through a subway tunnel,", "back up through the storm drain, Adrian and I got engaged,", "and then we busted him with a half kilo of coke in his sock.", "- Wait, wait, wait.", "What'd you just say? - It was in his sock.", "These dummies, they never think we're gonna check their socks.", "- No, before that, weirdo. The getting engaged part?", "- Oh, yeah. We got engaged.", "- Engaged engaged? - Yeah.", "- As in, to be wed? - Yeah.", "- Seriously? together: Yeah.", "- Amazing! We wants deets.", "Tell us everything!", "- I don't want to toot my own horn or anything,", "but it was super romantic.", "[exciting music]", "♪ ♪", "- You follow. I'll cut him off in the alley.", "- Okay, wait. You want to get married?", "- Yep.", "[upbeat music]", "♪ ♪", "- Jake, can I talk to you about my wedding for a second?", "- Need help choosing a dress?", "Big puffy bow in the back, can't go wrong.", "- No to all of that.", "Look, Adrian is about to ask you to be his best man.", "I need you to say yes and I need you to act surprised.", "- No problem. Check this out.", "[stammering?] What? What?", "Best--best man?", "All right, I'll work on it. - Okay.", "Sarge does not approve of the wedding,", "and honestly, it is killing me.", "- I'm sure you're just reading into it.", "- No.", "- What are you doing?", "Pimento is nuts!", "- Ah, so not reading into it at all.", "- He thinks we're rushing into things, but we're not.", "I love Adrian.", "Every time I see him, my heart just explodes.", "- Wow, that's, like, some Lionel Ritchie-grade love stuff.", "- Anyway, I think Sarge would like him", "if he actually got to know him, so during the bachelor party,", "I need you to show him the real Adrian.", "- Rosa Diaz, I promise you this.", "I will make sure Sarge loves him.", "- Great. Crap, here comes Adrian.", "You never saw me. - All right.", "- Act surprised.", "- Hey, Jake, come here. I got a question for you.", "- [coughs] Sure.", "Oh, that's very close for a question.", "- Jake Peralta, will you do me the honor of being my best man?", "- Best man?", "Adrian, this is all so sudden!", "- Rosa told you? - Yeah.", "But I would be honored. - Thank God.", "I'm gonna kiss you now. - Oh, you don't have to.", "Already did it. - That seals it.", "- So who you thinking about inviting to the bachelor party?", "Maybe, like, Terry, or, I don't know, Terry's great.", "Or probably Terry is available, we could ask him.", "- Sure, nah, I was thinking all the guys from work.", "Except Chuck. Rosa called dibs on him.", "- Maid of honor? Yes, a million times, yes!", "[gasps] It would be an honor.", "Oh, my God, that's why they call it that.", "- Great, but I specifically said, \"co-maid-of-honor,\"", "because I am also asking Amy and Gina.", "- I guess that's okay,", "if you want to water down your Charles Boyle", "with a couple of ice cubes.", "- Count me in as long as I get eight plus-ones.", "- Guys, focus. We need to start planning.", "So when's the wedding?", "Next summer, next fall, next winter?", "- Next week.", "- Next what? - Next week?", "- That is not enough time to plan a bridal shower,", "an engagement brunch,", "a papier-mâché sculpture of you two kissing.", "- Don't worry about that stuff.", "The one dumb wedding thing I've always wanted", "was a bachelorette party.", "- Ah, so, cool, cool, cool.", "All the pressure's on that one event, cool, cool, very cool.", "- Super excited for the big night.", "- Well, I'm happy she's excited.", "I'm not sleeping for the next 24 hours.", "- Amen, sister. Amen.", "- All right, gents,", "Pimento's bachelor party is tomorrow night.", "I've gotten us a party bus,", "reservations at a delightful steakhouse,", "and a DVD copy of \"American Beauty\" to watch at midnight.", "That last thing was his only request.", "I'm not sure if it's his favorite movie", "or if he's just never seen it.", "- I'm surprised he didn't want us all to get drunk", "and slash each other with machetes.", "He's not exactly stable.", "- Die, bug! [shouting]", "Oh, no, he's dead. Oh, what have I done?", "- That was 18 days ago.", "He's getting saner by the minute.", "In a month, he'll basically just be Frasier.", "- Don't use Frasier's name in vain.", "- Copy that. - Yeah, Sarge.", "If Jake wants to pay for us to have a fun night out,", "let's not stop him.", "- I'm not paying for it. We're splitting it.", "- Well, then, I'm with Terry. This wedding's a sham.", "- I'm looking out for Rosa,", "like I'd look out for anyone in my squad.", "- I get it, but you're just saying that", "'cause you don't know the real Adrian.", "And this bachelor party is gonna change all that.", "We're gonna eat steaks, we're gonna smoke cigars.", "- We're gonna look at naked ladies.", "- No, Hitchcock, we're keeping it classy.", "- Right, just their boobs. - No, no boobs.", "Look, Sarge, Rosa loves him.", "Will you at least promise me you'll keep an open mind?", "- Fine, mind open.", "But for the record,", "I think they're making a mistake,", "and this whole thing is gonna blow up.", "- Fun attitude. Save it for the party bus.", "- Rosa, we could really use your input on the bachelorette party.", "See, we all have different ideas and no one is compromising.", "- I would compromise, but I refuse to not do mine.", "- Whose idea is best? - Excellent question.", "Here's a rundown of mine, the \"elevator pitch,\" if you will.", "Has this ever happened to you?", "You show up at a bachelorette party--", "- Ding, the elevator doors closed.", "No one can hear you. We cannot hear you.", "Now before I tell you my idea, are you allergic to dolphins?", "- Why don't we just do all three parties?", "- Oh, and then you pick your favorite at the end.", "I.E., mine.", "- Sounds good. - Sounds great.", "- May the best maid win.", "[hip-hop music playing] - Wow, how cool is this?", "A TV on a bus? I never thought I'd see that.", "- Where's the groom already?", "Who doesn't show up on time for their own party?", "- You mean, besides Gina?", "Every year without fail. Yeah.", "Look, you said you'd keep an open mind for Pimento.", "He'll show. Just give him a shot.", "- Is everybody comfortable back there?", "Does anybody need any-- aah!", "- Sir, are you okay?", "Hello?", "- We need to go now! [engine turns over]", "- Okay, just keep that mind open.", "I'm sure there's a perfectly stable explanation for this.", "- Someone's trying to kill me!", "- Mind closed, Jake! Mind closed.", "[tires squealing]", "- Yep.", "[exciting music]", "♪ ♪", "- Look, I know you're upset", "because Pimento seems a little amped up--", "- We were going 90 with the headlights off!", "- But please just give him a chance to explain", "before getting all angry and yelling, \"Hey, man!\"", "- Hey, man! What the hell were you doing?", "- Great, Sarge, can I just talk to you outside for one moment?", "BRB. BRB. BRB.", "Sarge, he's a good cop.", "IF you ask him in a supportive, non-confrontational manner,", "he'll give you a calm, logical answer.", "- Fine.", "- Why do you want to know?", "Who are you working for?", "I will cut you, little man.", "- Cool. Hey, uh, Adrian?", "Can I borrow you for one sec?", "Look, we're all on your side here, Pimento.", "We all want to believe that you're about to be murdered.", "- Thanks, man.", "- But you gotta lay out some facts", "and you gotta do it calmly.", "- Okay, here's everything I know.", "It all started-- - Jake, a word, please.", "- What? - I don't know.", "Everybody else got to go outside.", "- Get back on the bus!", "Sorry. Adrian, you were saying?", "- Someone's been following me for two days.", "White guy, svelte, thick brown hair,", "piercing blue eyes.", "I don't know, I guess you'd consider him", "classically handsome.", "Is that weird to say? - No.", "I mean, is it? No, I don't think so.", "- Anyway, this morning I turned the tables, followed him home.", "We need to go there now, so we can get the drop on him.", "- Smart, sane, rational. Sarge, what do you think?", "- Fine, we can go.", "But only to prove he's making this all up.", "- Okay, okay.", "The important thing is, you agreed we can go", "and you and Pimento are best friends now.", "Let's do it!", "- All right, who's up first?", "- Party number one will be brought to you by Gina Linetti.", "And good times.", "- Where exactly are these good times?", "Because so far,", "the first six seconds of your party are a big old snooze.", "- Tonight we will be attending", "my nephew Anthony's 13th birthday party.", "- Sounds awful. Teenage boys are the worst.", "- But shooting them with paintballs", "in the behind is the best,", "which is what we're gonna do.", "It's a paintball party.", "- Nice. - Let's go shoot my nephew.", "- Gina, do you have any idea what you're getting into?", "We play in a league.", "A league.", "Ow! - Oops.", "[upbeat music]", "- You're all gonna die tonight!", "[screaming]", "- Unleash hell.", "- Ow, ow, ow! Ow, ow, ow!", "- Well, well, well, guess I nailed it.", "Pressure's on, guys.", "- Good. Pressure's my jab.", "- Ow! - I'm engaged!", "[all shouting]", "- Okay, now the guy's in that building right there.", "If Figgis hired him, that means he's highly trained,", "armed, and very dangerous.", "- The only problem is, none of us are packing.", "- Oh, not a problem.", "I've got an arsenal in my pants.", "♪ ♪", "together: Damn!", "- Guys, game faces on.", "I don't know what's on the other side of that door,", "but I know it's gonna be brutal.", "- And it's empty.", "- No one's been in here for years.", "- I can't believe I was wrong. - I can.", "- Okay, look, this was maybe a weird way to start the night,", "but the good news is,", "we can still make our dinner reservation and no one got hurt.", "- Actually, I cut myself real bad.", "- Of course you did.", "- Party round two: the quiz.", "Winner gets a question mark crown.", "So cool.", "- Um, I'll take Lonely Arts and Crafts for 800.", "- First of all, I've made many friends through arts and crafts.", "- And how many of them are googly eyes?", "- And secondly, it's a drinking game.", "Get a question wrong, do a shot.", "Oh, and the questions? They're all about Rosa.", "- But none of us know anything about Rosa.", "- Everyone's about to get real hammered.", "What is my favorite soup?", "- Chicken noodle.", "- Potato leek.", "- Corn frickin' noodle. I mean, chowder, damn it.", "- You're all wrong. I've never had soup.", "- Don't bother. They all suck.", "- Drink!", "♪ ♪", "- Battle axe.", "- Upper cut.", "- Disembowelment.", "- Guys, I was a baby.", "My first word was \"Da-da.\" Drink!", "[all groaning]", "♪ ♪", "Wrong! I can totally do a handstand.", "- Ooh!", "[glass shatters]", "- Oh! - Told ya.", "- Good luck following this party, ya bish.", "- I'd like to make a toast to the groom-to-be, Adrian Pimento.", "- Don't bother, Jake. Everybody's pissed at me.", "- No, no, we're not. We're all supporting you.", "- We're doing separate checks, right?", "- I told you, we're splitting it.", "All right, sure, tonight got off to a weird, rocky start,", "but you know what else got off to a weird, rocky start?", "America, and we all love America now, right?", "- Well, it's no Amsterdam.", "- And you know who else we also love?", "Rosa Diaz.", "Some of us even love her so much", "that it makes us act a little crazy sometimes.", "- You're talking about me, right?", "- Yeah!", "- Ah, I would kill all of you for her.", "- That's sweet. Right?", "So let's raise our glass. - Cheers.", "- Cheers. - Cheers.", "- I'd also like to make a toast.", "- Easy on the dings, man. One ding'll do.", "- Thank you guys so much for this party.", "It means everything to me.", "And I'm sorry that earlier I went a little off the rails,", "hijacked the bus,", "stole all of your wallets to double check your identities.", "- What?", "- But with friends like you,", "I'm finally starting to feel like...", "There he is!", "[grunting and shouting]", "I got him down!", "I got him down! Somebody check his pockets!", "- What the hell? Man, this is crazy!", "- Sarge, look.", "A gun and a picture of Pimento.", "What do you have to say now?", "- I guess someone's trying to kill him.", "- That's right! In your face!", "Someone's trying to kill him! Whoo!", "I mean, a man's life is in danger.", "Probably shouldn't be so pumped.", "- Look, I'm sorry I doubted you.", "I'm also sorry that someone's trying to kill you,", "but I can really only take ownership for the first part.", "- It's okay, Sarge.", "I would've doubted me too.", "I mean, you guys probably haven't noticed anything,", "but I've been acting pretty unstable lately.", "- Well, personally, I think I also deserve an apology.", "No? Okay, that's totally cool.", "So what's our plan? - Okay.", "I'm gonna make this guy talk.", "Okay, all I need is a car battery,", "jumper cables, and unfettered access to his nibs.", "- As much as I'd like to see that,", "I think you might be a little too close to this.", "Maybe I should ask the questions.", "- Hey, Jackie, if you're asking the waiter questions,", "find out when the mashed potatoes are coming.", "- He's not a real waiter, man!", "- Hang on, we don't know that for sure.", "- Are you a waiter as well? - Mm-mm.", "- No. - Yeah, Terry was right.", "- Yeah.", "- So, you had a picture of my friend and a loaded gun.", "Can't wait to hear what crazy story you tell to justify that.", "- I'm a contract killer who was hired to kill Adrian Pimento.", "- Oh.", "That went much easier than I was expecting.", "Still gonna brag.", "[clears throat] I did it, guys.", "I broke him. - Who wants me dead?", "Someone in Figgis's organization?", "- I don't know. I haven't met the guy.", "Once I finish the job,", "I'm supposed to text him a photo of the body.", "Then we meet up and I get the money.", "- Interesting.", "So he has no clue what you look like.", "- Mm-mm.", "- Gentlemen, I just thought of a plan.", "- Stage Pimento's death and go to the meet-up ourselves.", "- Great plan, Sarge!", "- No, I was gonna say it first.", "I thought of it before you did.", "You know, whatever, let's just do Sarge's thing, I guess.", "- All right, Boyle, you're up.", "Where we goin'? - A restaurant.", "Specifically, Le Petit Colon.", "It means small intestine, 'cause that's all they serve.", "- Oh, man, I was rootin' for you.", "I don't think I can eat that.", "- Neither can anyone else, which is why they shut it down.", "We are not eating at this restaurant.", "We are demolishing it.", "- Damn! Boyle's playing to win!", "Yeah!", "- Madame, may I offer you the first whack?", "[rock music]", "- I've been dreaming about this since I was a little girl.", "[shouting]", "[all shouting]", "♪ ♪", "[laughter]", "♪ ♪", "Guys, love is beautiful.", "♪ ♪", "- Okay, we need to make my main man Pimento", "look super murdered, like Tarantino disgusting murdered.", "You ready? - Murder me, bro.", "- Sarge, blood.", "- Headshot.", "- [grunting]", "Damn, it feels good to be creative again.", "- And here comes the brains.", "- All right, now all you need to do", "is put some water on my crotch.", "- What? Why?", "- Obviously because everybody who gets shot pees them self.", "- No, they don't. That's not true.", "- Actually, he's right. Every single time.", "- I'm just gonna take the photo from the waist up, okay?", "- Fine, but for the record, I think I should've peed myself.", "- All right, noted.", "Photo taken...", "and sent.", "- Nice.", "[phone chimes]", "- Wow, that was a quick response.", "Someone's a bit of a thirsty gangster.", "[light chuckling] He wants to meet up.", "And he wants me to bring him your tongue.", "- Ah, how did I not see this coming?", "That's what Figgis does to snitches.", "Well, game over, guys.", "I mean, where are we gonna get a tongue?", "- Relax, I'm just gonna text Boyle.", "He's always eating weird stuff like tongues and chicken faces.", "Oh, and he's already texted me back", "with a top-ten list.", "- Well, the groomsmen are having a great time.", "Jake just texted me about where to get a veal tongue.", "- Hmm? - Tonight was amazing,", "which I didn't think was possible with you guys.", "- I don't know why we were competing.", "If you ask me, what we're doing right now,", "just hanging out,", "is the best part of the whole night.", "I don't even care who won. - Charles won.", "- What? - Huh?", "- Yeah, he had the best party.", "We broke so much stuff!", "- Whoo!", "- You guys, I cannot wait", "to spend the rest of my life with Adrian Pimento.", "My heart is so full.", "- Mama mia!", "To Rosa and Pimento!", "all: Rosa and Pimento!", "- Guys, I really don't want to hold this tongue much longer.", "It's weirdly heavy.", "- You're in luck. Car just pulled in.", "I think it's our guy. - Copy that.", "[tense music]", "♪ ♪", "Oh, same ski mask. That's awkward.", "- Don't worry about it. Happens all the time.", "You have the tongue?", "- Yeah, this guy won't be snitching in heaven.", "I mean, hell, obviously, he's going to hell.", "We all are; we're bad guys. Anyway, here's his tongue.", "It's all there.", "- Jimmy Figgis thanks you.", "[tires squealing]", "- Yeah, he's on the move. I'm coming to you.", "♪ ♪", "Where's this sicko leading us now?", "Lightbulb Hut? All About the Bagel?", "Bill's Pools? - Stop reading signs.", "- Can't. I'm too amped up.", "- I didn't recognize this guy.", "If he works for Figgis, he's new.", "- In fairness, there's probably", "a lot of turnover in his line of work,", "what with the constant death and everything.", "- Where's he going now?", "Oh, what the hell?", "- That's the FBI building.", "♪ ♪", "- He's an agent.", "Oh, Adrian. Your bachelor party sucks butt.", "- Ah, I'm freaking out, man. I'm freaking out!", "- Just stay calm and be methodical.", "Right? What do we know?", "Jimmy \"The Butcher\" Figgis has a man in the FBI.", "- And he tried to have Pimento killed.", "- And I cut my other cheek.", "- How? I took the knife away from you.", "- Oh, man.", "That's it. I-I gotta completely disappear.", "It's not safe for me here.", "And what if Rosa gets caught in the crossfire?", "- No, no, no. Listen.", "We're gonna protect you guys,", "and we're gonna take these guys down.", "Right, Sarge? - Absolutely.", "- No, no, no, don't you see?", "Right now, they think I'm dead.", "This is my only chance to get away safe.", "Jake... I need you to tell Rosa that I love her.", "Okay? Do that for me.", "Also, tell her this.", "- Oh.", "Oh my.", "Ew.", "That is very graphic, Adrian.", "- Got it?", "- I don't think I can say any of that to Rosa.", "And also, you can't leave without saying good-bye to her.", "You owe her that much.", "- No can do.", "It's just... too dangerous.", "[sighs]", "Good-bye, Nine-Nine.", "And with that, I left.", "♪ ♪", "- Oh, sweet, sweet coffee.", "Come to mama.", "- Shut your loud mouth, Amy.", "Some of us have a hangover.", "- [laughs] Man, last night was dope.", "Wait, did Gina really go to Puerto Rico", "with that drug store cashier?", "- Yeah. They seemed really happy.", "- They really did. - Yeah.", "- Huh.", "Hey, man. How'd it go last night?", "Sarge cool with Adrian now?", "- Oh, so you haven't seen him, huh?", "- No.", "I figured he just passed out at your place or something.", "Why? What's going on?", "- [sighs] Oh, man.", "Let's go for a walk.", "He wanted me to tell you that he loves you.", "- Is that it? Did he say anything else?", "- Um...", "- May the lord be with you.", "- Adrian. - Oh, thank God.", "- You scared me. I thought you left.", "- I did.", "I was burning my fingerprints off in a gas station bathroom", "when I thought about what Jake said.", "I couldn't leave without seeing you one last time.", "[sighs]", "I want to lick your whole body clean like a kitty cat.", "- And I'm gonna give you two a little space.", "- I have to go.", "But I'll be back for you.", "- I'll wait.", "And while I'm waiting, I will find that FBI agent", "and I will rip his head off with my bare hands.", "- That is the sweetest thing anybody's ever said to me.", "I love you.", "- I love you.", "- You okay?", "- Yeah, I will be.", "- I watched you guys kiss. I didn't know where to look.", "- All right, let's go inside. - Okay.", "- Sergeant Jeffords briefed me about the Pimento situation.", "Sounds like I missed a hell of a week.", "We need to bring Figgis to justice", "and find whoever is helping him in the FBI.", "As of right now, we have very little to go on.", "- Yeah, the guy was wearing a ski mask,", "but he had a large scar on his right palm.", "[dark music]", "I have a similar scar on my back.", "Banged into Amy's kitchen cabinet.", "No big deal. Continue.", "- This mission is top secret.", "No one can know what we're doing.", "- Detective Pimento's a good man and he's one of us.", "So let's catch these bastards for him and Rosa.", "- Nine-Nine! - Discretely, Jacob.", "- [whispers] Nine-Nine.", "[all whispering] Nine-Nine!", "- Not a doctor. - Shh."]