[">Peralta, there was a botched B &amp; E", "at a jewelry store on Atlantic", "that just turned into a hostage situation.", "They want you to be the negotiator.", "Oh, my God, my prayers have finally been answered.", "You prayed for a hostage situation?", "Yes, I did. Every single day.", "I don't understand. Why isn't ESU handling this?", "Apparently, the hostage-taker asked for Jake by name.", "Oh, yes, it's getting even cooler.", "Oh, man, I wonder who it is. Ooh!", "Maybe it's the brother of someone I put away for life.", "Ooh! Or the identical twin of someone I put away for life.", "- Ooh! Or the fraternal twin of... - Jake!", "Just get down there! Take Diaz with you.", "Yep. Yep, yep, yep. How do I look?", "It doesn't matter. Let's go negotiate!", "[sirens wailing]", "Hey, everyone, I'm here.", "I'm Jake Peralta, the negotiator.", "- Oh, so you're Jake Peralta? - The negotiator, yes.", "- Who are you? - Dennis Kole, ESU.", "This was my crime scene before you bozos got here.", "Nice to meet you too, Dennis.", "I've spent ten years as a negotiator", "and you just took my first hostage situation.", "All I've done up till now is talk jumpers off of rooftops.", "But that must be satisfying in its own way, right?", "Yeah, really satisfying saving a crazy person's life.", "Whatever. Here's a little advice.", "- I don't like you two. - Not so much advice", "as it is a hurtful statement based on limited interaction.", "He wants to talk to you.", "- Get the hell in there. - Ooh, it says \"negotiator\" on it.", "[suspenseful music]", "This is Jake Peralta.", "I am unarmed", "and I'm approaching the building", "♪ ♪", "- You wanted to talk to me? - Keep those hands in the air.", "And wave 'em like you just don't care.", "What?", "I'm just messing with you, Peralta.", "Put your hands down, give me a hug, baby.", "Judy!", "[upbeat music]", "♪ ♪", "Sync &amp; corrections by emeline-whovian www.addic7ed.com", "Sergeant, a member of", "the Commissioner selection committee is coming in today", "to tour the precinct and do some interviews.", "Would you mind speaking with her?", "Of course. Terry loves answering", "- the hard questions. - [elevator dings]", "Oh, here she is.", "I guess you don't have time to take off those ridiculous suspenders.", "- What? - Hello, Miss Sumter.", "Hello, Captain.", "I'm excited to speak to you subordinates", "and learn more about your management style.", "I thought you could talk to Sergeant Jeffords here.", "Sergeant? Oh, um...", "I'd rather not talk to a supervisor.", "I was hoping to interview one of your detectives.", "Perhaps, um... him?", "- [shaver buzzing] - No!", "- Excuse me? - There was a wasp near me,", "which has since disappeared.", "You can interview Detective Hitchcock", "and I am completely fine with that.", "I gotta admit, man.", "I thought you'd be happy to see me.", "- Why you being so weird. - Oh, I don't know.", "I didn't sleep well last night, so I'm probably tired from that.", "Oh, and also, this is a hostage situation!", "Wow! It's like that.", "Yes, it's like that. What the hell?", "- I thought you went straight? - I did.", "I'm a high-end car broker now.", "I procure luxury vehicles for the rich and famous", "and I do it legally.", "Last week I dropped off a Bugatti", "to the kid with the lisp from \"Stranger Things.\"", "You met Dustin? Was he cool?", "Do him and the rest of the gang hang out in real life?", "You know what? No. We are not chatting right now.", "You have three hostages.", "You mean Pam and the two Bobs?", "They not hostages. I prefer to call them", "\"collateral friendships.\"", "I gave 'em each 500 bucks out of my own pocket.", "- Thanks again, Doug. - You the man, Doug.", "Actually, I'd rather still not be a hostage.", "Pam hasn't come around on me yet.", "Tell her I'm a nice person, Jake.", "I'm sorry. Officer, are you friends with this criminal?", "- No, not really. - Absolutely, best friends.", "It's a layered relationship, Pam.", "- Best friends. - Judy, get over here.", "- What is going on, man? - This isn't my fault.", "Two years ago before I went straight, I stole a car from a drug dealer.", "- Martin Halloway. - Oh, no, Judy, he's a bad guy.", "I know. When I realized it was his car,", "I torched it along with the drugs", "that were in the trunk that I didn't know about.", "Oh, no, Judy. Trunk drugs?", "Millions of dollars of them.", "Halloway just found out it was me.", "Said I had to do a job for him to pay off my debt.", "But did you tell him you went straight?", "- Did you tell him about Dustin? - I did.", "He said he doesn't watch \"Stranger Things.\"", "- Oh, this guy is the worst. - I know.", "He said he's gonna kill my mom if I don't do this job.", "He can't do that. I love your mom.", "So do I. That's why I'm here", "stealing this big ole bag of diamonds.", "Jake, you know how dangerous this dude can be.", "I need you to help me save my mama.", "- Help you how? - Easy.", "I got a plan that's good for everyone.", "All I need is for you to...", "Let him go so he can arrange a drop with Halloway.", "We arrest Halloway, save Judy's mom,", "and Judy turns himself in, and why is that amazing, Rosa?", "- Halloway's a huge crime boss. - And what else?", "NYPD's been trying to get Halloway for years.", "- And? - That's it.", "Yeah, it is. So, since we all agree,", "I'll go tell Judy that the plan is on.", "We don't all agree. He's trapped and desperate.", "Everything he told you is a lie.", "- Why do you say he's lying? - That's all negotiating is.", "Two liars lying to each other", "until one liar stands too close to the window", "and gets shot in the head.", "That can't be all negotiating is.", "It absolutely is. Now, get in there", "and coax him to a window. Snipers to one.", "The window plan is on. I repeat.", "- The window plan is on. - No, no, no, no, no!", "Snipers to zero. Snipers take a nap.", "The nap plan is on. It's nap time, snipers.", "Amy, Gina, you came!", "You think I'd miss opening day of your food truck?", "- I'm your biggest fan. - Also your biggest investor.", "She was freaking out she was gonna lose a ton of money.", "I told you that in confidence.", "We don't have that kind of relationship.", "Well, don't worry. I'm feeling good.", "\"The One Thing\" truck is ready to serve.", "- \"The One Thing\"? - Yeah.", "We only serve one thing:", "the perfect meatball sandwich...", "made exactly the way Nana Boyle used to.", "I can't believe this is finally happening.", "[squeals playfully]", "[growls playfully]", "- Ahh! - Uh, Charles?", "Sorry, I'm a bit stressed. Jason and Jeff,", "the guys I hired to work the truck,", "called in sick so I'm all alone.", "What a fun opportunity.", "Okay, Boyle, stop freaking out.", "I have the day off. I can step in and help.", "Yeah, me too. I'm not off, but I come and go as I please.", "It's part of my charm. I'm like an outdoor cat.", "ESU won't take your deal. They think you're lying.", "I'm not lying. I don't wanna be a criminal.", "I love my life as a average citizen.", "I voted for the first time this year.", "- Ed Breakfast for school board. - Who?", "I don't know. He had a funny name. He deserves a shot.", "That's why I voted for Stacy Ladle.", "Anyway, I'm sorry, but they're not cutting a deal.", "So that's it? I gotta turn myself in", "- and let Halloway kill my mama? - Actually...", "there might another way to get this done.", "I've taken your negotiator hostage.", "If you come in here, I will shoot him.", "Just do whatever he says! My life is in his hands!", "- [door closes] - [exhales]", "- That was so much fun! - [laughs]", "Oh, man, you sounded really scary.", "No, no, it was all you.", "The tremble in your voice sold it.", "- \"Just do whatever he wants.\" - I just made that up.", "- Ah, I was so in the moment. - Dude, seriously?", "- You are a great hostage. - Oh, thanks, Judy.", "You're a great hostage taker. Whoop.", "[squeaking]", "[both grunting]", "Both: Yes, sir.", "I can't believe Peralta got taken hostage.", "The good news is...", "I'm the negotiator now.", "- Finally. - Congratulations.", "I've been waiting for this moment for so long,", "- and... - JUDY: I'm ready to negotiate.", "But I'll only talk to Rosa Diaz.", "- That's me, Dennis. - Oh, come on!", "Okay, I think we're ready for a practice sandwich.", "- Sounds good, boss. - Please call me \"chef.\"", "[chuckles] That's funny.", "- Chef. - Thank you.", "Okay, see. The cut is a little slopey.", "I want you to cut it straight across.", "No big deal. Again.", "Oh.", "Uhp, slopey.", "Don't over think it. Again.", "[percussive music]", "Now you're not thinking enough.", "Again.", "Still slopey. Again.", "Again!", "You know what? Why don't we try this:", "Why don't you just take that knife,", "put it to my throat, and finish the job!", "- Huh? - Do I look like Jake to you?", "- What? - Do I look like Jake to you?", "- No, not at all. - Then why are you trying", "- to screw me? - Oh, my God, Charles,", "- what is going on with you? - It's chef.", "You're not ready for this. Gina, you're up.", "Okay, but I'm not calling you chef,", "- and you're not yelling at me. - Mm-hmm.", "- There you go. - Ah, thank you.", "No slope! A nice, straight cut!", "Thank you. I felt good 'cause the knife...", "But you smushed the bread!", "It's too smushy!", "Again.", "[suspenseful music]", "♪ Rosa, Rosa, Rosa ♪", "♪ Are you finally single? ♪", "- No. - ♪ I respect that ♪", "Now come on in. We gotta talk business.", "It's so good to see you. Bring it in.", "[grunts]", "Doug Judy, you're under arrest.", "- Wait, Rosa, stop. - What's going on?", "All right, look, this is not really a hostage situation.", "I mean, Pam and the two Bobs are definitely being held", "against their will, but not for much longer.", "Jake is helping me take down Halloway.", "- We can't do it without you. - Seriously, man?", "This is like that story my dad told me as a little kid.", "You're the frog and he's a scorpion.", "You're gonna help him across the river.", "And in the end, he'll sting you,", "- and then you'll both drown. - Wow, that's dark.", "My parents didn't read to me at all.", "I just watched cartoons till I fell asleep.", "Do you think that our childhoods shape", "- the adults we become? - They do.", "And cartoons shaped you into a naive little frog.", "Okay, first, little frogs are adorable,", "and second, he's not that kind of scorpion anymore.", "I'm a changed bug.", "Actually, scorpions are arthropods.", "Amy made me watch a documentary.", "Look, I know he used to be a criminal and he's fooled me in the past,", "and he is currently engaged in criminal activity.", "Innocent until proved guilty.", "- But I am doing it. - Rosa, his mother is in danger", "and we have to help her.", "Plus, he agreed to turn himself in when this is all over.", "- Right, Judy? - I promise.", "All right.", "- [sighs] - What do you need from me?", "We have an airtight plan.", "All we demand is pizza.", "Hitchcock, there's a woman here interviewing detectives", "a part of the Commissioner selection process.", "All right, I'll go hide in the janitor's closet", "until this is all over. Thanks for the heads up.", "No, it's too late for that. She wants to talk to you.", "What? No! How could you let this happen?", "- I'm nuts! - Hey, calm down, man.", "We just took her on a tour of the precinct", "and how she's at lunch. That means we have one hour", "to teach you how to behave like a human.", "Oh, I see.", "- You're gonna \"My Bare Lady\" me. - \"My Bare Lady\"?", "I'm assuming it's a \"My Fair Lady\" porn parody.", "Oh, my. We've got our work cutout for us.", "Here's our list of words to avoid:", "Chick, foxy, Jew, throb.", "Is grundle on the table?", "No, it's not on the table.", "Practice introducing yourself.", "Hello, I'm Detective Michael Hitchcock.", "[chuckles] Nice job.", "- But why are your hands so wet? - Trick question.", "The answers disgusting, so I shouldn't tell her.", "Just don't have wet hands, man.", "- [knocks on door] - Hitchcock, come out.", "- It's time. - [door opens]", "You look incredible.", "You bet I do.", "These pants really flatter my dong.", "What? Dong wasn't on the list.", "I cannot believe I didn't know", "you and Amy were getting married.", "Yeah, well, you're not exactly", "- an easy person to find. - Right, right, right.", "I am elusive as hell.", "So, is there a La Creuset pot", "- on your registry, by chance? - Of course.", "You can cook and serve in them.", "And it looks amazing on your shelf.", "What's your color of preference?", "French grey or mineral blue?", "Oh, you really do know your Le Creuset.", "[both chuckle] French grey.", "Mineral Blue makes me want to barf.", "Consider it gifted. Also, it would me my honor,", "- to sing at your wedding. - Yeah, I don't think", "- that's gonna be possible. - Oh, I get it.", "You're afraid when I open my mouth.", "Everyone's gonna start smushing on sight.", "No, I more meant that your probably still gonna be in jail.", "Damn, that's right. I almost forgot. Tell you what.", "I'll record you some songs.", "\"Kiss From a Rose\" really exploits my range.", "- [radio static] - We have your food.", "Why are we sending him in? One of my men should do it.", "It would take two of your people three trips each", "to hold this much food. My guy's a pro.", "I've been carrying takeout since before you were born, son.", "Fine, but I wanna know what's going on in there.", "We're putting a camera on him.", "[upbeat music]", "You're on camera. No audio.", "Thought so. That's why I'm tied up.", "Scully, where the pepper flakes?", "Will you calm down? The food's a diversion.", "Although, Scully, it is crazy", "that you forgot the pepper flakes.", "Anyways, you know what to do now.", "What I do best. Turn my heart off.", "[grunts]", "[tense music]", "- What just happened? - Looks like Scully collapsed.", "What the hell?", "Your man just had a heart attack!", "Send an ambulance!", "We're coming out.", "♪ ♪", "Something doesn't feel right.", "Why is there a sheet over his head?", "Because that's not our guy.", "- Judy's trying to escape. - There's no way he could...", "All units move on the ambulance now!", "- All units... - Move, move, move!", "Nice try, Judy.", "- Hi, there. - Nice work, Dennis,", "you just caught a man having a medical emergency.", "Why was there a sheet over his head?", "- Couldn't find his pulse. - Yeah, it's super weak.", "We got movement. Hostages are coming out.", "Hostages are coming out!", "What the hell is going on?", "Does anyone have eyes on Judy?", "Where is Doug Judy?", "So glad Scully put the uniforms in with the pizza.", "I keep finding hidden pepperonis.", "Oh, man, all I got was a pocket full of lettuce.", "- Jake, I got you. - [gasps]", "Ooh, a garlic knot.", "Okay, let's ride.", "We'll be safe here.", "I know the owner. He'd never turn me in.", "Yeah, I have the exact same relationship with the guy who runs", "the laser tag place I love. I mean, gun range.", "Peralta, who you out here stuntin' for, huh?", "I love laser-T. We gotta go sometime, man.", "I was hoping you'd say that.", "- I wasn't stunting. - A little bit.", "- A little stunting. - You stunted.", "A little bit. All right, let's text Halloway", "- and set up the drop. - Okay, yeah.", "Got the diamonds. Let's meet.", "- [cell phone swishes] - Done.", "Okay, now we wait.", "Now we wait.", "Kind of weird, sitting silently", "in a private karaoke room, not singing.", "Yeah, but we're on a mission,", "so, you know, gotta stay focused.", "True, true, true, true, true, true.", "Both: ♪ So I wake in the morning ♪", "♪ And I step outside ♪", "♪ And I take a deep breath ♪", "♪ And I get real high ♪", "♪ And I scream at the top of my lungs ♪", "♪ What's going on? ♪", "- [cell phone dings] - Uh-oh.", "- Halloway. - Yeah.", "The drop is set for 5:00 p.m.", "- Let's do this. - Totally.", "Although... that is an hour and a half from now.", "And the drop point is actually pretty close to here.", "Both: So...", "♪ And I said hey yeah, yeah, yeah ♪", "Order up, chef.", "What is this? Why are you making", "- six sandwiches at once? - It's more efficient.", "Now we're ready for the next five customers.", "Who gives a hump about efficiency?", "The perfect meatball sandwich", "is sauced exactly 70 seconds before being served", "to maintain bread integrity.", "So sandwich number one will be fine,", "but sandwich number six will be a soggy turd.", "Change in menu. We're serving soggy turds now!", "- Get 'em while they're wet. - Okay, I quit.", "Me too. You're insane.", "Fine, quit just like Jeff and Jason did.", "[gasps] You told us they got sick.", "They got sick of hard work just like you two!", "Get out! You'll never cook in this town again!", "- We're not chefs! - And you never will be.", "[scoffs]", "Is Hitchcock doing okay?", "I think so. Wait.", "He's bringing his hand to his face.", "Don't pick your teeth. Don't pick your nose.", "Oh, dear, he's going to lick something off his fingers.", "Oh, no, he's stroking his chin.", "As if in thought.", "Not as if.", "He is in thought.", "Oop, they're looking at us. Act natural.", "- Spreadsheet, spreadsheet. - Crime, crime.", "- Precinct, precinct. - Yeah.", "We swept the area.", "No sign of Doug Judy or Peralta.", "I can't believe that idiot thought", "he could just waltz in here and do my job.", "It's hard to be a negotiator!", "My first 50 jumpers, 49 died.", "You only talked down one person?", "No, he jumped too, but he landed on this woman who broke his fall.", "She died, but you can't count that against me.", "- I definitely can. - Yeah, well, save it.", "Peralta's the one who got himself taken hostage.", "I don't think he was a hostage.", "He's pretty good friends with that Doug guy.", "What?", "Diaz, what the hell is going on?", "First, a jeweler will come out and inspect the diamonds.", "Then, when he gives the okay,", "Halloway will come and get them.", "And then I'll take him down.", "All right, that's the signal. Here we go.", "[car door closes]", "What's up, dude?", "[tense music]", "♪ ♪", "Anybody ever tell you, you look like", "the most interesting man in the world?", "You get that a lot?", "Jeez, I get it. We're not friends.", "I'll find another bocce ball partner.", "There he is. ♪ Halloway, it's your day ♪", "What's up, Mr. Halloway. How you doing?", "Shut up. Give me the diamonds.", "Man, I guess the no-small-talk policy", "- starts at the top. - Come on, come on, come on.", "- Peralta! - No, no, no, not now.", "I tracked your phone, idiot.", "- [tires squeal] - Judy wasn't lying.", "That's Halloway. We gotta arrest him.", "- Jake, he's running. - Come on, man.", "Only if I get the collar and 100% of the credit.", "Are you negotiating right now?", "Always.", "Okay, that was actually a really cool thing to say.", "All right, let's do it. Judy, stay here.", "Okay.", "Stop!", "[both grunt]", "Sorry I ran out on you at the jewelry store.", "I just couldn't let this guys get away.", "Look, man, I'm fine with it.", "Arresting Halloway's gonna get me a promotion,", "and at the end of the day, that's what this is all about.", "Right, well, that and getting a major drug lord off the streets.", "Let me give you some advice. I don't care about that.", "You know, you should really look up the word advice.", "I think you might be surprised what you see.", "All right, let's bring in Doug Judy.", "Oh, no!", "Where is he? Doug?", "Don't worry. We'll get him.", "At least we have Halloway and the diamonds.", "- Doug! - Wait, why are you", "- still calling for him? - Doug!", "Oh, my God, he has the diamonds, doesn't he?", "Doug!", "I'm sure Judy didn't run off with the diamonds.", "I bet he's looking for us right now.", "You know what, I bet he's worried that we're in trouble.", "I'll just call him and put his mind at ease.", "Dude, he's already gone. He's not picking up.", "- What's up, Peralta. - Ha!", "He did pick up. In your...", "- This is good-bye forever. - No!", "Ugh, I can't believe you deceived me.", "I can't believe you used my love for your mother", "- against me. - I love that you love her.", "Of course I do. She's a living saint.", "Amen. Look, I wasn't lying though.", "Halloway was gonna hurt her and you saved her life,", "but then I was all alone with the diamonds,", "next thing I know, I'm hot wiring a car and driving away.", "Oh, but I thought you liked being a good citizen?", "You voted Ed Breakfast for school board.", "And he immediately had a sex scandal.", "- It was very disillusioning. - For sure.", "Our democracy is crumbling. But what about your job?", "What about Dustin from \"Stranger Things\"?", "Famous kids are monsters.", "You do not wanna meet Young Sheldon.", "Really? Ah, that's disappointing. He was so good in \"Big Little Lies.\"", "Wait, no, we are not talking about this right now!", "They could take my badge, Judy!", "I guess Rosa was right. I'm scorpion.", "Scorpion's gonna scorp.", "I'm sorry I can't be the man you want me to be.", "Damn it, stop being so romantic.", "Now turn around and come back to me, you fool?", "Hello? Hello?", "He's gone.", "He broke my heart.", "Now's the time where you tell me everything's gonna be okay.", "- Everything's gonna be okay. - You don't know that, Rosa!", "Ah, Hitchcock, I just got off the phone with Anne Sumter.", "She said you really helped my candidacy.", "- Oh, it's my pleasure, sir. - You were so professional.", "I know. I didn't even fart once.", "You're right. I can hold it.", "You know, if you can change for an interview,", "- you can change for good. - Nah, too much work.", "But that's not how \"My Fair Lady\" ends.", "Eliza Doolittle doesn't go back to her old life.", "She falls in love with Henry Higgins.", "Well, \"My Bare Lady,\" is a little different.", "It's not Eliza Doolittle and Henry Higgins.", "It's Eliza DooEverybody and Leroy Pipe.", "And in the end, they rub...", "Nope. We don't need a recap.", "- Thank you for your help today. - Anytime, Captain.", "Hey, guys. Uh, can we talk?", "Let me guess, you got overwhelmed", "and had to use our six-sandwich technique.", "No, my one at a time system worked perfectly.", "- Oh. - It's just,", "making Nana Boyle's meatball recipe", "got me thinking a lot about her...", "And let me guess, you realized she'd be ashamed", "- of how you acted? - No, Nana Boyle was a monster.", "She once yelled at me so loud, I fainted.", "She was a hateful witch.", "- She died with no friends. - And let me guess,", "you realized you were acting just like her and you felt terrible.", "- Yes. - You see, Amy?", "You don't do \"and let me guess\"", "- until you're sure you're right. - [sighs]", "Can you guys forgive me? Please?", "Of course, Charles.", "But we will never work for you again.", "Yeah, that's a smart move. It's like Jekyll and Hyde.", "I can't control when Nana comes out.", "Just got off the phone with the brass.", "It doesn't look good.", "They're still trying to decide on a punishment", "- for your actions. - Well, did you tell them", "I feel so bad I have a tummy ache?", "I did. They were unaffected.", "They said they could have justified your tactics", "if you'd come away with Halloway and the diamonds,", "but as things stand, there are no diamonds.", "Well, there are some diamonds.", "You know, the tops of engagement rings,", "diamond mines, but, yes, I see what you're saying", "in regards to these diamonds and it ruining my career.", "You're looking at a suspension, maybe worse.", "Unless you can track down Doug Judy", "- and recover those diamonds. - Can they wait 12 months?", "I usually run into him about once a year.", "Wait a minute. What have we here?", "I've got this coupon for a private room.", "Yes. Right this way.", "We already have a song cued up for you.", "[sighs] Judy.", "What's up, Peralta? Thank you so much for coming.", "Look, I thought about it and I did you dirty.", "I never meant to cause you any trouble.", "Yeah, well, you caused me a lot.", "You're talking to a pre-recorded video,", "but it's cool. I know what you're saying.", "- I hear you in my heart. - [sighs] What am I doing here?", "I feel the same way. You my best friend too.", "Look, I'm not coming back.", "I started a new life here in San Diego.", "Stupid telling me where you are.", "Come on, man, I ain't in no damn San Diego.", "Everybody knows that place sucks!", "Here's what I wanna say, though:", "I'm sorry I won't be at your wedding.", "But I did record you a CD of original smush jams", "that will consummate the marriage.", "It's on the table next to you", "along with a little something else.", "[soft music playing]", "A French grey Le Creuset pot.", "Now look inside it.", "[gasps] The diamonds.", "Yes! I cannot believe you actually", "- brought them back... - The diamonds! [laughs]", "- Yeah, mistimed that one. - No, you're the best.", "Look, even though I am a scorpion,", "I will never drown your adorable little frog ass.", "So that's what I had to say.", "I'm sure I'll see you again at some point.", "Now that coupon you got there,", "that's for a full hour in a private room.", "- so... - So...", "Both: ♪ I said hey ♪", "♪ ♪", "♪ What's going on? ♪", "Sync &amp; corrections by emeline-whovian www.addic7ed.com"]