[">Hey, Charles, want to grab a beer before you go home?", "- Ooh, a yeast feast. - Never mind.", "No, no, no, I want to go, it's just,", "there's a huge emergency", "I have to deal with first.", "Oh, no. Is everything okay?", "It's about my food truck.", "I have to get a parking spot.", "Oh. That doesn't sound as intense", "as you were making it out to be.", "Move your ass, you old bitch!", "What is happening?", "We have to get there by 7:00", "when they lift the parking restrictions.", "It's the best spot in Brooklyn,", "and everyone wants it.", "Get the hell out of the way!", "Charles, I highly doubt the entire food truck industry", "is racing to get into this one spot.", "It's not \"Mad Max.\"", "We're neck and neck with rice pudding.", "You got Korean tacos on your six.", "Oh, my God, it's real. We're on the Fury Road.", "Witness me, blood bag!", "Hold on tight!", "*BROOKLYN Nine-Nine* Season 05 Episode 18", "*BROOKLYN Nine-Nine* Episode Title : \"Gray Star Mutual\"", "Sync corrections by srjanapala", "That was the most stressful thing I've ever gone through,", "and I was wrongfully imprisoned last year.", "That was fun.", "Every aspect of owning a food truck is fun.", "It is fun, fun, fun.", "What the hell do you want, Troy?", "You stole my spot, you son of a bitch!", "Oh, go on, get out of here.", "- I'm not going anywhere! - You're just jealous. I made a signal,", "- and you made an illegal U-turn! - Give me a break.", "- I should call the cops! - Oh, are you gonna", "call the cops? Yeah, I'm gonna call the cops!", "- I am the cops! Why don't you go back - Oh, you're a cop now?", "To your garbage truck and cook some pudding?", "You're gonna regret this.", "Kill yourself, Troy!", "Jake, I have a confession to make.", "The food truck is kind of stressing me out.", "Bad news, Captain. A water main burst downtown.", "- There's been several injuries. - Oh, that's unfortunate.", "And the victims are in our blah-blah-blah,", "but tell him the real tragedy, Terry.", "- Olivia Crawford... - AKA your main", "commish competish.", "Tweeted a statement addressing the water main break,", "and she's been retweeted by the mayor.", "\"Kudos to our brave officers\"...", "- Hey, now. - Whoa! What is going on?", "It's in all caps.", "Anyway, I don't see how this is bad news.", "Because the commissioner race,", "like all of life,", "is a popularity contest,", "and Olivia is sitting at the hot senior table", "whilst you are eating lunch alone.", "If the mayor wants to make me the next NYPD commissioner,", "it'll be because of my record and my qualifications,", "not my social media presence.", "This is a serious job. I know.", "But like it or not, the decision is political,", "and social media is a part of politics now.", "You need a Twitter account. Not gonna happen.", "The whole thing is inane.", "Besides, 140 characters is far more", "than anyone needs to make a point.", "They actually upped it to 280.", "Oh, good God.", "I'm so miserable, Jake.", "The truck is hemorrhaging money. I'm going bankrupt.", "- I never see my family. - All right, look.", "You just have to find a way to reduce expenses.", "I've started saving $200 a month", "just by buying \"John Wick\"", "instead of renting it every two nights.", "I have cut costs.", "I fired my only employee, Ted, which was awful.", "Okay, look, I hate to ask this,", "but have you considered shutting the truck down?", "You're always bragging about how much Boyles love to give up.", "I can't. I'm in so much debt.", "I took out a loan for the truck.", "I got Amy to invest.", "No, the only way out of this hole is to keep digging.", "That's not how holes work... Title of your sex tape...", "Charles, look, you're gonna", "find your way out of this, I swear.", "- It's all gonna work out. - You're right.", "You know, if I just work hard and stay positive,", "I'm sure it'll be a huge success", "and everything will be okay.", "There you go.", "Hello? Oh.", "Okay. No, thank you.", "So my truck burned down.", "Hey.", "Someone robbed a bodega on 4th Street.", "It's the fifth one this week.", "It's so sad that someone's targeting bodegas.", "They're part of the fabric of New York.", "- You shop at them a lot? - No. They overcharge", "for everything, and they sell rat poison", "right next to the bananas.", "Yeah, they're gross. I hope they never change.", "Anyway, Holt wants us to interview", "some of the bodega owners and figure out", "where to assign additional uniformed officers.", "I put a map up on the server...", "No! Just email it to me.", "I hate servers. Bye!", "Wait. Why'd you close your laptop so fast?", "- What are you hiding? - Nurthing.", "- You're hiding something. - What?", "- Just 'cause I said \"nurthing\"? - Yes.", "No!", "Aww, you're looking at wedding dresses?", "- That one's dope. - That's not what I was doing.", "My computer must've gone to this site on its own.", "- How is that possible? - It's broken, Y2K.", "I'll fix it.", "There, it's fixed.", "- You're weird. - I know.", "Oh, God. My truck.", "This truck was my baby!", "All right, look, Charles, I know you're upset,", "but maybe there's a silver lining here.", "I mean, you had insurance, right?", "Yeah. I already called them.", "So maybe you'll get some money for this,", "and you can pay off your debts, starting with Amy.", "I'm sorry, that was selfish. Forget I said it.", "You can pay off your debts, starting with Amy.", "Whoops, I did it again.", "You're right. This is my way out.", "It's a miracle.", "Oh, my God!", "Jake? Boyle?", "Adrian. What are you doing here?", "I'm an insurance investigator now.", "I thought you were in Alaska.", "Oh, yeah, I was, after Rosa and I broke up,", "but then I accidentally killed", "a \"protected buffalo\"... Self-defense.", "Next thing I know, Fish and Game are all over my ass.", "I ended up in a fight with a bear,", "and I had to think to myself, why am I even here?", "- Wait a minute. - You fought a bear?", "Big time. The trick on that:", "head-butt him in the penis, push him over a cliff.", "Ah, I bet that works with a lot of animals.", "Only the male ones.", "- Learned that the hard way. - Hmm.", "Anyway, you know that if you guys want", "to get in touch with me, there's easier ways", "than burning down your truck, right?", "What? Burning down my truck?", "Yeah, it's obviously arson, you did it,", "you're not gonna get a dime", "and are probably gonna go to jail.", "So... what's going on with you guys?", "Give me that juicy Nine-Nine goss, am I right?", "This is insane. I mean,", "Charles loved this truck. It's his baby.", "There's no way he'd burn it down.", "The world is a messed up place, Jake.", "People kill their babies.", "Babies kill their parents.", "It's the circle of life.", "- That was clearly a triangle. - Okay, fine, busted.", "I just had the stove's gas line cleaned.", "Maybe it was put back in wrong or something.", "Look, I've caught enough arsonists in my day", "to know that the owner always does it.", "Chuck, how's the truck been doing?", "- Pretty terrible. - Hmm?", "I was just saying, it's a miracle it burned down.", "Okay, I know Charles sounds hella guilty right now,", "but you know he didn't do it.", "Charles, this isn't looking good for you.", "Anybody else that might have done this? Any enemies?", "Well, my dad's best friend and I", "have a pretty intense rivalry,", "but I don't think my aunt would do anything illegal.", "Oh, my God.", "Wait. The rice pudding truck guy!", "Oh, my God. That bastard Troy.", "We just got into a fight about this very parking spot.", "He said I'd regret it.", "Yeah, and that's what happened.", "You're regretting it!", "Come on, you know we didn't commit arson.", "- Adrian, this is us. - Not the TV show.", "- We are your friends. - Not the movie.", "- You got to have faith. - Not the song.", "Are you doing this on purpose?", "- The third one, yes. - Okay.", "I'll admit, arson does seem", "out of character for you.", "Okay, look me in the eyes.", "Look me in the eyes like the bear did.", "Okay.", "I believe you, and together,", "we're gonna catch the SOB that did this.", "I'm so glad he didn't head-butt me in the penis.", "That's all I was thinking about.", "Cheddar!", "- That's a really good job. - Stay, stay.", "What's going on here? Why is Cheddar here?", "And why is he in swim trunks?", "Because the little sailor outfit", "- wouldn't fit his tush. - Excuse me?", "We're setting you up a Twitter account,", "and the fastest way to get followers", "is cute animal pics.", "I follow an account that's just", "this one real grouchy chinchilla.", "He hates waking up so much!", "He really does. He's like \"Ooh!\"", "This is ridiculous.", "This has nothing to do with police work.", "Exactly. It's about being noticed,", "and right now, no one is noticing you.", "I didn't even realize we were talking", "to a third party, presently.", "Fine. If you really think it's necessary,", "I will establish a social media presence.", "But I'll be setting up my own accounts,", "and I assure you,", "I won't be resorting to foolish gimmicks", "involving my dog.", "Uh, you might want to rethink that stance,", "because how cute would Cheddar look in this hat?", "Please. When it comes to clothes,", "Cheddar wears little booties in the snow,", "or Cheddar wears nothing.", "Troy's not home, but I say we wait.", "I have some hard questions for that rice pudding bastard.", "So, Adrian, how's life as an insurance investigator?", "It's amazing. At Gray Star Mutual,", "they let me do whatever I want,", "as long as I'm getting that job done, and you know I am.", "Last week, I waterboarded a dude.", "- Oh, that's not legal. - Doesn't matter.", "I'm not a cop. Anyway, what's up with you guys?", "Hey, Jake, who you porking?", "Uh, I guess Amy and I are still...", "I don't want to say it. Yep.", "- Porking. - Yeah, you are. Nice.", "Actually, we got engaged.", "What the hell? How come I didn't know?", "I thought we were supposed to be friends.", "Oh, wait a minute. Did this, like, just happen?", "Well, it was at Halloween.", "Wha... no, that's so long ago!", "Charles, are you just finding out about this too?", "No, I was there.", "You were there? Who else?", "Who else got to be a part of this?", "Nobody, you know, just...", "Holt and...", "- Terry and Rosa. - Okay.", "- And Hitchcock and Scully. - Seriously?", "And this creepy guy named Bill.", "Oh, come on! I'm the creepy guy", "that's supposed to be at stuff that you have happen.", "Look, you just left town,", "and we don't exactly have a text relationship...", "How dare you?", "May 10th, I texted you,", "I'm at the Gaga concert, you here,", "question mark, question mark, question mark.", "You texted back, No. Frowny face.", "Look, I've been really busy. I'm sorry, okay?", "I understand.", "You know, I just didn't hear about this one thing.", "I mean, I can't imagine there are any other", "major milestones that I've missed.", "Are there? I mean, Amy's a sergeant.", "- No. - And Holt's up", "- for commissioner. - Seriously?", "And Dr. Ronald Yee came to the precinct", "and taught a course on forensics.", "The Dr. Ronald Yee?", "- Mm-hmm. - Oh, my God!", "- Yee was in the building? - Yeah.", "Wow, didn't realize the Yee news was up there", "- with the other stuff. - Oh, come on, Jake.", "Yee only wrote the book on forensic facial reconstruction.", "He's a rock star!", "You guys could have texted me, but no,", "because I bet you haven't thought about me once", "since I dumped Rosa.", "- Did you dump her? - You know what?", "I need some air. I'm storming out.", "I'm storming out!", "So I can spare four uniformed officers", "to do hourly pass-bys of the bodegas south of 4th,", "and I'll coordinate with the, um...", "hourly pass-bys of the...", "Wait. What was that?", "That was me talking about hourly pass-bys.", "Oh, yeah, I heard about the hourly pass-bys.", "Twice. I meant...", "That subtle side look.", "There was no subtle side look.", "You're right, 'cause it wasn't subtle.", "It was an unsubtle side look at...", "that dress in the shop.", "Why are you being such a nutjob", "about looking for a wedding dress?", "Because being a female sergeant is difficult.", "I have to work twice as hard", "to gain my officers' respect,", "and looking at girly dresses isn't going to help.", "Plus, it's a new job, and I need to make it a priority.", "Dude, I get that, but if you want", "a beautiful wedding dress, you deserve to find one.", "Look, there are no cops around.", "Nobody's gonna see you.", "Why don't we just take our break now,", "try one on?", "- Okay? - Okay.", "- Okay? - Okay.", "- Okay? - Okay.", "Hell yeah!", "They are closed.", "We will come back later. Yeah.", "Where did Adrian go? He seemed upset.", "- Should we be worried? - Always.", "We should always be worried about him.", "Jake. Look, look.", "Excuse me, Troy Lunniker, we are...", "I know exactly who you are, you spot-stealing", "son of a bitch! I didn't steal your spot!", "You were too slow, you idiot! You did steal my spot, man.", "You with the horrible meatballs.", "You should call them crap balls, man!", "Oh, my food tastes like crap?", "Hey, hey, hey, hey! Stop.", "- Crap balls. - Hey!", "Look, Detective Boyle's truck burned down.", "Yeah, and you did it.", "You torched my truck, and you're going to jail.", "Whoa. Someone burned down your truck?", "I'm sorry, man, but I would never do anything like that.", "I swear it wasn't me.", "Well, I'd love to believe you, Troy,", "but I'm afraid we're gonna need to see some proof.", "Oh, my God, he had so much proof.", "I can't believe he was on \"Cash Cab\"", "at the exact moment my truck burned down.", "And he did so well.", "He named every member of The Monkees.", "- He even got Tork. - No one gets Tork.", "I know. All right, so if it wasn't Troy,", "the question is, who could it have been?", "What's up, jerks?", "Pimento, you broke into my house?", "Yeah. I'm an insurance investigator.", "I can do whatever I want. What are you doing here?", "I'm working the case. I'm looking for clues.", "Come on, you already said Charles couldn't do this.", "- I couldn't do it. - That's what I thought.", "But then I realized,", "if you can hide your engagement from me,", "what else are you capable of hiding?", "Oh, right. Arson!", "Come on, don't you think that's a bit of a stretch?", "Is it? Lab tests came back", "and said the accelerant used in the fire was turpentine.", "And look what I found in Boyle's wife's closet.", "Looks to me a lot like turpentine.", "Oh, I wouldn't do that.", "Turpentine, just like I thought.", "That's Genevieve's. She uses it for her paintings.", "Oh, likely story.", "If that's the case, then how do you explain this", "that I found on your fridge?", "My wedding invitation?", "Aha, so you admit it.", "Invites have gone out, and I didn't get one!", "Oh, well, well, well.", "Now you both are gonna pay.", "- Adrian. - Hey, come on.", "Oh, I thought you were reaching for a gun.", "Oh, no, my friend.", "This is much worse than a gun.", "This is a stamp,", "a stamp that says...", "Denied.", "Your claim is denied.", "Do you really think the insurance company", "will replace Adrian as the investigator on my case?", "Yeah. It's Gray Star Mutual...", "\"Where the feeling is mutual.\"", "And right now we're feeling like we want a new investigator.", "Hi, I'm Travis.", "I've been reviewing your appeal.", "I understand you have a problem with Mr. Pimento.", "Yes, we sort of have", "a complicated preexisting relationship,", "which I think is a conflict of interest.", "Okay, I'll be honest,", "we've had some problems with Mr. Pimento before.", "I think he may have broken into my apartment once.", "Oh, you'd know. He leaves a lot of hair behind.", "- He's a shedder. - Mmhmm.", "Okay. I'll talk to my supervisor,", "see what can be done.", "Great. Thank you very much.", "See, Charles? Things are starting to look up.", "Up your butt!", "Adrian! What a coincidence.", "We were just... filing a complaint about you.", "You were obviously listening.", "I don't know why I'm trying to lie.", "Oh, we're locked in. Great.", "First you cut me out of your lives,", "then you try and get me fired?", "My therapist was right about you guys.", "You're a couple of dinguses.", "You have a therapist?", "Yeah, he's helping me work on my rotator cuff.", "Oh, I see, it's a physical therapist.", "Oh, he's very physical, Charles.", "Very physical.", "So what do you think?", "Mm, I don't love the sash.", "But it's fine. I'm just gonna get it.", "What? That's the first one you tried on.", "I once saw you look at 54 different accordion folders", "and not buy any of them due to weak tabs.", "I file hard. I need strong tabs.", "I just don't want to take up any more time.", "Your break's not even a quarter done.", "I'll stay another ten minutes.", "You'll stay until I dismiss you.", "Irene, music.", "Now spin.", "All units,", "attempted 1030-Charlie.", "Bodega on Smith.", "Perp is heading east on Baltic.", "That's us! We're on Baltic.", "Oh, crap. That was him!", "Hey!", "NYPD, stop!", "Hey! Stop.", "- Stay down! - Damn, sarge.", "Maybe I do like the sash.", "Sir, brace yourself.", "Olivia Crawford just tweeted a post", "of an officer carrying a woman", "through knee-deep flood waters.", "Spoiler alert: they are of different races.", "Terry teared up.", "I love when calamity brings people together.", "Sir, it got another retweet from the mayor.", "It got a retweet from the governor.", "Well, I have already set up my accounts,", "and not to toot my own bugle,", "but I think I did an admirable job.", "Oh, okay, what's your handle? I'll be your first follower.", "It's @5261796d6e6420486f6c74.", "It spells \"Raymond Holt\" in hexadecimal code.", "- Clever, right? - Captain, are you sure", "you wouldn't like some help with this?", "Oh, no need. Now, for my first tweet,", "I think I should give an update on the water main break", "that's actually informative.", "\"NYC H20-Main SITREP: at 2040 EDT", "current PSI 456 MAX CAP 204000 LPM.\"", "Suck on that tasty lemon drop, Olivia Crawford.", "Oh, look at that. An alert.", "I'm probably trending already.", "What? My account has been deactivated?", "Twitter thinks you're a bot.", "Why? I am a human.", "I am a human male.", "Adrian, open up.", "Get out of here, Travis!", "Come on, Adrian, admit it.", "You have a conflict of interest.", "How could I have a conflict of interest?", "We barely have a relationship.", "We're not even friends anymore.", "- You saw to that, didn't you? - That's crazy.", "We may have lost touch, but we're still friends.", "Oh, is that right, Jake? Are we still friends?", "If that's the case, then when did I lose my virginity?", "Oh, man, you've told us", "so many intense graphic sex stories.", "I have! But a true friend", "always remembers a friend's first.", "Jake, we know this! It's got to be", "one of the swamps.", "Uh, Florida swamp,", "or Okefenokee Swamp, or...", "Oh, was it a bayou?", "No, no, no! I've got it.", "Summer of '91, at a screening", "of \"Robin Hood: Prince of Thieves.\"", "Well done. It was Bryan Adams' soundtrack", "and Kevin Costner's flawless British accent", "that put us in the mood to get gross.", "Next question. Favorite shape?", "- Oval? - Of course!", "- Favorite scent? - Trick question.", "Both: You lost your sense of smell in a...", "all: Shipwreck!", "Guys, we are friends!", "Aww, I love you guys.", "Are you still angry?", "No, that was a cathartic scream of love.", "- Understood. - Good.", "Well, anyways, I'm sorry about how things went down, man.", "We should have stayed in touch.", "No, it's just as much my fault as yours.", "I could have kept in touch with you guys", "and probably should have told you about my new family.", "Your new what now?", "Ah, Travis. Great, you're here.", "These gentlemen are innocent and are free to go.", "- You're fired, Adrian. - What?", "And as for you, my supervisor and I reviewed your case.", "Turpentine is all the proof we need to deny your claim.", "The feeling wasn't mutual.", "You're so lame, you know that, Travis?", "Wait a second. Is this just because I did molly", "- with your daughter? - You did?", "Don't think he knew about that.", "Just don't ever come back here again.", "If you do, I'll have you arrested.", "How dare you?", "I gave you the best two weeks of my life!", "Oh, guys, I'm so screwed. We got no leads.", "I'm not gonna get any of the money back.", "What do we do?", "We go directly to Travis' house right now,", "pee on everything he owns,", "and then burn that place to the ground.", "- Adrian, that's it. - It is?", "- Yes! I knew it! - No, no, no.", "Not anything about anything you said.", "But, Charles, didn't you just tell me you fired someone?", "Yeah, Ted. I took him out to dinner.", "He thought he was getting a promotion.", "It was a whole thing.", "He wept a lot. Not as much as me...", "Yeah, but the point is, he was upset, right?", "And he knew where you liked to park the truck.", "Uh-huh. And he never gave me my key back.", "He said he lost it. You really think it's him?", "I mean, it's just a hunch, but...", "We should go to his house and burn it down.", "I was gonna say we could go investigate.", "Sure, sure, sure.", "And then burn it to the ground.", "No. No burning of anything!", "What? I already got the match lit.", "- How? - Let's hurry up and get there.", "Captain, I'm trying to get your account reinstated,", "but it could take a while.", "They say they have a lot of Nazi stuff", "on the front burner.", "And when you tweet again,", "you should probably stop communicating in numbers, kay?", "There's a 0% chance of that.", "Besides, I won't be tweeting anymore.", "I just got off the phone with the head", "- of the selection committee. - You did?", "Apparently, one of the candidates for commissioner", "tweeted a picture of the water main break", "and accidentally included a link", "to his favorite pornographic website...", "- Mm. - Cosplay-butts-n-boobs.com.", "Amateur move.", "You should never copy-paste if you're a perv.", "It's quite the scandal. The candidate has dropped out.", "It's down to just three of us now.", "So I guess this proves I was right all along.", "Social media... It's a fool's game,", "and only a fool would play.", "Mm-hmm, mm-hmm.", "And why is Cheddar wearing a beret?", "Uh...", "Kevin saw your photos and was amused,", "so we started an Instagram account for Cheddar,", "who now has over 14,000 followers.", "Hoo-whee!", "It's an incredible feeling.", "This is insulting.", "First you fire me in front of my family.", "Ooh, Charles, his family was at the dinner?", "It was not well-handled.", "Now you accuse me of arson.", "Just get out of my garage.", "Hey, Ted?", "How come you have all this turpentine?", "And this plastic bag filled with matches and magnesium strips.", "I found it buried under the back porch,", "and I'm no expert, but it seems like", "that's the kind of stuff you'd use to light a fire, right?", "Oh, there he goes.", "Say it with me, Jake.", "You've been...", "- Denied! - Butt-slammed!", "Wait, what? Denied, like the stamp?", "Oh, that is so much better.", "\"Butt-slammed\" is so stupid.", "Oh, is that the wedding dress", "from the Erica Somerfield 2018 fall collection?", "No way, the bodice is totally different.", "Why do you two know so much about wedding dresses?", "They're the only thing you can look at around here", "with safe search on!", "All right, that's enough.", "Can we all get back to police work", "and stop talking about wedding dresses?", "No. We're gonna talk about them,", "because while wearing a wedding dress,", "you leapt over a couch,", "sprinted down an alley, and jumped off a car", "to subdue the crap out of a perp like you were Wonder Woman.", "It was pretty cool, wasn't it?", "Amy, you are an amazing cop and a great leader,", "and you have proven that a billion times over.", "You can't let other people's opinions get in the way", "of what you want, especially because other people suck.", "Well, if I'm being honest,", "- I would like a prettier dress. - There you go.", "And I would like it to have some lace.", "- Uh-huh. - And a sweetheart neckline,", "- thank you very much. - What else?", "And I want a mermaid cut with tulip sleeves.", "Say it again. Say it loud.", "A mermaid cut with tulip frickin' sleeves!", "Pimento's here! All right!", "Thanks so much for that text, man.", "- That meant a lot. - The one that said,", "- \"Want to grab a drink tonight?\" - Yeah.", "Hey, Boyle, did you get that insurance payout?", "Yes, I am out of the food truck business,", "and I no longer start spontaneously weeping.", "Nice.", "Listen, I'm sorry you got fired.", "Oh, don't worry about it. I got myself fired, all right?", "Plus, doesn't matter. I got a way better job now.", "I'm working at one of those fancy hand lotion stores.", "Spoiler alert: I have a gun again,", "and I've gotten to use it three times.", "You would be surprised how often teenage girls", "try and shoplift mango hand cream.", "- Huh. - But it smells great!", "- I love it. - I can get you some.", "Well, listen, man, I've got something for you.", "Really? For me?", "It's an invitation to my wedding.", "Aw, Jake, I am so honored", "and would love to be...", "Oh, nope, I can't make this.", "This is the same night as Lady Gaga.", "Oh, thank God. I didn't run it by Amy,", "so this worked out great for both of us!", "But honestly,", "nobody's gonna come to this,", "because everybody's gonna be at Gaga.", "- Not a doctor. - Shh."]