[">♪♪", "Halloween. Mua-ha-ha-ha.", "It's heist time.", "- Dah! - Thought you could get", "a head start on heist prep? Good luck.", "I'm already dressed.", "Well... I'm also dressed,", "and I made breakfast.", "- Wait, where are my eggs? - In my belly.", "Now get a move on.", "It's heist time.", "I love Halloween!", "♪♪ *BROOKLYN NINE-NINE* Season 05 Episode 04 Title: \"Halloveen\"", "♪♪", "♪♪", "Some of you have asked me what got me through prison.", "Was it my family? Don't be stupid.", "Was it knowing that my friends would eventually get me out?", "Of course not, I never believed in any of you.", "No, the only thing that kept me sane", "was planning for the Halloween heist", "those many years doing hard time.", "- It was eight weeks. - I also went to prison, dog.", "- We're getting off track here. - No, we're not, dog.", "Peralta's just trying to play the sympathy card", "so we all go easy on him.", "I'd rather send you back to prison", "- than see you win. - Okay.", "This year, we compete for the most elegant and regal", "of all prizes...", "A championship cummerbund.", "Or belt, as normal people call it.", "Belt... I'd like to see the pair of slacks", "whose loops are large enough for this belt.", "No, it is a cummerbund.", "- Well, whatever it is... - Cummerbund.", "It's inscribed with the words, \"Amazing human/genius.\"", "The objective is to have it in your possession at midnight.", "This year, the competition is not limited", "- to winners of the past heists. - That's right.", "Any man, or woman has to", "... can enterinto it.", "- It's open to everyone. - Ooh, every man for himself.", "It's like \"Bachelor in Paradise.\"", "It's really cool that you guys opened it up to anyone.", "Thanks. Yeah, we talked about it,", "and we just felt like it was only fair.", "I was being sarcastic. You all suck,", "and I hope Jake goes back to jail.", "Oh, cool, I'm glad everyone feels comfortable joking about that.", "- Not joking. - Insult me all you want,", "for I have only this to say...", "Victory shall be mine!", "I heard you practicing in the shower. You can't surprise me.", "Letting me into your life was the worst mistake you ever made.", "Cool, fun take on our relationship.", "Well, I for one thing you're perfect for each other...", "Feel like there's gonna be more.", "- Because you're both losers. - There it is.", "None of you stand a chance against me. No courage, no patience,", "no brains,", "and, of course, a bald old man.", "I'm younger than you.", "No comeback for the bald thing, I see.", "Yeah, I'm not doing the heist. I'm out.", "Okay.", "- Bull crap. - Yeah, right.", "Just like you were out last year.", "- I was out last year. - As a setup for this year.", "You're good, Jeffords, but not good enough.", "In fact, you're an idiot. I should've fired you long ago.", "- What? - Relax, Terry, chill out.", "Get your undies out of your buns.", "Now, if everyone would rise.", "Rise like the army of the dead,", "and follow me into the bullpen of destiny.", "This heist,", "the belt will not be locked up or hidden away.", "It will be suspended from the ceiling in plain sight", "- for all to see. - How poetic.", "It will hang just out of reach,", "like Tantalus's fruit.", "Yes, that's where I got the inspiration from,", "Greek mythology, not an episode of the Nickelodeon show \"Guts.\"", "Amy, will you please do the honors?", "Mm-hmm.", "- The belt is in place. - Whoever has it at midnight", "will be declared the...", "What's going on?", "- What's happening? - I can't see!", "Everybody just grab something random.", "Back off, Hitchcock.", "Silence!", "It's gone. The cummerbund is gone!", "Who took it? We're all here. Where'd it go?", "Nowhere. It's still in this room.", "In fact, it's right here!", "Nope, it's just your tum-tum.", "I don't have the cummerbund, because it's right here!", "Or is it right here?", "Everybody stop undressing.", "We just had harassment training.", "Hey... over here, losers.", "This is Gina Linetti.", "You really thought you could do this without me?", "I'm the defending champion.", "Gina... I should have known it was you, you punk.", "Yeah, you punk,", "why aren't you showing your face, you punk?", "Yeah, I just had a baby.", "I haven't washed my hair in three weeks.", "Oh, how is she?", "- Yeah, how's she doing? - None of your business.", "Now, if you wanna find the belt,", "you're gonna have to work for it.", "Behind my desk are boxes of baby stuff", "that I didn't wanna assemble.", "You get a clue for each item you put together.", "Linetti, Lin-out-ti.", "This is crazy.", "I mean, no one is actually gonna do Gina's dumb chores, right?", "Right, absolutely not.", "It's completely ridiculous.", "I got the reach-and-play!", "You can all suck it!", "- They fell for it. - Hook, line, and sphincter.", "- It's sinker. - No, it's sphincter.", "That's where you put the hook in when you're eeling.", "Well, I never use that expression again.", "- Hey, guys. - Ah.", "- And right on time, here's Bill. - Welcome.", "Man, it is amazing how similar you guys look.", "- I don't see it. - Me neither.", "- Not even a little. - Not at all.", "Twins. So, did you have any issues", "- getting into the vents? - Went like clockwork.", "Sir, only authorized personnel are allowed up here.", "Oh, Detective Boyle, didn't see it was you.", "Get better eyes, you moron.", "Ah, man, I'm friends with Officer Lou.", "Not anymore. He was very upset.", "Anyway, once I got in the vents, it was smooth sailing.", "The belt is in place.", "Whoever has it at midnight will be declared the winner", "of the fifth annual...", "- What's going on? - What's happening?", "I can't see! Everyone just grab something randomly.", "Back off, Hitchcock.", "Hey, over here, losers.", "I gotta say, Bill, your Gina impression was spot-on.", "I'm very good at roleplay,", "and I'm super comfortable wearing masks.", "Right, I forgot you were maybe a male prostitute.", "I was definitely a male prostitute,", "but I don't do that profession anymore.", "Now I sell vitamin supplements.", "I made $90,000 this year alone,", "working out of the comfort of my own home.", "- Uh-huh? - How did I do it?", "- NutriBoom. - Right.", "And the good news is, you can do it too.", "Okay, this is clearly a pyramid scheme. We're not interested.", "Okay, your loss.", "- Here's the belt... - Ah...", "- she's a beauty. - Hi-yah!", "Ow! Charles, what are you doing?", "The hardest thing I've ever done: betraying you.", "Bill, the belt.", "- Bill, you're in on this too? - Yep.", "Charles promised he'd buy a ton of supplements", "and become one of my downstream distributors.", "No, look, listen to me, don't do this, okay?", "I really need to win this year. I'm begging you.", "Those baby browns aren't gonna work on me, not today.", "This is crazy.", "You're never gonna get out of here with that belt on your own.", "I'm not on my own. I have an alliance.", "An alliance.", "It's not \"Bachelor in Paradise.\" It's \"Survivor.\"", "Rosa, I am very disappointed in you.", "Your approval means nothing to me.", "Copy that. And Terry, I knew you were playing.", "- Last year was a setup. - Hell yeah, it was.", "I'm sick of you, Amy, and Holt winning.", "- You're all so damn smug. - Yeah, you guys may be champs,", "but this year... this year belongs to The Tramps.", "- Charles, that's a bad name. - Ha, you're just jealous.", "- Everyone loves it. - No.", "- Nuh-uh. - Bill, keep an eye on him.", "Let's go, Tramps. Charles, no! No!", "Hey, let me ask you this, how would you like to be your own boss?", "Not now, Bill!", "Amy! Amy, in here!", "In here. Help.", "- Hello, fake Charles. - Hi.", "Hello, tied-up Jake.", "Will you please help me get out of this?", "It's not for the heist. I just really have to pee.", "I know you don't drink water. You pee once every two days.", "- And you went this morning. - Damn it, you know me so well.", "All right, how about this?", "I've got top secret info about various dealings.", "If you let me out of these cuffs,", "- I'll share it with you. - What kind of info?", "Well, first off, Wolf Gina...", "Was just a ruse so you and Charles could steal the belt.", "Yeah-huh, but also...", "Charles teamed up with Rosa and Terry to form The Tramps.", "Gah! How did you know that?", "I gave Charles the idea last year.", "Gina's one of the champs.", "And I'm just one of the tramps.", "Ooh, The Tramps.", "That's a great name for something.", "I just don't know what.", "But I do.", "I told you, I'll always be one step ahead of you.", "You can't surprise me. Ya boring.", "You know what spices up a relationship?", "Co-owning a multi-tiered marketing...", "Ignore him. Look, there are three Tramps.", "The only way we're gonna win is if we team up.", "Good point. I guess my response is,", "rot in hell, crap-face!", "Also, I love you, and I treasure you,", "- and ya bore me. - God, you're being so mean.", "- Do it more. - I hope you die.", "Bye.", "Fine! Go! Who needs you, ya freakin' jag!", "Looks like we're all clear. Good job, guys.", "Oh, nothing can stop this Tramp train.", "Boyle, stop finding variations on a word we hate.", "Okay, Sarge, lift up the super heavy thing", "that no one else is strong enough to lift.", "Nice, Sarge! Keep lifting heavy stuff like that,", "and maybe you'll work off some of that bulk, huh?", "- What? - I set up an electric eye yesterday,", "so if anyone enters this room, an alarm will go off.", "Let's move. Don't cross the beam.", "Cool, yeah, that's something I can do, without any problem.", "Alarm works.", "All right, fine,", "looks like I'm gonna have to \"127 Hours\" this sitch.", "- You're gonna cut off your own arm? - Is that how it ends?", "Oh, man, I got busy, and my rental period expired.", "I thought he just wiggled out. Come, will you just please un-cuff me?", "Please, you gotta, man.", "I've never treated you like a prostitute.", "- You just did. - Touché.", "All right, how about this? I will buy...", "double the amount of supplements that Boyle did.", "- $8,000? - What? He gave you 4 grand?", "All right, fine, I'm in.", "He didn't give it to me. He invested it in his future.", "- And you can too. - Yeah, I already agreed to it.", "- You don't have to keep selling me. - Sorry, the script we're given", "anticipates a lot more resistance.", "Okay, so let's get the paperwork started.", "First things first, you are not allowed", "to have any of this reviewed by an attorney.", "Yeah, this seems bad.", "So, where on Gina's mobile", "should I place this moonless Jupiter?", "I pity the child who lies beneath this solar system.", "Hey, Captain, something's going on with this heist.", "You tell us everything you know,", "and we'll tell you everything we know.", "- I'd rather not. - Jokes on you,", "- we don't know anything. - Well, good day then.", "- Wait, why are you sweating? - I'm not sweating.", "No, I've had enough heart attacks", "to know what sweating looks like, and that's sweat.", "Well, if I'm sweating, as you claim,", "it's because I was watching an exciting video on the net.", "Really? What?", "It was a video of an American gymnast.", "His leotard ripped, exposing his butt.", "- It was highly erotic. - You're lying.", "I.T. just installed blocker software,", "- thanks to moi. - Uh, yes,", "but they didn't install it on my computer,", "because I'm a captain.", "You don't look hot and bothered at all to me.", "- Show us the erotica. - Gentlemen,", "I assure you, there's nothing to see.", "Now, if you'll excuse me, I have to grab some fresh air.", "Good boy, Cheddar. Bring me that cummerbund.", "Oh, yeah.", "Wait a minute...", "this isn't the championship cummerbund.", "This is some common cummerbund.", "And you're not Cheddar. You're just some common bitch.", "And this says you've received your sales training.", "- Great. - And this one is", "a sworn affidavit stating that you have seen Debbie Stovelman,", "the wife of NutriBoom founder, David Stovelman,", "and that you found her to be happy, healthy, and alive.", "Okay, fine. Great, all right, done.", "Just get me out of these.", "Hey, what's going on here?", "Yeah! Didn't think I could get out of my cuffs, did you, Boyle?", "But you forgot about one important thing...", "- NutriBoom. - NutriBoom! That's right.", "I'm in the President's Circle now.", "Sorry, Charles, this year's heist was just too important.", "- Watch him, Bill. - Check in, Boyle, check in.", "Uh-oh, Jake, they check in every ten minutes,", "and I have to respond with a code only we know.", "- I am a Tramp. - Copy that.", "Did I guess it? Did I guess the code?", "I couldn't hear what Rosa said back, but was that right?", "- You got it. - Yeah, I thought so, okay.", "Okay, security system, talk to me.", "What have I missed? What's going on?", "Ah-ha! Holt used Cheddar to steal the belt.", "But that's not Cheddar.", "Holt and Cheddar always walk in a perfect lockstep.", "Which means someone took Cheddar,", "and that person has the belt.", "But who? Who took Cheddar?", "- Where are you coming from? - Why do you care?", "- Thought you weren't heisting. - I'm not.", "I'm just interested in your comings and goings,", "because I care about you as a friend.", "Okay, friend, I went to the bathroom.", "Well, you were gone a long time, friend.", "- You feeling okay, friend? - No, it was number two,", "and it was very intense, friend.", "Bless you.", "She sneezed. Dog allergies.", "Which means that Amy took...", "Cheddar!", "Where is my dog?", "Aren't you standing right next to him?", "This bitch? Please. Watch.", "Shake. Shake.", "Idiot.", "I know one of you took Cheddar,", "and you did it for the sake of the heist,", "but if anything happens to him, I will end you.", "I couldn't bring myself to neuter Cheddar,", "but I will neuter you all.", "Uh, bing-pot.", "♪♪", "♪♪", "Cheddar? Cheddar?", "Shake.", "Ah, good grip, pristine coat.", "That's my doggie!", "You betrayed me. You'll explain yourself later.", "Return to my office.", "Guys, why is there smoke coming from the break room?", "What's going on? Is someone doing something?", "Who's doing something?", "\"Handmaid's Tale.\" This is Amy.", "She won't shut up about how relevant that show is", "- in today's political landscape. - It's relevant as hell,", "but I'm not doing anything.", "Terry also loved the show. This is him.", "No, no, I love Elisabeth Moss.", "Terry thought the show was too bleak.", "Oh, they're coming from everywhere.", "Hello. Blessed be the fruit, baby.", "- Hitchcock, you watch that show? - Watch what?", "- That's my pickup line. - What are they doing?", "We haven't heard from Charles. We need to check to make sure", "- everything's fine. - Check what? The server?", "I stole the cummerbund from under there an hour ago.", "- You knew about... - About you playing? The server?", "I've known about your plans for weeks.", "Uh-oh, they're circling. Stop!", "Hello, Ofamy.", "Hello.", "- I don't know what's going on. - I do.", "Handmaids, out!", "They really listen to you.", "You figured out I had the belt in my safe,", "and you thought you could distract me and steal the key.", "I did think those things, yes,", "and then... I did it.", "Please. Impossible.", "The key has been in my shoe the entire time.", "Okay, well, it's almost midnight.", "Why don't you try and use your key?", "It fits.", "I knew you were lying. You are so predictable.", "Uh-oh, it's not turning.", "I guess I'm not quite as predictable as you thought.", "And I also bet none of you can predict", "what I'm gonna do next.", "Use your key to open the safe and act like a dick about it?", "Yes, obviously that's what I'm gonna do, Rosa.", "You just have to be so spot-on all the time.", "If I may... mm...", "just get my skirt up, thanks.", "Oh, look at that, the key fits.", "And the lock is turning, and the safe is... empty?", "- What? - There's no cummerbund?", "- Never was. It was always a belt. - I don't understand. Who took it?", "We haven't heard from Charles in an hour. Maybe he betrayed The Tramps.", "Oh, God, I just called us The Tramps. What have I become?", "It's not Charles. I locked him up.", "Ah-ah-ah-ah-ah, I put a GPS tracker on the belt.", "It's on the move, and it's going fast!", "Let's take my bike. They'll never catch us.", "- Later, dorks. - Should we follow them? I...", "Captain, why are you giggling?", "I put a GPS tracker inside of Terry.", "Sarge, Kevin purchased one too many full-fat French yogurts.", "- You want it? - Absolutely.", "Enjoy, Jeffords. Enjoy.", "Devious, I know, but...", "I also put a tracker in Terry's yogurt.", "Same here. No reason.", "Just 'cause you're a great sergeant.", "Now suck it down.", "Eh, no problem, take it.", "Swallow the 'gurt.", "Do you guys think all that radiation", "- is bad for him? - I'm sure he'll be fine.", "- He's lived a long life already. - Yeah.", "Good luck keeping up with me.", "I've done my morning calisthenics.", "Oh, I'll keep up with you...", "Rah!", "In hell. Mua-ha-ha-ha-ha-ha-ha-ha.", "- Hello, Jacob. - Dah!", "What... Ames...", "What are you doing here? Why aren't you out looking for the belt?", "You and I both know the belt never left the precinct.", "I don't know that. Nobody knows that.", "I kept thinking, \"How did anyone swap my key?\"", "And then it hit me... they didn't. They swapped the safe.", "One of the handmaids, I'm assuming fake Charles,", "took my safe, and then Ofamy deposited a lookalike.", "What did you give fake Charles so he'd help you?", "Nothing. In fact, he gave me something,", "the power of financial freedom.", "I invested in a pyramid scheme.", "It's no time to go into it right now.", "Okay... so, while we all tried to figure out", "who had the real key,", "fake Charles broke into the safe, removed the tracke,", "and led Terry and the whole squad on a wild goose chase.", "My only question is, which box is the belt in?", "Well, good luck figuring it out,", "because the clock is tick-tick-tocking.", "- It's that one. - No!", "The dust pattern on top doesn't match its neighbors.", "You see, Jake, I'm always gonna be one step ahead of you.", "You've lost the ability to surprise me.", "Ya just plain boring.", "Again, weird take on a very loving relationship.", "And it's midnight,", "so I guess I'm an amazing human/genius.", "Yeah. Although...", "you might wanna read the inscription on that there belt.", "Why? Oh, no, what does it say?", "\"Amy Santiago, will you marry me?\"", "Surprise.", "I'm so confused... I don't know what's happening right now.", "\"I'm so confused... I don't know what's happening right now,\"", "- title of your sex tape. - \"Oh, my God, I'm shaking.\"", "I'm definitely gonna cry,\" Title of your sex tape.", "Wait, is this really happening? Is this part of the heist?", "If this is part of the heist, I will dump you so hard.", "No, please, Ames, look, it's really happening, okay?", "It's not part of the heist. I promise, this is real.", "- It is? - Yeah.", "Okay, here it goes.", "Ames, I love you.", "I love how smart you are. I love how beautiful you are.", "I love your face, and I love your butt.", "I should've written this down first.", "No, no, it's okay. Go on.", "I love how much you pretend to like \"Die Hard.\"", "- I like the second one. - You don't have to.", "- Okay. - Yeah.", "You're kind, and you're funny,", "and you're the best person I know,", "and the best detective.", "Also, for reals, I love your butt.", "- I love yours too. - Gross.", "Amy Santiago...", "will you marry me?", "Jake Peralta, I will marry you.", "I love you so much.", "Hey, jerkos, this little Tramp escaped,", "so that ought to teach...", "- D-did you just... - Mm-hmm.", "- And did you say... - Mm-hmm.", "- To Jake and Amy. - To Jake and Amy!", "Great stuff, great stuff.", "So, since Peralta altered the cummerbund,", "no one really won the heist this year.", "Is that what everyone's thinking?", "- Captain... - Right, right, sorry.", "Not the time. I'm so happy for you both.", "Technically, there was no winner. Continue.", "Hey, Gina just texted me.", "She said, \"Weird, I didn't even realize they were dating.\"", "JK, so happy for you bitches.\"", "- Oh. - So, Jake, tell us everything.", "- Did you call Amy's dad first? - I actually did.", "Mr. Santiago, I'm calling to inform you", "that I plan to ask your daughter to marry me,", "but since it's 2017, I am not asking you for your permission,", "as she is not your property,", "nor would she be mine, if she chooses to say yes.", "She's a strong independent woman, and she don't need no man.", "That being said, I truly hope she says yes.", "But it's her decision, so just back off!", "Aww, that was perfect. What did he say?", "I have no idea, I left a voicemail. I'm terrified of him.", "Not to talk out of turn,", "but I think I get credit for giving Jake the idea to propose.", "- How's that? - Remember?", "That day in the kitchen.", "So, what I'm saying is,", "vanilla yogurt is good,", "but pair it with a blueberry yogurt,", "and both of them taste even better.", "- Get it? - Yes?", "I did not get it,", "but speaking of yogurt, you've eaten six GPS devices this week.", "You should see a doctor.", "- What? - Hm?", "Look, Sarge, I think everyone knows that", "I planted the idea in Jake's head", "eight years ago.", "Oh, hi, I'm starting today. Detective Santiago.", "Oh, Detective Peralta. Welcome aboard.", "I'm hearing wedding bells.", "Hi, Detective Boyle.", "That actually really slowed things down.", "It took, like, four years for me to forget that memory.", "- Yeah, I'm my own worst enemy. - Look, no one gave me the idea.", "I decided to ask Amy to marry me all on my own on April 28th.", "There's a typo in this crossword puzzle.", "I don't get it. Seems pretty normal.", "I don't know what to tell you. That's just when I knew.", "Romantic epiphanies are dope.", "Thank you, Rosa. They are dope.", "Yes, dope. Congratulations.", "I'm so happy you two are getting married.", "- We're getting married. - We're getting married!", "- And no one won the heist. - Captain!", "Get over it, ya jag!", "Yeah, ya jag!"]