[">I am so sick of this city.", "I go into a coffee shop,", "and as soon as everybody sees", "that I'm a cop, they stop talking", "and they avoid eye contact with me.", "One lady even walked out.", "I am just so tired of being treated", "- like the enemy... - Hey, Hitchcock?", "Your penis is hanging out.", "Oh. Well, that's a relief.", "Play one of the best new FPS shooters, search Steam for PROJECT WARLOCK", "All right, there are seven days until the wedding,", "so we are officially transitioning", "from the \"Month Of\" binder to...", "\"Week Of\" binder. My goodness.", "They're getting bigger. You should see", "the honeymoon binder. Ooh.", "Is there a tab for sex stuff?", "Several. And they're cascading.", "Yeah, they are. Today's our only day off", "before Saturday. We have 24 hours", "to accomplish a week's worth of wedding prep.", "This is what getting married is all about.", "And spending your life with your soul mate.", "Uh-huh. Hey, Rosa,", "why do you have a picture of Sergio Mindar up?", "Facial recognition picked him up at JFK yesterday.", "He finally resurfaced after seven years.", "Who's Sergio Mindar? The bane of my existence.", "- Bane from Batman. - Right?", "Continue.", "He's a ruthless killer who built a meth empire.", "We were tracking him for weeks,", "but he kept getting away.", "Finally, we cornered him in a warehouse.", "Every exist was covered and he just vanished.", "Then he sent us a postcard from Paraguay a year later", "just to taunt us. It was diabolical.", "Yeah, it was full of grammar errors...", "And other taunts that normal people care about.", "That was the first time I was the primary on a case.", "The fact that I let him get away still haunts me.", "He's been in every dream I've had", "for the last seven years.", "Even the one you told me about", "where you're flying on a marshmallow?", "Who do you think was riding", "the jellybean I was chasing? Mindar.", "Well, you won't be haunted any longer", "because we're gonna catch him.", "Rosa, I'm working this case with you.", "Jake, I know we have a ton of wedding stuff to do, but...", "No, no, no. You absolutely have to do this.", "He's your white whale. He's your Johnny Franzia.", "Who? My archnemesis?", "Johnny Franzia? The guy who's been", "tormenting me with a deck of cards for years?", "\"Looks like deuces are wild, Peralta\"?", "Seriously? I feel like I talk", "about him constantly, but it doesn't matter.", "You definitely have to go. I'll handle the wedding stuff.", "Are you sure? It's a lot to get done in one day.", "Absolutely. You work the case,", "and hey, if you guys need any pointers", "on a cool high five or something, I could...", "Well, if you need any suggestions, let me know.", "This all looks fine. Charles, shh.", "I wasn't talking. Shh!", "Olivia Crawford just got off the elevator.", "My rival for the commissionership?", "She's here right now? I've got to come up", "with a confident opening salvo.", "Think, Raymond. Think.", "Hello, Raymond. Olivia.", "You have a little bit of...", "Goop in your eye.", "Oh, thank you.", "I'm sorry to barge in like this,", "but I have a source on the nominating committee.", "They're making their recommendation", "to the mayor at the end of next week,", "and it seems that John Kelly", "is going to beat out both of us.", "Big shocker.", "The straight white man wins again.", "Exactly. Amen.", "That was my complaint", "about Owen winning Top Chef Jr", "and you guys all acted like I was crazy.", "Half of the committee supports John Kelly,", "and the other half is divided between the two of us.", "We're splitting the vote. So for either of us", "to have a chance, one of us needs to step aside.", "Exactly. You should drop out.", "Is what you said to yourself", "in the mirror this morning", "instead of checking your eye for goop.", "And I agree. You should drop out.", "Is what you said to yourself in the mirror", "this morning while polishing your head.", "Don't you think it's time New York had", "its first female commissioner?", "What about its first openly gay commissioner?", "Yes, that would be vital and important", "if you weren't one million years old.", "You do know that exaggeration is the huckster's crutch?", "Also, I come off quite youthful.", "You just said \"huckster's crutch.\"", "Step aside... Grandpa.", "Hey, hey, Sarge.", "Large and in charge like El DeBarge.", "Quick \"quesht\".", "How would you like to spend your day off with me", "doing an endless list of wedding tasks?", "I can see from your eyes you're excited.", "No way. Sharon and the girls are going", "on a playdate all day and I'm going to see a movie", "for grown-ups. No talking animals", "and tons of cuss words.", "I know cuss words. Come with me and I'll cuss", "at you all day long, you big piece of crap.", "Yeah, that sounds fun, but I'm gonna", "stick with the movie. No, no, no.", "Please don't do that. Look...", "I promised Amy I could get everything done,", "and I definitely can't. Breaking promises is how", "marriages end, not how they start!", "What is that? I have 143 tasks", "to get through in the next 12 hours.", "I set a recurring alarm so I know how fast", "I should be moving. Well, how's that going?", "Not well. I'm already three tasks behind", "and the alarms keep piling up. It's kind of making me feel", "a little bit stressed out. Please help me, Sarge.", "Please. Come on, you're, like,", "the best husband ever.", "You're like the Tiger Woods of being a husband.", "What he was to golf, not what he was to being a husband.", "Terry's husband game is flawless.", "Okay, I'm in... But you owe me. Yes!", "Anything you want. Now, let's roll out,", "you friggin' dick!", "Wait, you don't have to cuss at me, man.", "No, it's too late. It's already locked in.", "God, looking at these old files", "is really bringing back some memories.", "Sergio's evil voice, his stupid face...", "His delicious aroma.", "Man, I hated how good he smelled.", "I know. That jerk smelled like an English garden.", "He almost made me quit the force, but my God,", "I could breathe him in for days.", "Why do you think he came back?", "According to this picture from JFK,", "he's taking the bus, so I'm guessing", "he's out of money in Paraguay. Right.", "Didn't his number two say he had to leave a bunch", "of his cash behind before he fled?", "Hey, look at this.", "Sergio's getting on the B15. That goes to Bed-Stuy", "via Garvey Avenue, where he had", "a hideout in an old brownstone.", "I don't know. You think he's dumb enough", "to go back there? Yeah, I do.", "You know why?", "'Cause he forgot who was on his tail.", "Nope, he remembered.", "And he used the wrong \"you're\"", "and the wrong \"too\"! Son of a bitch!", "Ugh! Damn it, he still smells great.", "How is this guy always one step ahead of us?", "God, I hate him!", "- Ow! My noggin! - Oh, no.", "It's happening again.", "This is exactly like last time.", "No, it's not. What makes you say that?", "God, I hate him!", "Ow! My noggin!", "Okay, fine. But not everything is the same.", "Honestly, the only thing that's different is Hitchcock's hair.", "Ow! My noggin!", "How dare you, Diaz?", "Oh, I miss that toupee. You know it was a reversible?", "No, you know what else is different?", "We're better cops now. Look, Sergio knew", "that we knew about that hideout.", "It was listed in his original arrest warrant.", "Right. We need to find a connection", "to him that he doesn't know that we know about.", "Wait.", "What about his grandmother?", "She was the last person he visited", "before he fled. I don't know.", "I'm just not sure we'll be able to get", "some old bag to squeal on her grandson.", "Clearly, you've never seen me with the elderly.", "They love me.", "I can talk about coupons for days, son.", "That's right, you're looking at a senior queen.", "What is that? That's not a widely-used term.", "Jake, you gotta pick a napkin.", "The binder said they should be beige.", "I didn't realize there'd be 45 different shades.", "\"Chanterelle,\" \"desert whimsy,\" \"filbert husk\"?", "Words have no more meaning, Terry.", "We're running out of time, man.", "You gotta make a call. But what if I choose wrong?", "That's a terrible way to start off a marriage.", "People won't even watch our first dance.", "They're gonna be too busy laughing at the napkins.", "Okay. Maybe I can narrow it down.", "Uh, I think I don't like desert whimsy.", "Okay. Why did you pause like that", "before you said \"okay\"? Was that secretly", "your favorite one? Look, you know Amy", "better than anyone. You just have to", "trust your gut. What is your gut telling you?", "That I'm a terrible napkin chooser", "and will therefore be a horrible spouse.", "That is not your gut. That is your crazy,", "nonsense brain. Trust me, Jake.", "You know the right napkin. Is it this one?", "With that crimping? No way.", "Oh, my God, what did I just do?", "You listened to your gut!", "Yes! I have a gut! My groom gut!", "Every groom has one. You just had to find yours.", "Okay, I can do this. Uh, this one's too big.", "This is too scratchy. This one is shedding.", "This one's too rustic. Am I using that term right?", "Yes, you're doing it! It is too rustic!", "This one. Classy, but very absorbent.", "Simple, and it won't clash with our color scheme.", "It's perfect! We'll take it!", "Groom gut! Groom gut!", "Did you hear anything from Olivia?", "She's not gonna step down, and neither am I.", "We're at an impasse. Okay.", "Well, Gina and I have been discussing the situation", "and we think we know what you need to do.", "Oh? What is that? Whisper campaign.", "It's the best way to bring down an enemy", "if you don't wanna get your hands dirty.", "How do you think I stole the cheese club presidency", "away from Bruce? Whisper.", "I heard he thought Camembert", "was goat cheese.", "And how do you think I got Janet", "and her horrible daughter Dakota to drop out", "of baby bongos class? Whispers.", "I heard Dakota has foot and mouth disease.", "Sir, you have to give us permission to do this.", "Weaponize our sweet little mouths.", "Ugh, how are we on the same side of this?", "This is not a strategy I'd normally entertain,", "however, challenging Olivia publicly", "is out of the question, so what do you have in mind?", "Whispers. Yes, I know,", "but what specifically are the words", "that you would be whispering?", "She lied on her resume.", "She's a shoplifter. She planted evidence.", "She seduced a priest. She pads her stats.", "She's sort of stanky, I heard.", "No, no. I wanna be commissioner", "of the NYPD, but I want to achieve it honorably.", "There has to be another way.", "There isn't.", "Whispers.", "So Louise Mindar is right over there, officers.", "Oh, please don't call us that.", "We're undercover. Yeah, we're pretending", "we like old people and don't think they're gross.", "Some of us aren't pretending.", "I think the elderly are treasures to society.", "Actually, from experience, she is more right.", "You definitely shouldn't be working here,", "but thank you for your help.", "All right, Rosa, time for some senior seduction.", "Hello, Mrs. Mindar. We're from Sunset for Seniors,", "and we're here to brighten your day.", "Where's my regular girl? Oh, she's sick.", "Appendicitis.", "Oh, Frank's niece just had that.", "- Hi, I'm Eunice. - Hi, Eunice.", "We're talking to Louise. Oh...", "So, I have a really fun activity for today.", "- We are going to... - You know what?", "I was wrong. Frank's niece had a botched uterus.", "Thank you for that visual, Eunice.", "I thought we could do an oral history project", "on your family. Wouldn't that be a hoot?", "Oh, I guess so.", "Well, I was born during the Depression,", "and I had to sleep in a dresser drawer till I was three.", "Yeah, this is more of a recent history.", "Like, in the last week or so, have you had any visits", "from family? I don't have any relatives,", "except for my grandson,", "who I haven't seen in seven years.", "Thank you for reminding me of that.", "Yeah, we all have family problems.", "The question is, are you going to see him soon?", "How do I know? He never calls me.", "My turn. I was born in the Depression too,", "but we were extremely rich.", "We had a chambermaid. Not now, Eunice.", "Okay, so we are way behind.", "Picking out napkins took up a shockingly large part", "of the day, which is funny, because in my regular life,", "I don't use napkins ever. That's gross,", "but the good news is, your groom gut is all fired up.", "She sure is, and she's hungry for tasks.", "Your groom gut is a woman? Yeah, why?", "I think it's really cool. Oh, thanks!", "All right, let's crush this list.", "Calla lilies? Do you think I'm planning", "a funeral? I want dahlias.", "No, no, no. Brown sprinkles", "at the ice cream bar?", "Do you think I'm planning a funeral?", "Give me rainbow!", "Mini lamb shanks?", "Do you think I'm planning a funeral?", "Swap 'em out for some tiny tuna tacos.", "Why do you keep saying the funeral thing?", "Because my groom gut has a catchphrase.", "Doy.", "Hey, Sarge, look at this!", "I cleared all my alarms. We're amazing!", "Should we start a business where we just become", "professional choosers? We could call it...", "\"Pro-Choice Industries.\" Jake?", "You're right. That name is needlessly political,", "but the business idea is solid. No,", "I'm not talking about that. All those decisions you made?", "You are way over budget.", "Oh, no. My groom gut is a fancy bitch.", "Well, our only lead turned to crap.", "Let me go back in there. I just need a little more time", "with Louise. Did you see Eunice?", "She was practically humping my leg.", "No, dude, it's over. We lost Sergio.", "Oh, God, I just wanna crush something.", "Look, we will find him. No, we won't.", "I thought I was a better cop than I was seven years ago,", "but I'm not. I'm still the same loser", "who lost him back then. Stupid loser!", "That's very wasteful.", "Thank you for your wisdom. Greatest generation.", "Look, you didn't lose him back then.", "Yes, I did. I had him cornered", "and I lost him. No. I lost him.", "I'm the one who let him get away the first time.", "What? When we had him cornered", "in that warehouse, you told me to cover the back.", "I thought I heard something on the roof and I left my post.", "You always wondered how he got away?", "I let him. It was my fault.", "And I never told you. Seriously?", "Hey, Louise Mindar has been signed out of the building", "for a therapy appointment, but she doesn't do therapy", "and hasn't left the premises in years.", "Oh, my God, she must be going to see Sergio.", "Maybe. Definitely!", "Rosa, we have a lead! We finally have a lead!", "Whatever. I'm not talking to you.", "Let's go.", "That seems like a good thing. Why isn't she happier?", "There's a lot going on that I can't explain, Ezra!", "But thank you. Seriously, you saved the day.", "Look at us.", "Following an old lady,", "about to catch our white whale.", "Ah, just another exciting day for the sleuth sisters.", "That's a name I just came up with.", "If you like it, stay silent.", "Good, I like it too. That's our name forever.", "Oh, that's weird.", "The nursing home's calling me. Hello?", "He//o, this is Eunice,", "the lady from the home with the chambermaid.", "Yes. I mentioned Frank's niece's", "botched uterus. We know who you are, Eunice.", "What can I help you with? You said to call you", "if I saw anything peculiar. Mmm-hmm?", "There's a very strange man in Louise's room,", "digging around while she's away.", "/sn't that peculiar? Can I put you on hold?", "/s there music?", "//ove the mu...", "I bet that's Sergio.", "I bet he set up this whole Louise thing", "as a distraction to get us out of the nursing home", "because that's where he stashed his cash", "before he went to Paraguay.", "Damn it, I wish there was some way to know", "if that peculiar man was Sergio.", "Eunice, what did the man smell like?", "Like an English garden.", "Okay, I have a plan to get us back on budget.", "I got my groom gut to agree to a more basic wine package.", "Basic meaning simple, or basic meaning \"basic\"?", "Basic meaning \"basic,\" Terry.", "We're drinking the wine with the foot on the label,", "but it's a huge savings and we can make up the rest", "if we just assemble the gift bags ourselves.", "Okay, we can do that.", "How much work can that possibly be?", "Here are Amy's instructions.", "\"Place eight Jordan almonds, two pink, two blue,", "\"two white, and two purple at the center", "\"of the organza square. Draw the corners to a point", "\"and use the two-centimeter ribbon", "\"to cinch into a mini-bag.\" Good Lord.", "That doesn't sound so bad. That's step one... Of 38.", "We don't have time for that! We need help.", "We need to hire a team. I know,", "but there's no money in the budget.", "Unless... Maybe we could find people", "that were willing to work for something other than money.", "Hey, Hitchcock and Scully! How would you two like", "to earn some candy almonds?", "You got our attention.", "Water bottle. Nut assortment.", "Local jam. Jake and Amy cookie.", "Cone of pretzels. Jordan almonds, and...", "Aspirin for the morning after.", "Cake pops. And cinch and...", "Done. Blink.", "Mmm. Block.", "Sir, Olivia Crawford is on her way up.", "I know. I invited her.", "Did you change your mind about the whispering?", "'Cause we came up with some dandies.", "I heard she's a day drinker.", "I heard she doesn't like me.", "I actually did hear that. Officer Thomas told me.", "I told you I wouldn't be doing that.", "I've come up with a different plan", "and I've implemented it. Raymond.", "Hello.", "You have goop in your eye. No, I don't.", "I rinsed my eyes before you arrived.", "Fine. What's this about?", "I wanted to let you know that I've thought it over,", "and I've been acting selfishly.", "I wasn't considering what's best for this city.", "That's why, before you got here,", "I sent a letter withdrawing my name", "from the commissioner's race. What?", "No! You're young and smart", "and progressive and a hell of a lot better", "than John Kelly. I've been waiting", "my entire career for a commissioner like you.", "Captain... If I have to be", "the bigger person to open the doors to change, then...", "I also felt bad.", "And I also sent in a letter", "withdrawing my name from contention.", "We just made John Kelly commissioner.", "Not if we get those letters back before anyone reads them.", "Are you too old to run? Are you too inexperienced", "to know that power-walking is a far more efficient", "and sustainable method of hurrying?", "Burn.", "Wow!", "We're actually gonna get these gift bags", "to the venue before they close. Thank you, Terry.", "Don't thank me.", "Hitchcock and Scully did more than I did.", "Yeah, but you had to hold your hand near their mouths", "when you fed them those almonds.", "And that's scary. We're like snapping turtles.", "Exactly. All right, let's get going.", "Those chocolates are gonna melt.", "Oop. Open up.", "I gave you the keys. Oh, right.", "Um... Oh, no. Where did I put them?", "Let's see. I had them in my left hand,", "and then I went to open the trunk,", "so I switched to my right hand.", "Oh, but then I had to sneeze, and I thought,", "\"I don't want to sneeze on these keys.\"", "Dr. Seuss. Not really, but should be.", "Do not sneeze on my keys. Do not wheeze on my keys.", "Do not sneeze on your knees on my keys, if you please.", "Jake, could you please move along on this thought journey?", "Yeah, right, sorry. Okay, so then I put them", "on top of a plastic tub, which is...", "Locked inside the car.", "The keys are locked inside the car!", "Why?", "He's gone. Look at the vent.", "We were right. He came back for the cash.", "Hi, it's Eunice, the lady with the chambermaid.", "Yes, Eunice, we know who you are.", "That man is in the hall right now.", "- What? - Ooh.", "He's heading for the back exit!", "Look! There's Sergio.", "Damn it! He's getting away again.", "Not this time, partner. See you on the ground.", "What? You're mine, Sergio!", "Ow!", "Did he get away?", "Yes. Very easily.", "What the hell were you thinking?", "You're lucky you just dislocated your knee.", "How do you know it's dislocated?", "I went to med school for three years.", "You did? When? That's not the point!", "Why did you jump off the building?", "I was trying to make up", "for letting him get away seven years ago.", "What? I don't care about that.", "You had an instinct. You followed it", "and you were wrong. That happens to everybody.", "I care that you lied to me.", "It's just...", "We didn't know each other well back then,", "and, to be honest, when I first got to the Nine-Nine,", "I was a little intimidated by you.", "Good. Go on.", "And then it got more and more awkward to bring up,", "so I never did.", "I just hoped that we'd catch him eventually", "and you'd never be tipped off to the fact that I let him go.", "Oh!", "What are you doing with your face and your voice?", "I had an epiphany and I got real excited.", "I moved my knee and now I hurt a-real bad.", "Okay, breathe through the pain", "and tell me what you figured out.", "Someone tipped off Sergio", "that the cops were visiting his grandmother,", "and there was only one person that knew we were cops.", "That nurse who hates old people, Ezra.", "Of course. Never leave your money unprotected.", "That's the first thing I learned in business school.", "You also went to business school?", "Yeah, and I also have a pilot's license. Whatever.", "Point is, now we have a link to Sergio,", "so let's go get him. So we're good?", "You're not mad at me anymore?", "No. You're about to be real mad at me.", "For what? 'Cause I'm gonna reset your knee.", "Look at the bunny. Huh?", "Ahhh!", "I called the locksmith. He said an hour. That means two hours minimum.", "We can't wait that long. Our little cookie faces are already melting.", "We look like a couple of Slimers.", "Yeah, those cookies are definitely ruined.", "I'll take them off your hands. You're a good person, Scully.", "This is crazy.", "Why don't you have a backup key, Terry?", "The dealer tried charging me an extra $300 for it.", "I told him I didn't want it", "because Terry never loses his keys.", "Yeah, but Jake does. You always have to plan", "around me. I'm a part of your life.", "All right, look. We only have one option left.", "You're gonna have to pick up the car and carry it to the venue.", "Well, how will we get the bags out?", "Is that seriously your only problem", "with what I just said? Pretty much.", "This was a test. These tasks were a way", "for me to prove I was gonna be a good husband,", "and I failed! Jake,", "being a good husband doesn't mean you have to pass some test", "or do everything right. Do you have any idea", "how often I mess things up?", "So you're a bad husband too? No.", "Definitely not. You're cutting in too soon", "before the point. Sorry.", "Look, being a good husband is about caring enough to try.", "This whole day, you've been doing", "everything possible to make sure Amy was happy.", "You keep doing that, you gonna be okay,", "even if you make some mistakes.", "You're right.", "Thanks, Terry.", "Hiyah!", "What the hell? My van!", "What are you doing?", "Whatever it takes to make Amy happy.", "You told me to do this. Now, let's get these gift bags", "to the venue!", "Oh, my God! Why did you do that?", "Because I care! Oh, it feels so good.", "Why'd you break a second window, fool?", "You know, you're really stepping on my moment here, Terry.", "I love Amy Santiago!", "We're gonna take each other's names!", "Let's go!", "- Boyle, watch the door. - Watch the door.", "That's the job they always give the coolest guy in the heist.", "Everyone else, dig in. We're looking for any letter", "addressed to Deputy Commissioner Stevenson.", "Are we even sure they're here?", "I messengered mine over. There are only three", "building-wide distributions a day.", "The next one isn't until 6:00 p.m., so we still have 22 minutes.", "What are we looking for? Can you describe the envelope?", "It was a white #10. It's the same kind you use", "to send fan mail to yourself.", "I've never done that, but I do know what envelopes", "my fans use, so that's very helpful.", "Is this it?", "Yes! Well done, Olivia.", "Okay, tear that up,", "and now we just have to find your letter.", "What are the dimensions of your envelope?", "Zero by zero.", "It's too late for me.", "I withdrew from the race by e-mail.", "What? Yes, I use e-mail", "because I'm not a million years old.", "Listen, the only reason why I even made it this far", "is because you stood up for me to the selection committee.", "I came here to make sure that at least one of us", "stays in the running. Someone has to beat John Kelly.", "So you better get that damn job.", "'Cause I'm excited to have you as my commissioner.", "Thank you, Olivia.", "And I'll be excited for you to be commissioner after me.", "That'll probably be in a matter of months,", "once you die from old age.", "Go get 'em, Grandpa.", "Nurse Ezra, hey. Do you have a minute?", "I'm actually kind of busy right now.", "Right, harboring a fugitive. Should I come back, or...", "He's here and on the move!", "All right, Sergio.", "We've been waiting seven years to say this.", "Sergio Mindar, you're under arrest.", "That's Y-O-U, apostrophe, R-E.", "I can't believe you caught me.", "Well, believe it. We're an amazing team.", "We're the sleuth sisters. Damn straight, we are.", "Lame. Stay out of it, Sergio!"]