[">- So, I got assigned to this one rookie,", "and on his training day,", "I made him smoke angel dust at gunpoint.", "King Kong ain't got nothing on me.", "- Isn't that the plot and tagline of--", "- The movie \"Training Day\"? Yes, great observation, Tank.", "That's because it's based on my life.", "- Lunch is over. Bus your trays.", "Now, Peralta. - I haven't finished", "my lemon cookie, bull. - And you're not gonna get to,", "either. Give it to me.", "- Oh, you want the cookie?", "prisoners: Oh! - There's your cookie.", "- You're going in the hole. - Oh, I'm going in the hole?", "- Yeah. - Yeah, bring it on!", "prisoners: [chanting] Jake, Jake, Jake, Jake!", "- Remember what you saw here today!", "You can lock me up,", "but one day I'll get out of here,", "and I'll come for you! I'll come for all of you!", "Hey, Warden. What's up?", "- Next time, don't wait so long", "to spit the cookie. I've been waiting", "in here for four minutes, and it's gross.", "- Yeah, it really is. - Okay, snitch time.", "What's up with Romero? - All right, he's got", "a \"delivery\" coming in on Wednesday night.", "One of the cafeteria workers is smuggling something in", "with the produce. - [laughs] Great.", "See you Thursday. - Wait, what?", "You're just gonna leave me in here, in solitary?", "- You spit in a guard's face. That's five days in the hole.", "- Yeah, but, I mean, you made me do that.", "- Well, we don't want anybody getting suspicious, huh?", "Have fun. [knocking]", "Try not to go crazy.", "[door slams shut]", "- Okay. No big deal.", "Five days is nothing. I'm not afraid to be alone", "with my thoughts. My thoughts are awesome.", "\"Die Hard 6\" on a cruise ship, pizza bagel restaurant,", "my father never loved me, I'm gonna die alone--oh, boy,", "that happened fast. Guard? Guard!", "[upbeat music]", "*", "- A 300 call number in the fine arts section?", "What is this, Beirut?", "- You know, you don't work here.", "You don't have to reshelve the books.", "- [snidely] Well, someone has to.", "I'm so sorry. I'm just really stressed out.", "You're a great librarian, and I'm sure you're not the one", "who shelved this section. - I am.", "- God, Debbie, what is going on with you?", "[sighs]", "[object thuds]", "Debbie? Is that you?", "Are you mad? Because I think", "I've been more than fair.", "- Hello, Detective Santiago.", "Ah, no need for the gun. I'm not here to hurt you.", "My name is Seamus Murphy.", "- Yeah, I know who you are. Every cop in the city does.", "What do you want, Seamus? - To help.", "I know your boyfriend got framed.", "Maybe I could give you the proof you need", "to take down the cop that set him up.", "- You have something on Hawkins?", "- She's about to move 5-million dollars' worth", "of stolen diamonds-- stones that tie her", "to the robberies. I could tell you", "how to find them. - Why would you do that?", "- 'Cause I wanna be friends. I do you a favor,", "and one day, you do me a favor.", "I don't know. Think about it.", "But don't think too hard, huh?", "You only got three days.", "- [whispering] Forgive me, books.", "Oh, God.", "- So, how was your first stint in solitary?", "- [scoffs] It was nothing. I held it together.", "Oh...Amy.", "When'd you get here?", "You've come for my conjugal capabilities.", "You're looking real good, girl.", "[mashed potatoes plop] Whoa, lost a booby.", "No matter. I'll just build another one.", "More mashed potatoes!", "So, what happened with that sweet intel I gave you?", "- Your tip was garbage. We busted Romero's delivery.", "Get this--nothing but toothbrushes,", "shampoo, and soap. - Ooh, lemon verbena.", "Can I keep this? - Yes, you should--you reek.", "- 'Cause you put me in the hole.", "- Have you ever heard of Blizz? - Yeah, the drug, right?", "- Uh-huh. And thanks to your pal Romero,", "it's taking over the prison. I need you to find out", "where he keeps his stash. - [snorts] Well,", "I doubt he would tell me that. I'm not exactly", "in the inner circle. - Maybe you just need", "some extra incentive. Find the stash,", "or I'll tell everybody you're a snitch.", "- What? No. They'll kill me.", "You don't want that, right? It'd probably be a lot of", "paperwork for you. - Oh, it's not.", "It's just one form, and it's already filled out.", "We just have to staple a picture of your corpse to it.", "- Great. Prison...is great.", "[phones ringing, staff chatting indistinctly]", "- He said I have three days to decide.", "- We should tread lightly. Seamus Murphy is the head", "of the most brutal crime family in New York.", "- This is bad. This is really, really bad.", "- Are you concerned about Seamus Murphy,", "Detective Scully, or were you having trouble", "with the jumble? - Oh--the first one.", "- Murphy didn't ask me to do anything illegal.", "He just wants me to owe him a favor.", "- Right, but we don't want to be indebted", "to a man like this. - I understand,", "but we've been watching Hawkins for a month,", "and we have nothing to connect her to the robberies.", "Maybe we should pursue other routes.", "- Um, some of us are already pursuing other routes, Amy.", "This is Charles Boyle, and you're listening to", "\"Detective Peralta: A God in Shackles.\"", "But first: this podcast is brought to you by Fun Frames--", "make your spectacles a spectacle.", "- And how is your podcast supposed to", "get Jake out of prison?", "- I lay out the facts,", "people see he was framed.", "I build an audience. I get a celebrity listener.", "It's Debra Messing. She tweets a link.", "Now Sean Hayes is involved. - Boyle, that's enough.", "- I know dealing with a criminal is bad news,", "but I can't just let Jake sit in prison.", "- Okay, maybe we can figure out what Murphy knows", "without taking his deal. He says that Hawkins is", "moving the diamonds in three days.", "That's a new lead. Let's work it", "instead of putting your career in jeopardy.", "- Okay, let's give it a shot. - [giggling] Whoo-hoo!", "That was also not about the jumble.", "We're all excited about the same thing.", "[purposeful tune]", "- [as Batman] Did you miss me?", "[normally] Oh, my God!", "It's Jake! Don't kill me!", "I was just doing Batman! - What's wrong with you?", "Never sneak up on me.", "I was sharpening my shiv. - Right, I'm sorry.", "It's prison. I forgot.", "- What's up? I'm busy, bitch.", "- Well, all that time in the hole kind of", "got me thinking: I'm clearly gonna be here for a while.", "I wanna live my best prison life, and for me,", "that means doing more for the gang.", "Now I was thinking, specifically, I'd be great", "in and around the world of drugs,", "because, let's be honest: I'm not great at murder.", "What do you think? - Nah, that's okay.", "I don't need any help. - Totally, totally.", "You're great at what you do. You don't need me.", "But, maybe... I could learn from you.", "You know? Sort of shadow you for a while", "and see how your operation runs.", "Go from bitch to boss, as it were.", "- Jake, you stop pushing it.", "You're gonna make me think you're a snitch.", "And you know what I do to snitches?", "- Give them a public dressing down?", "- Castrate them. - [inhales sharply]", "- And then I kick 'em to death.", "- Cool--cool, specific policy. Love the attitude, love you,", "love all of this--okay, see you", "in the mess hall, Romero. Bye, Romero.", "- Hey, I'm in a bind. I need your help.", "- That's what friends are for. - Well, \"friends\" might be", "a bit of a stretch. I mean, you're a cannibal", "that ate six people. - 9 1/2.", "- Yup, worse. All right, here are my options:", "A, I keep pestering Romero to tell me where the drugs are,", "he realizes I'm a snitch, then he castrates me", "and kicks me to death. - That's not great.", "What's option B? - I back off Romero, never find", "out where the drugs are, the warden tells everyone", "I'm a snitch, and then Romero castrates me", "and kicks me to death. - Mm, both options sound...", "- A little castrate-y? Yeah, that's what I keep", "bumping up against too. - Well, you know, whenever", "I'm backed into a corner, I just do what I do best:", "I drive across country, forge a new identity,", "and then take a job as a camp counselor.", "- Oh, my God. Caleb, you're a genius.", "- I wouldn't say genius. That camp ran", "a pretty extensive background check.", "- No, not that--your past is a straight-up nightmare,", "but I need to do \"what I do best\":", "be a cop, work the case,", "figure out where the drugs are on my own.", "- And you tell the warden, and the warden will", "bust Romero. - And Romero won't think", "I'm a snitch, because he never told me where they are.", "All right, this is gonna be tough.", "I'm really gonna have to thread the needle.", "- Ooh! I got really good at threading needles.", "- Back when you were making your skin suit, I know.", "Look, I like being friends with you, but you have to", "stop bringing that up. - But we're friends?", "- [stammers]", "- Moving $5 million in diamonds", "is not an everyday activity,", "so Hawkins must be altering her behavior.", "- She's not. I've been tailing her for days.", "- Scully and I went out to Flaxton Hill Farms", "to watch the guy who testified for Hawkins.", "All he does is feed his pigs.", "- They eat seven or eight meals a day--", "sometimes by force. They're living the dream.", "- You know they get slaughtered.", "- Worth it. - Hey, I think", "I found something interesting. I was double-checking", "last month's surveillance photos,", "and I noticed this.", "Hawkins has two different phones:", "her normal cell, and then this one", "that only has one app on the home screen--Snapchat.", "- Oh, she's up to something. Snapchat messages disappear.", "You can send anything to anybody,", "and after they see it, it's like I never sent it.", "- Nobody ask Hitchcock why he knows that.", "- Could we put a mirroring app on her phone", "so we could watch everything she does?", "- Oh, those work great, but you have to physically", "have her phone to install it.", "- Nobody ask Hitchcock why he knows that.", "- I know how we can get Hawkins' phone.", "We get her to visit prison.", "They make you leave your phone in your car.", "I wanted to record Jake for the podcast,", "but they said I couldn't. I had to have Terry on", "as a guest. - I gave up my Saturday", "for that. You said I did great.", "- I'm the host. I have to say that.", "- So, all we need to do is get", "Hawkins to visit someone in prison.", "- No, absolutely not. What would I even say to her?", "- Well, perhaps you could ask her to put in", "a good word for you with the warden,", "so you can get extra yard time. - So, you want me to beg", "the woman I hate for mercy. Cool.", "Oh, one problem. How do I stop myself", "from smashing through the glass and squeezing", "the life out of her with my bare hands?", "- Maybe you could just imagine doing that.", "It'd be probably just as fun as actually doing it, right?", "- No. - I'm with Diaz.", "Imagination is never the solution.", "We just need three minutes to get inside her car", "and install the app.", "- Okay. I can grovel for three minutes.", "But one second more-- - Yes, yes, we know.", "You burst through the glass and squeeze the life out of her", "with your bare hands. Well...I think we have a plan.", "[buzzer sounds]", "- Don't let them see us. Blend in.", "- I gotta tell you, cop work is a lot like cannibal work.", "- Really? - Oh, yeah.", "The watching...", "the following...", "The waiting for soccer practice to end.", "- Come on, man.", "- Did you see that? Romero just went", "into the showers for the second time today.", "- Well, maybe he just likes to relax.", "- No one is relaxed in a prison shower.", "It's literally the most tense situation", "I've ever been in.", "What's he doing in there?", "That must be where he stashes the Blizz.", "Unless he's just having sex-- no, but he's a huge homophobe.", "It's where he stashes the Blizz.", "But...all homophobes are secretly gay.", "You know what? It doesn't matter.", "We'll check it out later,", "when he's done.", "- Hawkins must be through security by now.", "Rosa promised us three minutes, tops.", "We'll get the phone. Captain Holt,", "can you distract the lot attendant?", "- I'm not Captain Holt.", "I'm Joe Wozniak,", "here to see my girl in prison.", "And, to help me pass as a straight...", "Kevin's rose-shearing hat.", "[tense music]", "*", "- Little Rosa Diaz.", "So, I hear you want me to put in a good word for you", "with the warden?", "- Yes.", "- \"Yes,\" what?", "- Yes...please.", "- I love this. This is so much fun for me.", "- Can I help you? - I'm just trying", "to work up the nerve to see her.", "- See who? - My female wife, Crystal.", "I was cheating on her with a waitress from Wing Sluts", "named Jamie-Lynn. One night,", "when I was...philandering, Crystal caught me", "kissing Jamie-Lynn's... heavy breasts.", "She flew into a rage, and now she's serving", "five years for aggravated assault.", "- Hey, I'm sorry to hear that. - Yeah, thanks, man.", "Hey. Bring it in?", "Oh... [inhales deeply]", "- That's the signal. Go!", "- [sighs happily]", "- Oh, the phone!", "*", "- Pretty please? - More.", "- With sugar on top? - More.", "- You should've seen Jamie-Lynn.", "She looked exactly like", "\"Maxim\" Hot 100 honoree Jasmine Sanders.", "- 35 seconds on the download.", "- It just seems like you wanna be with Jamie-Lynn.", "I mean, you keep talking about her thigh gap.", "- That's my favorite part of a woman.", "There's nothing more intoxicating", "than the clear absence of a penis.", "But, you're right. I need to forget about Crystal.", "Thanks for the advice.", "I'm off to... plow my mistress.", "- More.", "- Time's up.", "[rock music]", "*", "[both shouting, grunting]", "- Diaz.", "Hello? Diaz!", "You don't even beg well. Have fun rotting in prison.", "[receiver slams] - Okay.", "Thanks for coming in.", "- So, you really think this is where", "Romero's stashing the drugs?", "- I mean, it's a good idea. There's no cameras in here.", "What does Blizz look like? - Like little white candies.", "- Oh, I love candies--many say, to the point that", "it'll eventually kill me.", "Hey, I found something.", "Oh, twinsies.", "What is this? A melon baller?", "Wait a minute.", "Romero doesn't stash the drugs in here.", "He comes in here to make the Blizz balls.", "- So, he brings a brick of drugs into the shower", "without getting noticed? - Yeah...", "Oh, my God.", "He smuggles the Blizz into the prison in--", "- The soap dish. - No, in the soap.", "It's in the soap. - Oh, yeah!", "That's much better. I get it.", "- I did it! I cracked the case!", "Hey, you don't think you can get high", "from rubbing drugs on, like, your eyes and armpits", "and up under your b-parts, can you?", "Whoop, you definitely can. Here it comes.", "Whoa-oh-oh, Caleb!", "- And you know what else I think--are you listening?", "Huh? Are you, Mr. Warden? I think we should be able", "to decorate our own cells, don't you? I mean, choose", "our own wallpaper, laminated flooring,", "crown molding--my friend Charles loves crown molding.", "He says if it doesn't have the crown,", "you have to vote it down. - Are you on drugs?", "- Yes, and you should too, you know? Get on my level.", "Because quite frankly, we're not on the same wavelength,", "At agg--at agg, at agg.", "That's weird, I can't say the word \"agg\" anymore.", "- Yup, you've done a ton of Blizz.", "- Yes, Blizz! That's why I'm here.", "Wait, why am I here?", "- Blizz. - Yes! Romero is smuggling", "the Blizz into the prison as bars of soap.", "- Interesting. Hey, that's good work.", "- I know! I am the smartest man", "of agg time! \"Agg time.\"", "Agg time!", "Agg time! That was it.", "[door slams, Jake yelps]", "Oh, man, I have a lot of energy.", "Wait, no--I'm exhausted.", "I wonder if I can touch the ceiling.", "[grunting]", "- Peralta. - [gasps softly]", "- Rombargo.", "- Where were you with that guard?", "- Great question.", "- [huffs] When is Hawkins gonna unlock her phone?", "We've been staring at her stupid face", "for 14 hours. - I don't mind.", "- This is a dead end. Maybe I should call", "Seamus Murphy before it's too late.", "- I thought we agreed that's a bad idea.", "- What other options do we have?", "- There is still the podcast.", "- Guys, she unlocked the phone.", "She's in the app and she's typing.", "\"Diamond emoji in locker 805.", "Bus station, Linden, NJ. Pickup 5:15.\"", "- We have one hour. Let's move.", "- Answer the question.", "Why were you coming out of the admin wing", "with a guard? - Um...", "Okay, Jake! Don't freak out.", "Just stay calm. You're on a crazy amount", "of Blizz, but your brain still works.", "The warden was yelling at me.", "- Are you on Blizz? - What?", "[chuckles] What makes you think that?", "- 'Cause you just told us.", "- Okay, Jake.", "Don't freak out. Just stay calm.", "You're on a crazy amount of Blizz,", "but your brain still works.", "Yep, I am nips-deep in Blizz.", "- Nice. [laughs]", "I was worried you were still a cop,", "but what kind of cop does that much meth? [laughs]", "- Well, no, no, not meth. Blizz.", "- Yeah, that's meth. We just call it Blizz", "'cause meth has a bit of an image problem.", "- Oh! Oh, my God,", "I guess I'm addicted to meth.", "No, I'm not. I just love it", "and I am consumed with the thought", "of doing it again.", "- So, now I know I can trust you, huh?", "I can tell you how I smuggle in the Blizz.", "- Oh, no, no, no. You don't have to tell me that.", "I don't even wanna know. - As bars of soap.", "- [sighing] Oh.", "Smart. - Congratulations.", "You're one of only two people who know.", "- Ah...that's great.", "Glad to be part of such an elite group.", "You know what?", "I think my Blizz is wearing off.", "I should probably go lie down. - Yeah.", "The diarrhea's coming. That is very common.", "Don't let the volume scare you.", "- Wait.", "Volume as in noise or amount?", "Oh, God, it's both, isn't it? [inhales sharply]", "- Okay, I've got eyes on locker 805.", "- I'm within sight of both exits.", "- Copy that. It's almost five.", "Where's Boyle? - Shalom, Amy.", "- Charles, what are you doing?", "- Taking this undercover mission seriously.", "Seems like I'm the only one. - It's a bus station.", "We don't need disguises. Anyone can be here.", "- [scoffs] Typical shiksa.", "- I see movement at the locker.", "He's opening 805! Let's go!", "- NYPD! Get down!", "- Down! - Drop your bag.", "[exciting music]", "*", "- No diamonds, just...this.", "[phone ringing]", "Hello? - It's Hawkins.", "When will you learn that you will never beat me?", "- You're not gonna get away with this.", "We're gonna take you down. - It's over, Holt.", "Checkmate. Knight's bishop to queen five.", "Buh-bye now.", "[phone line beeps]", "- She set us up.", "- [sighs] Oy vey.", "- What do you want, Peralta? - Stop everything.", "Romero told me that the Blizz is in the soap.", "If you take away his supply,", "he'll know I'm the snitch", "and kill me. - Nah, sorry.", "I already made the report to my bosses,", "and they were very pleased.", "Glen couldn't stop smiling. Glen?", "You don't know what a big deal that is.", "Anyway, you're too late.", "We're confiscating all of Romero's soap", "as we speak. - Okay, how about this?", "Throw me in solitary. Right?", "That way, Romero can't get to me.", "- No, Glen's already coming down on me", "about giving too much solitary.", "And I don't wanna piss off Glen.", "Obviously. - What if I spit on you?", "You're the warden, right? That's gotta be", "at least a month in the hole.", "Oh, man, my mouth is all dried out", "from doing the meth. That's why you don't do meth.", "[sarcastically] Ah, oh, no, no! Don't tase me, man!", "Remember that? So funny--but don't.", "- I don't understand.", "How did she know we were mirroring her phone?", "- We had one chance, and we blew it!", "- I know you're upset, but it's really hard", "to take you seriously when you still look like that.", "- I used Broadway-caliber spirit gum.", "This baby is fused to my cheeks.", "- Squad, I think I'm onto something.", "I was listening to an episode", "of Boyle's podcast.", "- Not the one Terry was on, I hope.", "- No, of course not.", "That one was problematic.", "- What did I do that was so wrong?", "- It was the episode about Flaxton Hill Farms.", "The part where Scully said", "the pigs were being force-fed.", "These pigs weigh more than 200 pounds,", "which means they're finishing pigs.", "And why would a farmer force-feed a finishing pig?", "- I don't know what finishing pigs are.", "- Me neither. - I'm totally lost.", "- Because he was feeding them", "something other than food!", "- The diamonds!", "She's moving them inside the pigs!", "- Let's move.", "- I still don't get it. - Nobody does.", "They're just pretending.", "- I can't believe this.", "I'm gonna die in here, and then", "you're gonna eat my castrated body.", "- I guess, but it'd be a pretty boring meal", "without dessert. - Oh, my God.", "Oh, no. Romero's headed towards us.", "And he looks angry. - Well, he always looks angry.", "Maybe it's not directed at you.", "No, now he's pointing at you.", "This is bad. - Yeah, I know it's bad.", "- The warden took my entire stash of soap.", "Apparently, someone told him it was Blizz.", "- And you want me to help you figure out who it was.", "Well, it was Tank. - No, it wasn't.", "- Yeah, it wasn't Tank. It was me.", "Tank, I came clean and saved your life.", "Now you owe me. - No I don't.", "- I told you what I do to snitches.", "- Hold it, Romero. - Caleb, what are you doing?", "- It's okay, Jake. I got this.", "Peralta is my best friend.", "If you wanna kill him, you're gonna have to", "kill me first, because friendship...", "[grunts] Oh, my God, he stabbed me, Jake!", "- Everybody, get on the ground!", "Now! - You're next, Peralta.", "You better sleep with one eye open.", "- Ow, ow, ow, ow.", "He poked me in my tummy.", "- Are you sure? I need you to be sure.", "- You were right.", "Pigs' stomachs were full of diamonds.", "- That's it.", "Everyone on the ground!", "- Put down your weapons! - You're being recorded", "for a podcast! You will sign a consent form.", "- What's going on here? - We found the diamonds", "and Langdon confessed.", "- It's over, Hawkins.", "Pawn to king square five,", "king's knight to the third square", "on the bishop's file, queen takes on F7!", "Checkmate! Now, that's a chess move.", "Buh-bye now.", "- [scoffs]", "- Peralta. - [shouts]", "Warden.", "- Your squad busted Melanie Hawkins.", "- What?", "- You're getting out. Come with me.", "- Okay.", "Wait. Can I do one thing first?", "I wanted to say good-bye.", "I can't believe you saved my life.", "- I would not do it again.", "It really hurt. - Yeah--but you did do it.", "- And I regret it so much.", "- Caleb, you're ruining this.", "Look, I just wanted to say thank you for everything.", "You got me through this. I'm gonna miss you.", "- Aww.", "Put her there, pal.", "[both screaming] - Guards, guards!", "- Ladies and gentlemen, please give", "a warm Nine-Nine welcome", "to Jake Peralta and Rosa Diaz!", "[cheers and applause]", "- Ah, it's so good to be back. - Amen, brother.", "- Can I buy a free man a drink?", "- I'd rather have a drink of that mouth.", "both: Ugh. - I'm sorry, I just...", "I love you. - I love you too.", "- Hello, I'm also back.", "- Hey, Rosa. - So, I heard you spent", "some time in solitary. Pretty dope, right?", "- Uh...", "[as Mufasa] Scar, Sarabi and I didn't see you", "at the presentation of Simba.", "[as Scar] Oh, Mufasa, did I miss it?", "That's simply...awful.", "I handled it well.", "- Sir, I can't believe your obscure knowledge", "of pig-feeding charts saved us. How did you even think of that?", "- Frankly, I'm embarrassed it took so long.", "I should've realized the second I saw those hogs.", "[phone vibrating]", "Excuse me.", "Hello? - So, Captain Holt,", "did my information prove useful?", "Were the diamonds in the pigs?", "- Yes, you were right. - Good.", "And now you owe me a favor.", "And don't even think about screwing me.", "[phone beeps]", "- Captain, we're doing toasts.", "Everyone, raise your drinks!", "the 99th precinct is officially all back together!", "Nine-Nine!", "all: Nine-Nine!", "- Not a doctor. Shh."]