[">So, do you recognize any of these men?", "I was hiding in the bathroom stall,", "so I didn't see his face.", "But I heard him.", "He was singing along to the music at the bar.", "Do you remember what he was singing?", "I think it was that song, \"I Want It That Way.\"", "Backstreet Boys. I'm familiar. Okay.", "Number one, could you please sing the opening", "to \"I Want It That Way\"?", "Really?", "Okay.", "♪ You are... ♪", "♪ My fire ♪", "Number two, keep it going.", "♪ The one... desire ♪", "- Number three. - ♪ Believe... ♪", "♪ When I say ♪", "Number four.", "♪ I want it that way ♪", "♪ Tell me why! ♪", "♪ Ain't nothing but a heartache ♪", "♪ Tell me why! ♪", "♪ Ain't nothing but a mistake ♪", "♪ Now number five ♪", "♪ I never want to hear you say ♪", "- Whoo! - ♪ I want it that way ♪", "Ah, chills! Literal chills.", "It was number five. Number five killed my brother.", "Oh, my God, I forgot about that part.", "Sync &amp; corrections by emeline-whovian www.addic7ed.com", "Hey, it's time. You ready? You excited?", "Yes, I can't believe it's finally gonna happen.", "Aw, you guys are gonna have sex for the first time.", "I'll have you know Amy and I do sex 24-sevs, 369.", "Oh no, I grossly overcompensated", "and now it seems like we have problems.", "- You done? - Mm-hmm.", "Great. Jake's sister is flying in from Dallas,", "and we're picking her up at the airport.", "- You have a sister? - Half-sister.", "Turns out that my slutty pilot dad", "made daughters is several major airline hubs.", "ATL and EWR didn't respond when I reached out, but DFW is DTM.", "Down to meet. Well, we should get going.", "Her flight's gonna land soon, but wish me luck.", "I'm about to be a brother.", "Captain Holt, I need a...", "what's going on?", "My doctor said I should be more active,", "but my squash club recently transitioned to racquetball.", "Since I'm not a dope-smoking hooligan,", "I decided to quit.", "Boyle is teaching me yoga.", "Genevieve got me into it.", "You can't believe how many different ways", "I can wrap my legs around her. Six!", "Captain, if you wanted to be healthier,", "why not come to me? I'm ripped as hell.", "Sarge, health is about flexibility and peace of mind", "and bone strength, not building vanity muscles.", "Vanity muscles? I use all of these.", "Really? Even the large neck ones?", "They help me sleep upright on airplanes!", "Well, there's no reason to be defensive,", "just because you don't have the bone strength of a yogi.", "We all have our thing. You're a muscler,", "I'm a boner.", "Terry can do yoga.", "Terry is a yoga beast.", "Watch. Give me a yoga to do.", "Ah, well, we're in warrior pose now,", "but I suppose for you we can start in child's pose.", "Terry is not a child!", "Terry is a warrior.", "And...", "That didn't sound good. Are you okay, Jeffords?", "I'm fine.", "Now, if you'll excuse me,", "I'm going to walk out of here normally", "using my trademark tiny steps.", "Okay?", "What you looking at?", "Did the Kanye West cannibalism story finally break?", "- What? Is that a thing? - Yeah.", "He eats tiny little bites of people", "when he hugs them goodbye.", "I tipped off Page Six, I don't know why they're sitting on it.", "Just looking on a dating app.", "Weird. Lame. Gross.", "Dumb. Freak. Loser.", "Perv. Toothy. Mouthy.", "- Well, what happened to Becky? - Who?", "The girl you were seeing whose name you wouldn't tell us", "so we just started calling her Becky.", "Becky and I broke up. She ate soup too much.", "- What, like every day? - It happened twice.", "Okay, well, listen, you're in luck.", "Because I have the perfect girl for you,", "and I'm actually texting with her right now.", "No. You are terrible at setting me up.", "Remember that dork, Justin?", "He was a tattoo artist,", "- and he rode a motorcycle. - A Yamaha.", "He might as well have picked me up in a station wagon.", "You know what, men are difficult because they're all", "secretly monsters, but now that I know you're bi,", "that changes everything. I know so many great women.", "I'm sorry. I just don't think this is something you're good at.", "What? The only thing I'm not good at is modesty,", "because I'm great at it.", "Okay, according to the flight board,", "she should be here any minute.", "I love watching a \"TBD\" turn into a gate num.", "What's wrong?", "- Why do you look like that? - I'm so nervous.", "My hands are shaking and my butt is hella sweaty.", "I totally understand.", "I freaked out when I met my pen pal from Thailand, Mongkut.", "But everything worked out, right?", "You and Mongkut are lifelong friends now.", "No, Mongkut turned out to be a 45-year-old prisoner.", "It was a really awkward trip.", "That sounds horrible. Amy, what if this is a Mongkut situation?", "Oh no, that pen pal service is shut down.", "This is your sister. It's gonna be great.", "You just have to relax and be yourself.", "But what if myself isn't good enough, you know?", "What if I'm the Mongkut?", "- Jake... - Right. You're right.", "It's gonna be great. Just got to stay positive.", "We're gonna see each other from across the room,", "we'll lock eyes, I'll say \"noice,\"", "she'll say \"toit,\" and then six months later,", "we'll be on \"The Amazing Race\" together.", "Jake?", "Ka... oh, no.", "It's me, Kate. Give me a hug.", "- Stand down, ma'am. - Back off, dude!", "- That's my brother! - Oh, no.", "It's a Mongkut situation.", "So, this is awkward,", "but we should probably address", "- the elephant in the room. - Right.", "Are we doing table apps or solo apps?", "Uh, table apps and lots of them.", "If it is fried, it must be tried.", "- Johnny Cochran. - I remember when he said that.", "- Jake. - Right.", "So, what I actually meant was,", "we should probably talk about the whole", "handcuffs at the airport thing.", "I know. I'm so sorry.", "That was a really bad first impression.", "It's just, I was on the plane", "and started to get really nervous", "about meeting you for the first time.", "I was nervous to meet you too.", "My butt got hella sweaty.", "- I told Amy. You can ask her. - Please don't.", "So I went to the bathroom and started vaping to calm down.", "Then this weird-ass lady comes up to me, and I'm like,", "bitch, you're trying to tell me your kid doesn't like the smell", "of cotton candy?", "Right, but the only thing I don't get", "is why they would handcuff you for vaping.", "Because they're the worst!", "Yeah, Amy, 'cause they're the worst.", "Also, I slapped a stewardess,", "real hard.", "With my fist.", "Oh.", "So they were not the worst.", "Oh, my God, are you mad at me?", "Oh, no, I messed this up. I am so sorry, Jake.", "I really wanted this trip to go well", "and was looking forward to finally having a brother", "for the first time.", "You know what, I'm just... I think I'm just gonna leave.", "No, don't leave, okay?", "It's fine. I get it.", "It's so crazy that we're finally meeting each other.", "So just forget about the plane. That's ancient history.", "- Really? - Yes.", "This trip was about us getting to know each other,", "- so let's do that. - Okay.", "What's your favorite scene in \"Die Hard\"?", "Die what?", "It's okay. It's okay.", "Um, when was the last time you saw your dad?", "I mean, I've only ever met him like nine times.", "Ten if you count the time he sent his co-pilot Steve", "to hang out with me, 'cause he was too hungover.", "I remember Steve. He taught me how to shave.", "- He taught me how to shave. - Where?", "- Steve was the best. - Freakin' Steve.", "Jeffords, what are you still doing here?", "You're clearly injured. Go home.", "I'm totally fine. Here. I can prove it.", "I'm fine. See?", "You can't have thought that went well for you.", "It's okay, Sarge. Just admit you can't handle yoga.", "I can handle it fine.", "I'm just a little sore from my real workouts.", "With weights. Now, I've got work to do.", "Oops.", "Dropped my phone. You know what?", "My contract is up.", "It's time for an upgrade anyway.", "- Scully? - Huh?", "Where's your secret nap room?", "I don't know what you're talking about.", "Help me! Please!", "Couch. Space heater.", "We soundproof for maximum privacy.", "And there's sodas and candy in the mini fridge.", "- This room's a little small. - We had a big nap room,", "and you gave it to Gina to pump breast milk in, remember?!", "Sorry, Scully.", "You tell anyone about this place,", "I will burn your life to the ground.", "Oh, and there's a spray if you fart.", "Okay, that is nothing.", "The one parent-teacher conference my dad went to,", "he had sex with my teacher on top of the diorama I made", "of the first Thanksgiving.", "Oh, no, he ruined all your hard work.", "Oh, not really, it was just a bunch of Smurfs on a plate.", "- Oh. - He came to visit once,", "and hooked up with my mom's entire book club.", "She can't see a copy of \"A Prayer For Owen Meany\"", "without fully weeping.", "I don't know what that is.", "But enough about our dad.", "- What's going on in your life? - Honestly,", "it's been a tough year.", "I lost my job,", "love of my life Kurt just broke up with me.", "Oh, hey, Amy has seven brothers.", "Maybe you could date one of them.", "Oh, snap. I'm down to clown.", "Which one has the best body?", "- Uhhh... - Tony.", "Right? It's very clearly Tony.", "I don't know why she hesitated.", "- Tony got bod. - Tony it is.", "Anyway, that's my boring life in Dallas.", "But I'm here now, and I want to see the real New York.", "Let's like...", "Walk across the Brooklyn Bridge?", "Get tanked at the Times Square Olive Garden.", "And get our pictures taken with a human statue.", "Right. The real New York.", "- Whenever you're ready. - Hey, let me get dinner.", "I had like ten more drinks than you guys.", "- Oh, are you sure? - Mm-hmm.", "Wow, that is so sweet, and totally unneces...", "- what are you doing? - Life hack.", "Hey, there's glass in my food!", "Oh, my God oh my God, oh my God oh my God...", "What kind of restaurant is this?!", "Where's Holt? He told me to come in here.", "Nope. That was me.", "I've been recording his voice for the past two years,", "and now I have a soundboard where I can make him say", "anything I want. Check it out.", "Diaz. I. Need. To. See. You. In. The. Briefing. Room. Now.", "Pretty cool, right? Watch this.", "Milk. Milk. Lemonade.", "Around. The. Corner. Fudge. Is. Made.", "- That is amazing. - Isn't it?", "- What do you want? - To find you love.", "- Ugh. - Come on!", "Check it out: Dannika, 34.", "- The only female trader... - Pass.", "Finance people are the worst.", "Okay, well, take a gander at Jessica,", "professional stuntwoman", "just back from a surf trip in Bali...", "Pass. People who surf never shut up about it.", "Kinda true. You know who doesn't surf? Gabrielle.", "- I'm out. - Come on, Rosa.", "Give me a shot. If I mess it up, fine.", "I'll drop it, and I'll never bring it up again.", "Fine. One date. That's all you get.", "- That's all I need. - Hey. Diaz.", "Enjoy. Having. Sexual. Fun.", "With. Linetti's. Lesbian. Friend.", "Get. Some. Get. Some. Get. Some.", "So, your sister's a bit of a nightmare.", "I wouldn't say that. I mean, at most, she's a daymare.", "- Those are so much scarier. - Yeah.", "She put glass in her food, Jake.", "She's a con-woman.", "Look, she's a survivor.", "She's had a really hard life.", "And I thought it bad 'cause I would only see my dad", "for like an afternoon once a year,", "but compared to her, I was a real DJ Tanner. \"Full House.\"", "- Her dad was always around. - Yeah, I've seen \"Full House.\"", "Look, I'm sorry she's not what you expected.", "She is a lot.", "But she's my sister. And she's young,", "and she just got out of a really bad breakup...", "Whoo!", "She's home.", "Kate! Are you okay?", "Sounds like you're breaking stuff.", "Hey! I'm sorry, were we being too loud?", "- We? - Oh, hey. I'm William.", "I thought you just wanted a picture.", "Oh, we took a lot of pictures. Get in here!", "- Oh, no, he's my brother. - That doesn't bother me.", "Okay, I'm going to bed.", "Okay.", "Time to go home.", "Oh, no. Terry can't move.", "Terry needs help.", "Hel...", "Ugh, there are silver butt prints everywhere.", "Why did he need to paint his butt? He wears pants.", "Look, I'm sorry about all this.", "I really thought she was gonna be like me.", "But scamming restaurants and hooking up with street performers,", "she is 100% my dad.", "Look, it's a two-day trip.", "We just need to survive the next 18 hours.", "- Sure, sure. - And, you know, I sat through", "a whole play once, so I can get through anything.", "I took you to that play, and you said you loved it.", "- Because I did. - Well,", "55 minutes in the shower and that silver paint", "- will not come off. - Gross.", "Anyway, my astrologer is always telling me", "everything happens for a reason,", "and I'm like, then why did Kurt dump me?", "But now I know why.", "So I would leave Dallas and move to New York", "to be near you!", "Whoa, really? I mean, that's great,", "but, you know, it's so expensive here.", "I'll be fine.", "I got a head full of dreams, and a pocket full of glass.", "I'm a New Yorker now. Fuggedabout it!", "Yes.", "Forget about it.", "Babe. What are we gonna do?", "My sister cannot move here.", "I'll just tell her it's a bad idea, and she shouldn't do it.", "Ugh, but I'm the only family she has.", "I don't want to hurt her feelings", "and send her into a downward spiral.", "She slept with a tin man, Jake.", "I don't think the spiral goes any further down.", "Right. Wait, I've got it.", "The only reason Kate wants to move here is because Kurt dumped her,", "but what if we can get him to take her back?", "Then she would definitely want to stay in Dallas!", "Ooh, that's smart, but what if he's a rational person", "and he doesn't want to be with her anymore?", "Not a problem. I found his Facebook page.", "He just posted a black and white photo of a dead flower", "with the hashtags \"my heart,\" \"Kate forever\"", "and \"love is dead.\"", "- He misses her for some reason. - Amy, this is it.", "He clearly already wants to get back together.", "All we have to do is convince him to fly here.", "- Jake, this might work. - Yes!", "But are we actually gonna do this?", "Are we really going to fly a man to New York City", "just to ensure that my new sister doesn't move here?", "Hey, Amy, do you have a morning-after pill", "I could bomb? I will get you back.", "Use. My. Miles.", "Boyle, have you seen Sergeant Jeffords?", "Oh, do you mean Sore-gent Jeff-hurts?", "He didn't make it home last night, Boyle.", "- Oh, no. I'm so sorry. - You should be.", "He could be in grave danger,", "and you just flippantly called him Sore-gent.", "Oh, my God. I'm the worst. Who does that?", "Well, his car's still here, so I don't think he ever left the building.", "- He's probably fine. - What?", "Then why did you make me feel so bad?", "To teach you a lesson about", "about the destructive power of wordplay.", "Now, where could he be?", "Why are we going home?", "We haven't even done the \"Sex and the City\" tour.", "Oh, my gosh, I am such a", "\"that one who fell through the sidewalk hole.\"", "Yeah, you totally are. We're just so excited", "you're moving here, we thought,", "why not go straight home and celebrate at exactly 8:00?", "- Kate. - Kurt?", "- Kurt? The Kurt? - What?! Oh, my God,", "what are the chances?", "Kate, you didn't tell us how handsome Kurt is.", "I love your...", "jean shorts.", "Babe, breaking up with you", "was the biggest mistake of my life.", "It was? Oh, my God, he flew all the way", "to New York to tell me that. That's so romantic.", "It's beautiful, really.", "You're not even allowed to leave the state.", "- What's that now? - One more time?", "You think I'm gonna let my skank parole officer", "stand in the way of true love?", "Kurt!", "He seems like a cool guy.", "Jeffords isn't in the evidence locker.", "He's not in the file room, either.", "I mean, there's nowhere left to hide. I'm worried.", "Actually, I think I know where he is.", "I could take you there, but you need to wear blindfolds.", "- No. - Okay.", "I guess he'll just die in Supply Closet F, then.", "He's in Supply Closet F!", "Great work.", "I'm sorry. I feel so stupid.", "Oh, it's okay. They tricked you somehow.", "I still love you, buddy.", "- Oh, thank God, you found me! - Jeffords, are you okay?", "Charles was right. I couldn't handle yoga.", "Well, we're here to help.", "I'll get a couple officers to help lift you up.", "No need. I can handle this.", "Charles, there's no way you can lift me.", "Yoga's given me great bone strength, Terry.", "So get ready...", "you're about to enter the bone zone.", "- Not a thing. - Shhh.", "♪ Joe Cocker's \"Up Where We Belong\" ♪", "♪ Love lift us up where we belong ♪", "♪ Where the eagles cry ♪", "♪ On a mountain high ♪", "Rosa, I want to introduce you to my friend Trishelle.", "- Hi. - Sparks.", "Well, I'm gonna take off. You two have fun.", "Get. Some.", "I made a mobile version.", "So, what are you drinking?", "I'll have a margarita.", "But, like, a skinny margarita.", "So, like, tequila, lime, and a tiny splash of agave.", "- Mm. I refuse to order that. - You don't have to.", "I heard her. What do you want?", "Just take your cheapest whisky and pour it into your nearest glass.", "- That's a drink. - So, with this diet", "that I'm on, you can eat anything that's clear.", "- Mm. - Like rice noodles,", "pineapple gummi bears...", "So Kurt and I talked,", "and I'm sorry, Jake, I know I said I'd stay in New York,", "but I can't give up on this guy.", "Especially not after he flew out here for me.", "Well, sounds like the universe just really wants you to be in Dallas.", "But on a personal note, it is such a bummer.", "I just missed her so much.", "And so do the kids.", "Oh, you have kids?", "Kurt has six.", "Who's watching them now?", "- The state. - Oh, fun.", "We're getting to know Kurt.", "Ooh, hey, sorry, the door was unlocked,", "so I opened it. Is Kate here?", "Oh, hey.", "I think I left my wallet in your couch bed.", "Uh, have you seen it?", "- It's silver. - Babe, who is this?", "- Babe? - That's William.", "He is a human statue I know.", "Yeah, it's not really a good time right now, William.", "We don't have your wallet. Bye.", "Did you have sex with this silver man?", "- Did you cheat on me? - We were broken up.", "And you cheated on me like ten times when we were dating.", "'Cause you were sad all the time.", "- 'Cause my mom died. - Oh, no.", "- In March. - That's so recent.", "Fine. I'm sorry, Kurt. I'm sorry.", "What? No, don't apologize to this guy.", "- He's a dick. - Excuse me?", "You're not good enough for my sister.", "I didn't realize you were this tall.", "Kurt. She's not going anywhere with you.", "Take your jean shorts and the butt that's in them", "and get out of my apartment.", "What the hell, man? You're the one who flew me out here", "and begged me to bring her back to Dallas.", "- Just... - Kate!", "Tsk.", "You begged him to get rid of me?", "Uh...", "Hey!", "Found my wallet.", "Thanks, guys.", "Have a blessed day.", "So he was a robot man.", "So you were trying to get rid of me?", "I mean... Yeah, kinda.", "But I also just told off Kurt for being a jerk to you,", "so who's to say which thing we should focus on?", "Anyways, let's go to Olive Garden and get tanked.", "No, I won't, because that place is for family.", "Ah, that stings.", "Look, we're still family.", "I just didn't think you should be moving to New York.", "The whole plan seemed a little...", "how do I put this delicately...", "psychotic.", "I didn't ask you to be a part of my life, Jake.", "You asked me.", "I was perfectly happy in Dallas", "with no dad and a dead mom,", "being walked all over by Kurt and his kids.", "That doesn't sound like a great situation.", "Yeah, it's bad, okay?!", "Which is why when I got a call out of the blue", "that I had a brother who wanted to meet me,", "I got a little excited. I'm so sorry.", "I was excited too, but we don't know each other.", "You shouldn't move here just for me.", "Don't worry. I'm going back to Dallas.", "You won't ever have to see me again.", "Until, that is, I'm on \"The Voice,\"", "at point, you'll see me... ♪ Everywhere! ♪", "- Oh. - Oh you don't like my singing?", "Well, good, because that is the last time you get it,", "♪ For freeeeeeee! ♪", "She's gonna do bad on \"The Voice.\"", "So, how'd it go last night?", "- Worst date I've ever been on. - Oh, no, that sucks.", "Then why are you coming in to work so late?", "It's almost like you spent the night somewhere.", "I don't know, like, maybe the bartender's?", "Wait, what? How do you know that?", "Because Aubrey is my friend,", "and she was the real set-up all along.", "No, no, no, no, no.", "Yes, I knew you'd reject whoever I put in front of you.", "I mean, Trishelle was just a decoy.", "And you fell for it hook, line, and skinny margarita.", "Nicely done. Aubrey is great.", "We're going to dinner again tonight.", "- Whoo! - I owe you an apology.", "You're a great matchmaker.", "Thank you. And you know what?", "I'm just glad that you found the courage", "to tell me how great I am.", "It means so much.", "- Whatever. - Have a fun night.", "This is not on us.", "I mean, it was crazy for her to think moving to New York", "was a good idea, right?", "Yes, it was unrealistic.", "Just like Mongkut thinking a ten-year-old American girl", "would pay his bail and help him seek vengeance on his brother.", "You know, when I'm not distracted by this,", "I'd really love to hear the full Mongkut story.", "- It gets dark. - Yup.", "Look, your sister is a lot to take.", "You shouldn't feel bad", "that you don't want her around constantly.", "Right? I mean, we can have a relationship", "and still live in separate cities.", "I'd love to see her, like,", "once a year for an afternoon, or...", "- Oh, crap. - What?", "Oh, something just dawned on you.", "Yeah, I got to go to the airport.", "This is ridiculous. Listen, the choice is yours.", "Lawsuit, or upgrade me to business class.", "- Ball's in your court, pal! - Hey!", "Kate, officers, what's going on here?", "This woman said she cut her hand on a ticketing kiosk,", "but somebody saw her pull out a bag of glass.", "That's my healing glass, and legally,", "you can't ask about it. What kind of airport is this?", "Okay, I'm with the NYPD. I got it from here.", "Thanks, guys.", "- What do you want? - To apologize.", "Look, I was trying to get rid of you.", "Because you're a little bit of a mess, kinda like dad.", "- Oh, I'm definitely a mess. - But I was being like dad too.", "I was trying to have a relationship with you,", "completely on my own terms.", "And we both know from personal experience,", "that's a really crappy way to treat a family member.", "It is.", "Thank you for saying that, Jake.", "And yes, I accept your invitation to move in with you.", "- Oh. Um... - I'm joking.", "I'm going back to Dallas. Don't worry.", "But maybe we can keep in touch.", "I would really like that.", "Man, I was worried you were never gonna want to see me again.", "Are you kidding? The way you stood up for me with Kurt,", "you're a great big brother.", "And I have so many other enemies.", "- You're gonna be real busy. - Oh.", "Anyway, I should go. My plane's leaving. Come here.", "- Noice. - Toit.", "All right, sis, have a safe flight.", "- No vaping. - ♪ No promises! ♪", "She is bad at singing.", "Sync &amp; corrections by emeline-whovian www.addic7ed.com"]