[">Here comes the bachelor.", "A dressed in my nice jacket I on wear for special events.", "Oh, you're already on fire. Thank you, my friend.", "And, gentlemen, welcome to my bachelor party.", "This is the elite party squad.", "That is, assuming the Captain is ready to let loose?", "Captain? I don't think so.", "I want you guys to think of me as one of the boys.", "So tonight I'll be swapping out my captain's hat for my...", "Kangol hat. Call me Raymond.", "Okay, Raymond in the Kangol hat, I will", "definitely call you Raymond, Raymond in the Kangol hat.", "This is the best night of my life.", "Mine too. Sharon gave me permission", "to get wasted.", "She's even putting a pasta pot", "next to the bed in case I hurl. Smart.", "I'm definitely putting a pasta pot on our wedding registry.", "Charles, tell us everything we're doing tonight.", "Well, that could take a long time.", "I've been planning this bachelor party for 10 years.", "But I met Amy eight years ago.", "What does she have to do with this?", "JK. I'm happy for you both.", "No, no, tonight is about", "creating a bond that will last forever.", "Tonight is about The Batch Boys.", "Eh, we can brainstorm the name later.", "No, we can't because I already made fanny packs.", "Ah, well, that settles that.", "This, uh, clearly says \"Bach Boys.\"", "No, it's \"batch.\"", "You know, like the beginning of \"bachelor.\"", "I've been working on this for 10 years. Don't ruin it!", "Okay, so let's fanny up, Batch Boys,", "because it's time to party.", "Whoop, whoop!", "Yes.", "Whoop, whoop, Raymond in the Kangol.", "Let's go.", "Play one of the best new FPS shooters, search Steam for PROJECT WARLOCK", "I'm so excited for tonight.", "Thank you to my best friend, Kylie, for organizing this.", "And thank you for coming, ladies", "and gentlemen.", "I still don't get why you guys are here.", "Well, as I understand it, Amy", "lost some sort of bet with Jake. It's true.", "In hindsight, we should probably stop", "making major decisions through bets and competitions.", "More importantly, why are you guys dressed like that?", "You look like you're on Empire.", "That's what we were going for. Drip, drop.", "We brought you a little gift.", "I had to guess on cup size.", "Just gonna burn that for you. Thank you.", "Amy, I too have a gift, okay?", "Tonight, until the stroke of midnight,", "I will not make fun of you in any way at all,", "no matter what.", "That is so sweet.", "And my gift to you", "is a cray-cray night of funky fun!", "I fear I've already made the biggest mistake of my life.", "So, Kylie.", "What's the first event of the night?", "I thought we'd start by discussing the etymology", "of the word \"bachelorette.\"", "Whoo-whoo!", "Or we could just play Never Have I Ever.", "Maybe later? I'll start.", "Never have I ever", "flashed a bartender to get a free drink.", "You guys know how the game works, right?", "You drink if you have done it.", "Oh. We understand.", "Okay, Batch Boys, the festivities officially begin now.", "Let's just grab a couple cabs or...", "Oh, my God. What do we have here?", "Damn!", "Nice work on the limo, Charles.", "What...", "What just happened?", "Well, that was weird.", "A suspicious bag.", "Maybe we should see what's in it?", "Ooh. A mystery bag.", "I hope it's got those light-up necklaces.", "People love seeing large groups of drunk men wearing those.", "Nope. It's a bunch of school supplies.", "Is this gonna be one of those scavenger hunts, Boyle?", "'Cause that pasta pot isn't filling itself.", "Come on, Terry. Let's just see what the plan is.", "Charles, what are we doing?", "I don't know anything about it.", "But why don't we take this map and this sextant", "and chart a course to the restaurant?", "Title of your sex-tant tape.", "Ah, did not work at all,", "but I love that you attempted it.", "Title of your sex-tant tape.", "All right, let's go!", "Never have I ever", "had sex in the back of a car.", "No way. Everyone's done that?", "Yeah. Except for you.", "Kylie, you're telling me you had sex in the back of a car?", "Actually, it was a school bus,", "on the way back from Model UN", "with Myanmar.", "It's like I don't even know you.", "Look, we've done like nine rounds of this,", "and you haven't drunk once.", "Maybe we should play something else", "that actually gets you drunk.", "I love you, dude, but you haven't had the craziest life.", "That's not true. I've done stuff.", "Just say ones that are a little less wild.", "Uh, never have I ever made a turn without signaling.", "Okay, a turn is a big deal.", "It's not like you said, never have I ever", "changed lanes without signaling.", "Never have I ever changed lanes without signaling.", "You guys are insane!", "Never have I ever", "accepted the terms and conditions without reading them.", "It's too risky.", "Left a movie without watching the credits.", "Those people worked hard.", "Used more than the recommended amount of conditioner.", "They make the conditioner. They know what they're doing.", "This is lame. Let's play something else.", "No. No, no, no, okay.", "Never have I ever", "had a one-night stand with a guy from a band.", "Whoops! Yes, I have!", "Whoa, I am V impressed, Amy. V impressed.", "In fact, Kylie,", "it was the lead singer of your wedding band.", "Boom! That's right.", "I'm a wild girl!", "Watch out, Madonna.", "Uh, Ames?", "I told Jake that you really liked that band", "and he booked it for your wedding as a surprise.", "What?", "Surprise!", "So, according to this map,", "the restaurant should be right here.", "But it's just an old abandoned building.", "That's odd. Unless...", "You don't think when the sun sets that", "certain letters on that graffiti wall will be illuminated", "by a shaft of light?", "I don't think that.", "We've been at this bachelor party", "for over an hour, wandering around aimlessly", "and we haven't done one bachelor party thing!", "Well, Terry, if you'd like, I could share a lewd story.", "Kevin got me quite horny this morning.", "Oh, see?", "Come on, guys. I'm hungry!", "Oh, you're in luck. The fanny pack", "is filled with granola.", "Mmm! Loose granola.", "I don't want fanny granola!", "I want steaks and whiskey!", "Is this whole night just gonna be puzzles?", "Good question. Perhaps that's something", "the limo can answer!", "Oh. Oh, yes, the limo's back!", "We finally get to ride in the limo.", "Nope. The limo is not for us. This is something else.", "Oh, no, I'm being kidnapped!", "We have your friend! Your mission is to find him!", "Is that a Serbian accent?", "It is. Write that down for later.", "Oh! I'll see you in six hours.", "Six hours?", "Charles, let us get in the limo, please!", "Terry's so hungry!", "No!", "Okay, let's not get discouraged just because...", "We've been doing this for 93 minutes", "and we haven't figured out one damn clue.", "That's why I said to not get discouraged.", "All right, what about book two? Maybe it's a code.", "All we have to do is decipher", "this list of thousands of random numbers.", "Huh, I wonder if one of them is... 6-9?", "Pretty sure he means 69, but I'm so hungry", "I can't even appreciate horndog Raymond.", "I say we bail on the scavenger hunt.", "There's a restaurant one block away that", "rolls meat to you on a cart.", "Charles would be so upset if we bailed.", "But what if Charles never knew?", "If we can figure out where he's going to be", "at the end of the night, we don't have to do", "- any of his dumb puzzles. - Right.", "Instead, we can spend the next six hours", "eating and drinking and", "talking about how we lost our V cards.", "And then we show up at the final location", "and pretend we did the stupid hunt.", "Yeah, yeah... Interesting.", "All right, I'm not saying I'm on board with this", "'cause it's a little bit cruel, but hypothetically,", "- if we were to cheat... - Got it.", "I hacked his email.", "His password's really easy to guess.", "Dianne Wiest. And look here.", "There's a receipt for a party boat rental", "and also a cake delivery", "to a dock down in Bergen Beach.", "That's got to be where this night ends.", "All right, fine.", "We will stop and get one tiny, little snack", "just to recharge our brains and bods,", "but under no circumstances will we", "do any bachelor partying without Charles.", "Whoo! I'm getting married!", "This is my bachelor party!", "You guys, I can't have", "some rando one-night stand at my wedding.", "I'm on the band's website.", "Not to tease you, but", "just so we all have the complete information.", "Which one is he? Constantine Kane.", "Yes.", "I see.", "Why don't you just cancel the band?", "If I cancel, I'll have to", "tell Jake why, and I don't want to do that.", "Well, it says he's playing a solo show in Bed-Stuy tonight.", "We can just go down there and ask him", "to pull out of the wedding. I don't know.", "Tonight was supposed to be about us bonding,", "and instead, it's just starting to be about some dude.", "No, it's about your bachelorettes having your back.", "But I wanted tonight to be fun.", "And it will be.", "We're having a drunken adventure!", "Really?", "Okay. Yeah. Let's do it.", "Yay! Bachelorette adventure!", "Kylie, you should talk less.", "Sorry, I have to direct it somewhere.", "Nice to meet you, by the way.", "Hey, guys, if you're running out,", "I'm just gonna take Hitchcock to the hospital.", "Is he okay?", "He drank a lot during Never Have I Ever.", "We're gonna get his stomach pumped,", "try to get ahead of this thing.", "That meat was good.", "You know what we should order?", "More meat.", "Yeah, we should.", "We're the Steak Studs!", "The Steak Studs!", "No, no, no... Wait!", "Charles already gave us a name.", "And that is the only one we're gonna use.", "Steak Studs! Steak Studs!", "Steak Studs! Steak Studs!", "Wait, wait. Steak Studs...", "It's Charles. Oh, no. Oh, no.", "What do we do? What do we do?", "Everyone, calm down.", "It'll be fine. I have an idea.", "Why is everyone looking at me?", "You just said you had an idea, then you stopped talking.", "Oh, my goodness. I'm very intoxicated.", "Oh, he's FaceTiming me, you guys.", "What do I do?", "He can't know we're at the restaurant.", "I need a neutral background.", "I'm a neutral background!", "- I'm huge! - Yes. Genius.", "Let me put on my jacket. Okay.", "Hey, best man.", "Jake! Oh, I'm so scared.", "The kidnappers have me tied up and...", "Where are you guys?", "I don't want to say, in case the kidnappers are listening.", "Smart. But please hurry.", "They're torturing me like James Bond in Casino Royale.", "It's all groin stuff! Oh, my God.", "Save me! Save...", "That was close.", "So...", "Should we order another round?", "And that's why / cry.", "Every time / eat my pecan pie.", "À la mode.", "Yeah, Constantine! Thank you.", "Namaste.", "Look, in my defense,", "he didn't used to have that man bun.", "It was just a ponytail.", "I'm just gonna write some of my thoughts down", "just to let them out, so I don't explode.", "Okay, look, no matter how lame that dude's man purse is,", "Amy Santiago still had a one-night stand.", "- To Amy! - Amy!", "Yeah.", "Actually, it technically wasn't just one night.", "Explain.", "Well, he caught me trying to sneak out the next morning,", "and then he started crying,", "so I hugged him, and", "while we were hugging, um,", "his mom FaceTimed, and he introduced me as his girlfriend.", "Okay, so then right after the call,", "you broke up with him, ended it.", "Uh... How long were you with", "crying wedding-band man bun?", "Not that long. I doubt he even remembers me.", "Oh, my God. Amy Santiago.", "Ladies and gentlemen,", "the love of my life is here.", "Three months. We dated for three months.", "All right. This is the boat.", "Now, Charles has to think we're totally sober", "and we solved his puzzle.", "So we good? Yep, I'm drunk as hell!", "That's not what I asked. Don't worry about me.", "I've seen you do enough of these harebrained schemes", "to know how to play along.", "If Charles asks what's wrong,", "I'll just put on a quaint smile and say,", "\"Nothing.\"", "Amazing. That is actually perfect.", "All right, now let's hold on to each other for balance", "like three totally sober grown men.", "Come here.", "And here we go.", "Oh, yeah, we're nailing this.", "Hello? Charles?", "Surprise! Welcome to the party, pal!", "Wow! This is amazing!", "Yeah! Now we get to the best part.", "Steaks and shots!", "Oh, more meat and alcohol.", "\"More?\" What does that mean?", "Uh...", "Nothing?", "Isn't this great? Uh-huh.", "So there is one question about the scavenger hunt", "you have to answer.", "Was he everything you thought he'd be?", "Yes.", "He was everything I thought he'd be.", "Never before has a person so perfectly met my expectations.", "I know!", "Isn't Reginald VelJohnson the best?", "Reginald VelJohnson? From Die Hard?", "Sergeant Powell was a part of my bachelor party?", "Is what I said upon meeting him.", "I'm just still emotional about it.", "I can't believe you pulled that off!", "Yeah, I did.", "I have one more surprise for you.", "If I could have your eyes, ears,", "and emotional cores...", "I'd like to take you all on a journey.", "Wow, you got a lot of photos of my birth.", "Your mom didn't have any pics, so I had to call the hospital.", "Ah. Jake Peralta.", "My partner. My best friend.", "My brother. My idol.", "The one man who has never let me down.", "Oh, that's very kind.", "Tonight had to be the biggest,", "most special bachelor party ever.", "It had to be extraordinary because you,", "my friend, are no ordinary man.", "In fact, you are 24 karat gold.", "So if we get the big jobs and we make...", "24 karat gold!", "Is that a phrase I say? No.", "Like the coins from the hunt!", "Yes, of course. From those.", "Now, Terry, please present your gold coin.", "My gold coin? The hell?", "From the last stop, the one with Reginald VelJohnson.", "Yes, right, I already told you that I was there and I met him.", "Stop bringing it up. Terry, give the man his coin!", "The hell are you talking about, Jake?", "The coin. Give him the coin. What coin? I don't have a...", "You give him a coin. Give him his gold coin.", "What's going on, guys? All right, here's the deal.", "Terry's coin fell out of his pocket, and we lost it.", "We just didn't have the heart to tell you.", "Oh, no. That cost $800.", "All right, Terry will pay me back later.", "What? Captain, your coin, please.", "And as our lives change...", "I ate mine. You ate your coin?", "Yes, I thought it was chocolate.", "But you hate chocolate.", "It has \"too much taste.\"", "Oh, man.", "You guys didn't do the scavenger hunt, did you?", "And you call yourselves The Batch Boys?", "Actually, we call ourselves The Steak Studs.", "Raymond!", "Why?", "I know why you're here, Turtle Bug.", "I feel like the fact that you just", "called me that means you don't.", "Uh, quick question. If I make fun of Constantine,", "does that count as making fun of you?", "Yes. Okay.", "Can I make fun of you? I'd rather you didn't.", "Well, I have to remove myself from this situation.", "Look, I want to talk to you about a gig you have coming up.", "Jake Peralta booked it. Yeah.", "Your wedding. What?", "If you knew that, then why did you take it?", "I wrote you a love song.", "I'm gonna sing it, and I'm gonna win you back.", "Then we're gonna be on The Today Show.", "I love Hoda. Yeah, no.", "No, we will not.", "This is what's gonna happen, okay?", "You're gonna call Jake,", "tell him something came up,", "and you have to cancel the gig.", "Not happening. I'm gonna get on that stage.", "And I'm gonna play Amy Come Back.", "Fine. I'm gonna tell Jake everything.", "I'm canceling your band. Boom.", "Okay! That'll just cost you $15,000.", "Excuse me?", "Well, when I heard it was your wedding,", "I knew your fiancé would cancel", "when he found out about us, so...", "I put in a huge kill fee.", "Yeah, he never even noticed.", "He didn't read the terms and conditions.", "Look, Charles, I'm sorry that we cheated,", "but your puzzle was too hard.", "Oh, don't give me that excuse.", "I worked hard on this night!", "And it all led up to this moment", "where everyone gives you $3,200 in gold coins!", "Again, is the gold coin thing based on something I said?", "You're 24 karat gold!", "Yeah, right, okay. You guys are the worst.", "You're right, and we shouldn't have lied to you.", "But all of this, the puzzle,", "it's what you wanted, not me.", "I just wanted to hang out with my friends.", "Well, don't let me stop you.", "You can hang out with your friends all you want,", "because I'm leaving.", "Charles!", "Come on, slideshow.", "Boyle isn't picking up, and I called Genevieve.", "She doesn't know where he is. Wait.", "I bet Charles is looking for the coins he hid all over the city.", "They were so expensive.", "Also, why does he keep saying I'm 24 karat gold?", "No idea. Makes zero sense.", "We'll have to figure it out later.", "In the meantime, we gotta find those coins.", "Yes, but how do we figure out where they are?", "All we have to do is solve", "the entire six-hour scavenger hunt immediately.", "Raymond, toss me that sextant.", "Guys, we can do this!", "We cannot do this.", "We're way too drunk.", "But there has to be someone that knows", "where those coins are, right? Charles.", "Charles would know. Brilliant!", "We just have to find Charles, but where might he be?", "He's probably digging up the gold coins.", "But who would know where the gold coins are?", "Charles! Charles knows where they are.", "But where is he... No, wait, we're stuck in a loop.", "We're super drunk and we're in a loop.", "We need to find someone who isn't Charles", "who knows where the coins are.", "Oh, my God. Oh, my God. Oh, my God. Oh, my God.", "It's Reginald VelJohnson. What's going on?", "Who are you? I'm Jake Peralta.", "You were part of my bachelor party tonight.", "Oh, you're the jerk who didn't show.", "He knows who I am.", "Okay, so I need to come up with 15 grand", "or my father-daughter dance is going to be performed by that.", "Wrong. You're forgetting the most obvious option.", "Steal the contract and destroy it.", "Destroy a legal document? I can't do that.", "You were right, I'm a boring square", "who's never actually had a crazy, stranger bone session.", "Gina, your looks are just as hurtful as your words.", "I'm sorry. I can only control so much.", "I shouldn't have come back. Okay. Look.", "You don't have to steal it. We will.", "Right? Hell yeah.", "You guys don't have to do this.", "We told you. We're your bridesmaids.", "We have your back. Okay.", "I think if we distract him, I can sneak in", "and take the contract out of his man purse.", "Won't he know what's going on?", "He saw all of us with Amy.", "Not all of us.", "Sick set.", "You were really jamming up there.", "Oh. I'm Lucious Lyon.", "Record executive at... Executive Records.", "Lucious Lyon. I've heard that name.", "Anyway, we're always looking for new talent.", "\"We\" being me and my partner.", "That's Cookie. Let me introduce you.", "Where is it? Where is it?", "Why are there so many scarves in here?", "You looking for this?", "I see him, Gina. Thank you.", "Look, Sergeant Powell...", "Oh, I'm sorry, is it okay if I call you by", "your character name from Die Hard?", "No. Okay.", "Look, Reginald, do you know why Charles hired you?", "Because I love Die Hard more than any other movie,", "and I loved you in it.", "For the record, I loved you from F ami/y Matters.", "Carl Winslow made me want to become a cop.", "Come on, Terry, you already have", "like six other reasons you became a cop.", "This is not your moment.", "And for the record, that's the first time", "I've ever heard him even mention Fami/y Matters.", "Look, it's late. Please leave.", "Come on. Look... My best friend is out there.", "And you're the only one who knows where he is.", "So, as much as I hate to do this,", "you're gonna tell us where those coins are hidden,", "or you're gonna regret it.", "What are you gonna do to me?", "Stay here all night,", "making this sound.", "Fine, fine.", "- I'll tell you where he is. - Yes.", "Thank you so much.", "Also, we're gonna need you to take us there,", "'cause we're all too drunk to drive.", "You thought you could distract me with a record deal?", "Please, I'm already represented.", "By my mom.", "God, you're a turd.", "Well, this turd", "is your best friend's future husband.", "Doink! Hey, wait, no!", "Give that back to me! I'm wild!", "Keep going! Keep going!", "He's gaining on you. Not for long.", "Free shots for everyone!", "Turtle Bug!", "Whoo!", "Buh-bye, Connie!", "Tell your mother I said I never loved you,", "and that your whole family is a bunch of friggin'...", "Whoo, I broke a rule!", "Never have I ever slept with a guy,", "broken his heart, hired him to play at my wedding,", "stolen a legally binding contract from him,", "jumped on a bar and dumped booze on everyone,", "fallen off the bar, probably given myself a concussion.", "And a permanent scar.", "I have ever!", "Well, it is officially after midnight,", "so I can now say whatever I want.", "Uh-oh.", "Tonight was awesome,", "and I loved hanging out with your dorks.", "What? Aw, yeah.", "You know, the word \"dork\"", "is actually a Celtic word meaning \"lungfish.\"", "Kylie, I'm trying so hard.", "This is where he told me to wait for you.", "Oh, my God. This is the corner where", "John McClane met Zeus Carver in Die Hard 3.", "Oh, Charles. Yes, you're here.", "What's going on? How did you find me?", "Did you solve the puzzle?", "No, they didn't.", "They cheated again.", "Reginald.", "Hey, man, look. I just wanted to say I'm sorry.", "No, I'm the one who should apologize.", "I overdid it tonight.", "I wanted everything to be perfect, because", "it's our last big night before you get married.", "I guess I was a little worried", "things were gonna change between us.", "Oh, Charles. Come on.", "Of course, things are gonna change.", "I'm getting married.", "I mean, didn't you make me less of a priority", "when you and Genevieve got together?", "Yes. See?", "I mean, no matter what, we'll always be best friends.", "Hey, you know why I didn't like your scavenger hunt?", "'Cause it was stupid and overcomplicated.", "And way too long.", "There was no food. Or drinks.", "This is not a group conversation, guys.", "Well, you could have stood", "a little farther away from us then.", "Point taken.", "I didn't like it because", "you got kidnapped right at the beginning.", "You were gone for six hours.", "I wanted to spend my bachelor party with you.", "I can't believe you pissed off", "Reginald VelJohnson just to find me.", "Oh, please. He'll get over it.", "No, I won't. You've made an enemy for life.", "And I'm telling Bruce Willis you suck.", "That's fine. I'm fine with that.", "It's good. What's important is that", "we made up, my best friend.", "Not Bruce Willis.", "To Jake and Amy!", "To Jake and Amy!", "To us!", "Hey, so I need to tell you something.", "I had to cancel the wedding band,", "because I kind of dated one of the dudes in it.", "Yeah, I know. Man bun.", "He left me a very long message", "with a lot of details. Oh, no.", "He seems like a really passionate guy.", "I'm never gonna live this down.", "No, you are not.", "I'm just kidding. I'll never bring it up again.", "Thank you. You're the sweetest.", "I love you. I love you too, Turtle Bug.", "Oh, my... Yeah.", "Uh, do I still need to be here?", "Yes, Reginald.", "We're all toasted and we need rides home!", "It's Reginald Vel Johnson!"]