[">Santiago, your test results", "from the sergeant's exam have arrived.", "Ooh, everybody make room.", "Amy needs adequate space to do her signature dork dance.", "I don't know if there's going to be a dork dance.", "I mean, look how small that envelope is.", "That's not a big, good news envelope.", "That's a little, bad news envelope.", "What? That's nuts. Sarge, tell her envelope size", "- doesn't matter. - If I'm being honest,", "- I got a much bigger envelope. - Oh, God.", "Unhelpful, Terry. Very unhelpful.", "- Mine was bigger, too. - Okay.", "I just won't ever open it.", "That way, I'll never get rejected.", "- Fine, I'll open it. - No!", "Oh, whoa!", "Do it harder.", "I opened it.", "- You passed. - Oh, my God.", "I'm going to be a sergeant.", "You're going to be a sergeant!", "Yes!", "♪ Oh, ho, ho, no, it's happening. ♪", "Whoo!", "- Yeah! - That's my future wife!", "So...", "*BROOKLYN Nine-Nine* Season 05 Episode 15 Episode Title : \"The Puzzle Master\"", "Amy Santiago, put down that melon,", "for you are about to feast your eyes", "on one of the most delicious cases in the NYPD.", "I don't like the personality I've chosen here.", "I do. You sound like Caesar Flickerman", "welcoming new \"Hunger Games\" tributes to the Quarter Quell.", "- What's going on, Jake? - In one week,", "you will officially become a sergeant.", "Which means this case will be the last one", "we ever work together as detectives, so it has to be perfect.", "I present to you a serial arson case.", "- Mm-hmm. - And the fires seem to be", "connected to the Saturday crossword puzzle.", "- Mama like. - Two different buildings,", "two consecutive Saturdays,", "and a puzzle left at each crime scene,", "and a note was sent to the puzzle's author,", "- Mr. Melvin Stermley. - Melvin Stermley?", "He's the best in the game!", "He made a puzzle once where all the answers", "were just the word \"puzzle\" in different languages.", "- In Estonian, it was moistatus. - Yeah, well, your moistatus", "is about to be hecka moist...", "don't call HR, we are getting married...", "because Melvin Stermley is coming in", "- to help us with the case! - Sha-wing!", "Hey, I was going through your calendar for some reason.", "- It's your job. - Right.", "Anyhoobs, I wanted to remind you about the commissioner", "candidate meet and greet, and your presentation", "to the selection committee.", "Being that I am your campaign manager...", "- You are not. - I did a little sleuthing", "on your rivals. You want me to spill the beans?", "Why would you ever intentionally spill beans?", "They're one of nature's most densely packed protein sources,", "and they remain unsullied by flavor.", "Okay, forget it, I'll just mosey on out.", "Fine, fine, tell me everything.", "All right, have a seat. It's Gina time.", "Say hello to your compe-tish.", "Bryan McCann, John Kelly, and John Kelly.", "Yes, that's right, there are two John Kellys.", "How are these not the same man?", "You should see their wives. Or should I say, wife.", "Good God, do you know what their speeches are about?", "I do.", "\"Staying the course.\"", "\"Maintaining the course,\" and", "\"Blazing a path to a new future.\"", "I'm kidding, it's \"Remaining on the course.\"", "Unbelievable, none of these men", "have any interest in advancing the NYPD.", "That's right, because they're dinosaurs.", "But do you know what kills dinosaurs?", "- Asteroids? - No.", "You-steroids.", "You are going to kill these dinosaurs.", "Hey, hey dum-dum. What are you thinking?", "Introducing Amy to her celebrity crush?", "- Are you insane? - Relax, Charles.", "It's not a crush, it's her nerdy crossword puzzling hero.", "I mean, the guy's got to be a massive dork.", "His name is Melvin Stermley, for God's sake.", "Jake, he's here. Come meet Melvin.", "Hey, you can call me Vin.", "But, where is nerd?", "Whoa, is this a new detective car?", "It sure is, I put in the paperwork", "18 months ago, and got lucky. They fast tracked it!", "Say hello to the Nine-Nine's brand new, fully loaded,", "sweet-as-hell crime-crusher on wheels!", "Holy crap, it has a heads-up display with built-in license plate reader.", "Who cares. It's got two burrito holders.", "- Those are cup holders, Scully. - Oh yeah?", "Then what am I supposed to use my thighs for, genius?", "Wait, who are you assigning this car to, Sarge?", "Um, I was actually thinking I'd get this one.", "- Seriously? - You suck.", "Whoa, the heater in my detective car", "hasn't worked in two years. I don't have enough body fat", "to keep warm, Terry's sick of shivering.", "Okay, just seems a little selfish", "to keep it for yourself when your detectives,", "who you took an oath to protect,", "are stuck driving their crappy old cars.", "- Mine's the oldest. - I've never felt so abandoned.", "And I was actually abandoned. They found me in a swamp.", "Fine. We'll do a drawing for it.", "But until then, no one touches it.", "Oops, too late.", "I left a ranch handprint on the windshield.", "Okay, so here are your puzzles", "from the days the arsonist set the fire.", "This is really good, Amy, thanks.", "Hey, so Vin, just curious. Would you say you have", "the typical physique of a puzzle maker, or?", "Well, each puzzle only pays a couple hundred bucks,", "so I mostly make my money modeling.", "- Primarily swimwear. - Yeah, I hear that.", "I could do that too, but I make pretty good money here,", "so I don't really need to.", "Anyways, let's talk about the case.", "So here's the letter that the arsonist sent to Vin.", "\"Your clues I discombobulate to teach you to conjugate,", "the fool who fails to validate will watch as I conflagrate.\"", "It seems like he's using my crossword to tell me something.", "Oh, maybe we should look at anagrams of the answers.", "That's really good, \"o nasty amiga!\"", "Oh, what?", "He re-arranged the letters of \"Amy Santiago.\"", "He anagrammed me! Vin, do Jake Peralta.", "- I doubt that's even possible. - Eat a jerk, pal.", "What, no one's ever said that phrase.", "I really think this anagram approach makes a lot of sense.", "Seriously? Let's do it.", "I'll take even clues, you take odds.", "Great, and I will take everyone's coffee order.", "- That's equally helpful. - I don't drink coffee.", "- But I'd love a kombucha. - Great, I'll just...", "walk to the kombucha store.", "- Everything okay? - Yeah, of course.", "You can't wear a coat over a tank,", "- You're not Ryan Gosling. - Feeling jealous, buddy?", "No, not at all. I mean, I am a little surprised", "that somebody named Melvin is so bodacious,", "but I feel that jealousy is an ugly emotion.", "- That you are feeling. - And I'm just glad", "that Amy is spending some time with her hero.", "- Who is super hot. - Charles, let it go.", "- And smart. - I'm serious, stop.", "And hilarious.", "Eat a jerk, pal!", "So, how's it going in here?", "Vin, I see you're still coatless.", "- I run hot, like a wolf. - Oh, I see.", "I wonder if the word \"conjugate\"", "in the arsonist's letter means we should", "- focus on the verb answers. - Cool, I love verbs.", "Second favorite part of speech.", "- After prepositions. - After prepositions.", "Yeah, words are cool.", "But maybe we should switch gears a bit,", "and get back to some good old-fashioned police work.", "- What are you thinking? - Well, whoever's setting", "these fires is clearly trying to humiliate Vin.", "You know, make a puzzle he can't solve.", "So maybe we should focus on people that don't like you.", "Jake has a point about motive.", "Maybe another puzzler wants to take you down.", "Well, if you're looking for a puzzle head,", "I'm hosting a crossword night at the Turnkey Bar tonight.", "Oh, I've always wanted to go there.", "That place is a total puzz-hang.", "Ah, gross, all right, so we'll go undercover,", "chat some people up, and see if we can't find our arsonist.", "- Good idea. - Oh, Amy likes my plan.", "Great, so Vin, why don't we just get this coat back on you,", "and I'll help you get out of the door, here.", "And we'll see you tonight, okay, bye!", "- The best. - Right?", "Yeah!", "Wow, the competition looks even older in person.", "What do you think these dinosaurs are talking about?", "Where to find \"Matlock\" reruns?", "Be professional, Gina.", "Like the homecare nurses", "who will tuck them into bed tonight.", "- Oh, hello, John. - Raymond.", "I just want to say what an honor it is", "to be up for the same job as a man", "with your... experience.", "Thank you.", "I paused suggestively before I said \"experience,\"", "so he would know it wasn't really a compliment.", "Who are you talking to? I invented the pause.", "- Raymond Holt, - I'm Captain Olivia Crawford.", "I'm the new candidate for commissioner.", "- Oh? - Excuse me?", "Yeah, I replaced the other candidate.", "He retired to spend more time with his grandchildren.", "Anyway, I just wanted to say what a privilege it is", "to be up for the same job as a man with your... tenure.", "- Oh, damn, she paused, dude. - In error, I am certain.", "Olivia, I may be older than you,", "but I am not some dinosaur", "intent on maintaining the status quo.", "For example, I would add a social media officer", "- to every precinct. - Interesting.", "I plan on eliminating precincts all together.", "What, no precincts? That's not how we do things.", "That's exactly what both John Kellys said.", "Oh no, she's the asteroid.", "And I don't want to say you're a dinosaur, but...", "You're a dinosaur.", "Wow, a whole crowd full of puzzlers.", "Gotta be honest, I'm a little disappointed", "no one's wearing a green suit covered in question marks.", "That guy has crossword puzzle pants.", "- Does that scratch your itch? - Very much so, thanks.", "All right, we should probably start talking to people in line.", "Pardon me there, fellow puzzler.", "What do you think of Melvin Stermley?", "Uh, you mean my future husband?", "Oh, so you like his puzzles?", "And his face, body, and brain... and body.", "Honestly, Vin makes all other men", "seem really stupid and ugly.", "Okay, well, thank you for your", "very candid and hurtful input.", "You must solve one of Vin's puzzles to enter.", "Rearrange the letters of this phrase", "to reveal a place in the world.", "\"Meet a brainier stud, a.\"", "Oh, come on, there's no place with that many letters in it.", "I mean, most places are, like, four letters.", "- You know, park, mall, dump... - United Arab Emirates!", "You may enter.", "Uh, you must each answer a puzzle.", "Oh... great.", "Unscramble the letters in this phrase", "to reveal the name of a film based on a classic novel.", "- Okay. - \"Sad anus loser, I go in\"", "You know, I feel like these puzzles are actually very pointed.", "Forget it, I got this.", "Uh, A, R, uh...", "Puzzle solved.", "Who's the anus loser now?", "It's still me.", "Okay, one of us is about to get access", "to the best detective car ever, and everyone else", "will go back to driving junk cars", "for the rest of your junk lives.", "Damn, Sarge, that took a dark turn.", "I want seat warmers. I want them bad.", "I need this car too.", "I'm sick of riding my Vespa to work every day.", "Well, being on the seat behind you is no picnic either.", "All right, here it goes.", "What?", "Oh, my God, it says \"Terry.\" I won!", "♪ Terry got a car, Terry got a car ♪", "No way. You cheated.", "What? I didn't cheat.", "I bet every slip in there says Terry.", "He filled it full of fake people.", "- Who the hell is Norm? - That's Scully's first name.", "- It is? - Stop being sore losers.", "I won fair and square.", "No, you won unfair and un-square,", "- and I'm going to prove it. - And if we can't,", "- we'll plant it. - No.", "Charles, I need your help.", "What's the best way to dry out a pant leg that's", "- been soaked in toilet water? - Wait 28 minutes.", "Trust me, that's how long it takes for toilet pants to dry.", "Well, I can't just be standing around", "for half an hour while Amy chats it up with Vin.", "Ah, so it's not toilet water. You're drenched in jealousy.", "I told you before, jealousy is an ugly emotion that I don't feel.", "Besides, Amy picked my plan to come here.", "Why would I be jealous of Vin?", "Because of his body, and face, and brain... and body.", "Why does everybody say \"body\" twice?", "Oh, hang on a second.", "- Somebody's coming. - Vin is on fire tonight.", "- He's phenomenal. - No wonder the Saturday", "crossword replaced Sam with him.", "- Sam must be pissed. - I heard the only place", "that buys his puzzles now is \"Parade\" magazine.", "The hardest clue he had in his last one", "was a five-letter word for a game", "- popular in nursing homes. - Bingo.", "I figured out who the arsonist is.", "It's this guy named Sam. He's a puzzle maker.", "- And Vin took his job. - Sam Jepson?", "Oh, he's not the arsonist.", "He's been out of town for weeks.", "And he's one of my closest friends.", "He let me stay on his couch when Anna Kournikova and I broke up.", "Well, I mean, she never won a major, so.", "All right, fine, if I'm so wrong, what did you guys find?", "Both fires were located", "at the intersection of numbered streets.", "If you match those intersections with the same", "intersections of the numbered clues in the puzzles,", "you get the letters \"MA\".", "We think the arsonist is spelling his name.", "We can build a puzzle around that, and catch him setting his next fire.", "But we have a suspect with a crystal clear motive.", "I think we need to solve this like cops, not puzzlers.", "I hear you, Jake. But people who make crosswords", "love hiding their names in their puzzles.", "It's our version of a self portrait.", "All right, you know what?", "Amy, it's your last case, you decide.", "Should we go with Vin's wacky little plan,", "or should we go with Sam Jepson,", "my exceptionally solid lead?", "I see where you're coming from, Jake, but this is Vin's world,", "and I think we should go with his strategy.", "- Sound good? - Yeah.", "- Yeah, sounds great. - Okay, great.", "- Let's go. - Yeah, let's go.", "Oh, no, ugly emotion.", "Okay, so we think the arsonist is using the fires", "to spell out his name.", "The most common third letter", "in names that start with \"MA\" are L for Malcolm,", "X for Max, R for Mark, and T for Matthew.", "Or his name is Sam, and he's spelling it backwards.", "Uh-huh.", "Let's just stick with the LXRT plan.", "- Copy that. - Vin designed today's puzzle", "using only one of each of those letters.", "Isn't that the craziest thing you've ever seen?", "I don't know, I mean, remember that time", "we investigated the disappearance of Mrs. Jackson,", "and it turned out her parrot ate her, bones and all?", "- That was pretty crazy. - That was crazy.", "Yeah.", "So tonight, we'll stake out the intersections", "that correspond to where the L, X, R, and T are", "in Vin's puzzle, and hopefully catch the arsonist in the act.", "I'll take the MAT corner, you take the MAR corner,", "and we'll have patrolman take the MAL and MAX.", "- Cool? - Yep, very cool.", "Okay, great, I'll get the surveillance equipment.", "Shame.", "Shame, shame, shame.", "I can't believe you're doing Vin's plan.", "Will you relax? I'm only doing it", "because someone else is going to do my plan.", "- Who? Oh. - You.", "While I'm busy watching nothing happen on my stupid corner,", "you're going to stake out Sam's apartment.", "Then when he sets a fire, Vin is going to look like a dummy.", "That's right, use the jealousy, Jake.", "It will give you unimaginable power.", "Yes, yes, I can feel it coursing through my veins.", "- Oh, my hand cramped. - Oh.", "Oh, it's stuck in a claw.", "- It's a claw now. - Oh.", "Oh, no, no, no, no, no. What are you doing?", "You're snacking? This is from the guy", "who told me that eating finger foods", "was the one true sign of depression?", "Then watch me chew, Gina.", "I'm a creature of the past. I'm a dinosaur.", "No, you are not, you're the best man for the job.", "And I think you know what you have to do to get it.", "Believe in myself and give a great presentation?", "Not even close.", "That's the head of the committee over there, gorging on crab cakes.", "Just go up to him and sabotage Olivia.", "Um...", "- I don't think I can do that. - Well, you can't really be", "the best commissioner the NYPD has ever had", "if you're not the commissioner.", "Right. You're right, I want this.", "And I will do good things for the city.", "Yes, you will. Now, get over there,", "and crap all over Olivia's ideas.", "- Patrick, nice to see you. - Hello, Raymond.", "- Shall we small-talk? - Mm.", "I've been thinking recently about how vital", "the existence of precincts is to the NYPD.", "Oh, you spoke to Crawford.", "She's very forward thinking, isn't she?", "I suppose you could call it that.", "I mean, I wouldn't, but...", "Ray, you don't need to worry about her.", "Between you and me, we had to nominate a girl for PR reasons.", "There's no way the NYPD", "is ready for a female commissioner.", "- Oh. - Hey.", "Grab a crab cake before we start.", "Real crab, big chunks.", "Okay, no one saw Sarge", "do anything suspicious on the day of the drawing.", "- We got nothing. - Speak for yourself, sister.", "We found a smoking gun.", "Play it, Hitchcock.", "- Voila. - Bah-boom.", "- What, I don't see anything. - Focus on the butt.", "- The butt don't lie. - He squeezed his cheeks", "- before he opened the slip. - He knew his name was on it.", "It was a pre-emptive celebration clench.", "I don't know, we need better proof than a butt clench", "- to take down Terry. - I did it, okay?", "I cheated. I wanted that car, and I took it.", "And it's killing me. I couldn't sleep all night.", "I just kept hearing the blinker.", "You-cheat, you-cheat, you-cheat.", "Here are the keys. Take the damn car.", "Terry doesn't deserve it.", "And that is why I became a cop.", "Hey, Charles, nothing's happening on my MAR corner.", "- Any movement at Sam's place? - No, I did, however, see", "a cool-looking dude in a ponytail on a Razor scooter.", "I have to admit, I like the look.", "Is it possible I'm wrong, and Sam is out of town?", "Vin's plan is actually kind of smart.", "- Jake, I have eyes on Sam. - Yes, suck it, Vin.", "My judgment is clear, and I am a genius.", "Charles, I'll be right there.", "But enough about the crab cakes.", "Our first presentation tonight", "will be from the 99th precinct's", "Captain Raymond Holt. - Raymond?", "Let me begin with a hilarious joke.", "I'm surprised I was on the short list for commissioner.", "After all, I am six feet tall.", "Actually, what I have to say tonight is no laughing matter.", "I was just told by a member of the selection committee", "that they have no intention", "of ever choosing a woman to run the NYPD.", "I suppose I should have been relieved,", "because Captain Crawford is a damn qualified candidate.", "But as someone who has been denied opportunity", "because of who I am,", "I cannot stand by and watch it happen to someone else.", "So, I will be reserving my presentation", "for a selection committee that will judge", "all of the candidates fairly.", "And let's be honest.", "The crab cakes were only so-so.", "Thank you.", "All right, talk to me, what's happening?", "- What's Sammy up to? - Well, he just sat down", "- on the plaza. - Okay, he's opening up", "his backpack and pulling out what appears to be a thermos.", "Possibly containing some sort of accelerant-like gasoline.", "- Yup. - No, he's eating it", "with a spoon. It's soup, he's eating soup.", "Well, maybe he's fueling up for a night of starting fires.", "He just pulled out a lighter!", "Nope, it's not a lighter. It's a bumblebee PEZ dispenser.", "- Hmm. - Ooh, he's making a phone call.", "Quick, get the parabolic mic.", "Mom, I did something bad.", "Yeah, you set some fires.", "I proposed to Gretchen, and she said no.", "- So you set some fires. - So, I left Myrtle Beach.", "Two weeks ago, and then you set some fires.", "No, I got back home today.", "Yeah, all my fish were dead.", "Okay, so Sam didn't do it.", "I should probably get back to my corner.", "Just for the record,", "just because I was wrong about Sam,", "does not mean that Vin was right.", "Well, this is disappointing.", "I can't believe you left your post.", "What, the plan wasn't yours,", "so you didn't think it was worth following?", "Well, because of your juvenile behavior,", "one of our city's finest...", "abandoned lard factories is now burned to the ground.", "My gut told me that Sam Jepson was setting the fires.", "Although I now realize his actual life", "is much sadder than that of a serial arsonist.", "But we agreed to do Vin's plan.", "So what? Vin is not a cop.", "Why do you keep siding with him instead of me?", "Oh, let me guess, because he was right,", "and the building was on fire, and he's perfect?", "Wait, are you jealous of Vin?", "Jake?", "All right, I didn't want to say anything", "because it's a gross emotion, but yes, I am a little bit", "jealous of the super smart supermodel.", "This was our last case together.", "And you and him have been joined at the hip.", "Or in his case, that super sexy V muscle", "that I don't understand how to tone.", "He told me, it's a lot of bicycle crunches.", "Crunches on a bicycle?", "That's crazy, you would just fall right off.", "Babe, you have no reason to be jealous of him.", "I just...", "I don't want you to wake up one day", "and with that you were with someone as smart as you are.", "I am with someone as smart as I am.", "You.", "You're a brilliant detective.", "I love the way you think.", "That's why I want to marry you.", "Marry me.", "Marry. Oh, my God, look.", "The arsonist spelled MAR, but they were going to spell", "M-A-R-R-Y! Or...", "Conjugate. Conjugate means marry!", "Yes, and who wants to marry Vin?", "- The lady from the bar! - The lady from the bar!", "Hey, puzzle chick, unscramble this.", "You're going to \"ailj.\"", "All right, Sarge. The car is yours.", "What? Why?", "- I don't deserve that car. - I don't know about that.", "I went back and watched the tapes to figure out how you did it.", "Right before the drawing,", "you got a peanut butter cup out of the freezer.", "The thing is, you don't eat sugar past 4:00 p.m.", "Could have been a cheat day.", "Oh, it was definitely a cheat day.", "You froze your slip of paper,", "so that when you pulled the name,", "all you had to do was find the cold one.", "So.", "You thought the way I cheated", "was so cool, you gave me the car?", "Yeah, but also while I was watching those tapes,", "I noticed all the nice crap you do for people.", "You got Gina a cushion for her chair.", "You let Charles show you 130 pictures", "of Nikolaj brushing his teeth.", "You Heimlich'd Scully twice.", "- On the same peanut. - I also solved a murder.", "Yeah, we all solve murders, but you,", "you let Hitchcock borrow a pair of your socks,", "because his somehow disintegrated.", "Anyway, I'm sorry I guilted you in the first place.", "- You deserve that car. - Thanks, Diaz.", "How did you get Hitchcock and Scully to agree to this?", "I washed their car and told them it was a new one.", "They're napping in it right now.", "Smart!", "- Hello, Captain Holt. - Ah, Captain Crawford.", "To what do I owe the pleasure?", "Captain Crawford is here to see you.", "Thank you, Gina.", "So, it would seem that we have become frenemies.", "- Do you know what that means? - Are you trying to imply", "that I'm too old to understand a portmanteau?", "I am not, but I am too dignified to use one.", "Friend-enemy.", "I just wanted to thank you, for your brave speech.", "The mayor's office has replaced", "the selection committee with a less biased one, so.", "Feel free to start calling me commissioner now.", "The only time I plan on calling you", "- is to hear you concede. - It's going to be hard to hear anything", "once I've crushed you into a fine powder.", "A fine powder that will choke you until you die.", "May the better candidate win.", "She will.", "Captain Crawford left.", "So, we brought her in this morning,", "and she confessed immediately.", "Hi, Vin, I love you! Did you see my fires?", "Turned out, she was writing something.", "Specifically, \"marry me, or else I will kill you.", "Yours forever, Helen Gorbelson.\"", "- Wow, that's so many fires. - So many fires.", "Thank you for catching her. With a brilliant puzzling mind", "like yours on the case, it was only a matter of time.", "Actually, Jake solved it.", "He's kind of a genius with this stuff.", "Oh, thank you, then.", "Couldn't have done it without your help.", "So I guess that's that.", "I should probably run if I'm going to make it", "to the Javits Center by four.", "They're making a mold of me for the upcoming Bodies Exhibit.", "As they should, your body is great.", "- And that's okay. - Thanks, man.", "You should join me for a puzzle night sometime.", "- Oh. - No!", "Jake is taken. He already has a friend.", "Hang out offer declined.", "Now let's strut your centerfold ass out of here."]