[">Thank you, Margaret.", "You're welcome, Raymond.", "- Seamus Murphy. - That's right.", "Remember how I saved your detectives from prison", "in exchange for a favor?", "- The time has come... - Wait.", "- This isn't my order. - What?", "This is an omelet. I only eat omelets on vacation.", "Yeah, I don't care what you eat.", "I'm here to call in the favor that you owe me.", "Really? What if I say no?", "This is you asking me for intel", "and promising to pay me back.", "How do you think this would look to your bosses,", "especially now that you're up for the commissioner job?", "Yeah. I know everything.", "So...", "what do you want from me?", "A permit to throw a block party?", "We don't even have to break the law.", "This is fantastic news.", "I am not giving Seamus Murphy that permit.", "He only wants to use the block party", "as a cover for something criminal:", "a robbery, a murder, or something worse.", "You don't know that for sure, and that's your loophole.", "- I don't believe in loopholes. - What? Loopholes are the best.", "Remember that time when Pancake Palace had", "that all-you-can-eat deal, but they didn't set a time limit?", "I ate pancakes for a week for $3.99.", "All I had to do was sleep there and never shower.", "What? Thanks for the invite, friend.", "I will not be using a loophole, Peralta.", "As always, I'll be using the main hole", "or no hole. I choose no hole.", "You just said \"hole\" way too much, sir.", "And that's coming from Charles.", "Yes, that's concerning.", "Ugh, you think you know someone, Jake.", "Unbelievable!", "Sync &amp; corrections by emeline-whovian www.addic7ed.com", "Captain, we think we found a way for you", "to do Murphy the favor and still live with yourself.", "Sounds like a loophole.", "Nope, we found the main hole, and it is open for business.", "- Oh, gross. - Yep, sorry. Look.", "You don't want to give Murphy the permit", "because you're afraid he's gonna use it as a cover", "for something illegal, but what if we figured out", "what he was up to and could stop him before he did it?", "That way you could give him a permit with a clean conscience.", "Well, how are you gonna find out what his real plan is?", "He's smart, and he doesn't talk to anyone but his family.", "I was worried about that, too, but that's when I remembered:", "\"The Godfather.\"", "The Diane Keaton movie.", "No one refers to it as that, but Charles is right, she is in it.", "This isn't one of your movie plans, is it?", "First of all, if we had developed a \"Minority Report\"", "style pre-crime division like I suggested,", "we wouldn't be in this Seamus mess, and it's not just because", "I wanted to go like this, although I did.", "But secondly, in \"The Godfather,\"", "Don Corleone had three sons: Michael, his favorite...", "- Diane Keaton's husband. - Mm-kay.", "Then there was Sonny, the hothead.", "Diane Keaton's brother-in-law.", "Charles, you're being distracting.", "No, he's not, he's actually helping me to follow this.", "Continue going through Diane Keaton's relatives.", "Fine, Diane Keaton's other brother-in-law is Fredo,", "the screw-up, the weak link.", "And you think the Murphys have a Fredo?", "Every family does, and in this family,", "his name is Kyle.", "- Is he on a roller coaster? - Yes.", "It's his driver's license photo somehow.", "He's never had a job, he took six years", "to graduate high school, and his father paid $200,000", "so he could attend the University of Arizona.", "Lake Havasu campus.", "Sir, this kid is a disaster.", "If there's anyone that's gonna give us info", "on the Murphy family and slip up, it's Kyle.", "Okay, but if you don't figure out what his plan is,", "I don't give him that permit.", "- Understood? - Yes, sir.", "All right, go make contact", "with Diane Keaton's brother-in-law.", "Fredo. It's Fredo.", "It's one of the most popular movies of all time.", "Won best picture, so.", "Ready for a kick-ass assignment?", "Hell yeah.", "Let's do this.", "Wait, what do you mean by \"kick-ass\"?", "Holt wants us to get that block party permit.", "Damn it.", "I guess I'll take the knife out of my pants.", "No, come on, Rosa. It'll be so cool.", "We get to go to SAPO,", "the Street Activity Permit Office.", "It is the oldest continuously operating permit office", "in the state.", "Pass. Find somebody else.", "But we promised to help Captain Holt.", "Look, it'll be quick.", "We'll just go, get Murphy his permit,", "and maybe grab a few shots for the 'Gram.", "They have the original permits for the 1939 World's Fair.", "- No. - Yes!", "- No. - Yes!", "No, I mean, \"No, I don't want to do this.\"", "No, yeah, come on. We're gonna do it.", "Hey, Gina. How's it feel to be back?", "- Any trouble adjusting? - Adjusting to what?", "To life as a working mom.", "You have to juggle the baby,", "the job, your new business.", "Terry, juggling isn't hard.", "That's why the salary for jugglers is so low.", "Name one rich juggler.", "Doesn't Dave Coulier juggle?", "If you're reaching for Coulier,", "then you've already lost the argument, Terr-Bear.", "But there is one thing:", "I need a private place where I can pump.", "I was thinking maybe I could take this whole floor", "and you guys could move down to that place where we park.", "The garage?", "Sure, if you think that works.", "Well, there's an empty office behind records.", "It's nice and quiet.", "We can put in a comfy chair,", "maybe a mini fridge.", "Uh, that would be a no-go, Sarge.", "- That's our nap room. - She needs to pump.", "- The room is hers. - Whoa.", "That escalated fast.", "Okay.", "There's our Fredo.", "He comes in here every day at noon, for some reason.", "Hey, change the channel, dude.", "\"Finding Bigfoot\" is starting.", "All right, let's go over our covers one more time.", "We are small-time operators", "that just moved here from Miami.", "We piloted go-fast boats, moving contraband to Cuba.", "Where we slept with the same prostitute.", "- No. - And she said you were", "- the best she ever had. - Maybe.", "And I should watch you to learn.", "Back to no... let's just not talk about our sex lives.", "All right, we've got a week,", "so we can ease our way into this thing.", "Let's not blow it by engaging right away.", "Oh, no. We made eye contact.", "He's coming over here. We're engaging right away.", "Hey, what's going on?", "I saw you guys staring at me.", "What? No, no, no, no, no.", "We were just looking at the TV behind you.", "We love \"Finding Bigfoot.\"", "- It's our favorite show. - Yeah.", "I mean, why haven't they caught him yet, right?", "Totally.", "I mean, he's so big. You'd think it'd be easy.", "- Yeah. - Yes.", "Oh, my God, I'm feeling a real connection here.", "Should we hang out sometime, or am I being crazy?", "You're not being crazy, Kyle.", "How do you know my name?", "Because we're so connected.", "Oh!", "- Yes! - What?", "So, this is my pad.", "TV room, recording studio", "where I lay down my raps.", "And this is where the magic happens.", "It's where I practice doing magic.", "Oh, so literally, then.", "- Love all the lamps. - Thanks.", "I accidentally ordered 100 lamps instead of one.", "They only give you, like, a six-month return window, so.", "- You get it. - Totally.", "Man, this place is huge. How do you afford it?", "Do you have, like, a great job or family money?", "Yeah, lots of it, I'm part of the Murphy crime family.", "- Oh. - Aw, damn it.", "I am not supposed to say that.", "We're not a crime family, okay?", "- We're a cream family. - Dude, it's fine.", "Honestly, we're also involved in... cream.", "- Organized cream. - Cool, cool.", "Hey, just checking... you guys mean crime, right?", "- Yes. - Okay, good, right, go on.", "Well, we're actually looking for some work right now.", "We just got into town from Miami.", "Where we didn't sleep with the same prostitute.", "Yes, anyways, do you think your family needs any help?", "- Any big jobs coming up? - Uh, wouldn't know.", "They don't tell me anything. They're mad at me.", "What? Why?", "I used to drive for my uncle Seamus.", "One day, he had this big cream meeting...", "We don't have to keep doing that.", "Okay, cool. He was torturing some guy.", "Anyway, I was waiting in his favorite car,", "a white 1980 Rolls-Royce,", "but he was taking forever,", "so I decided to go catch a matinee of \"Suicide Squad.\"", "And he was pissed that you drove off in the car?", "No, obviously I left the Rolls there", "with the keys in the ignition in case he needed it,", "but guess what happened?", "- It got stolen. - Oh, my God.", "- How'd you guys know? - We're just connected, Kyle.", "- Team Bigfoot. - Team Bigfoot!", "Anyway, they kicked me out of the family business for good.", "Apparently, I'm a \"liability\" and \"worthless\" and \"Kyle.\"", "The last one is just my name, but you should hear their tone.", "So, you don't know about anything", "that's going down at all?", "No, but if you know anyone", "who's looking to buy a lamp for really cheap,", "I know a guy.", "- Oh, Kyle. - Yeah, that's it.", "That's how they say it.", "This is taking forever.", "Can't you just forge the signatures?", "I'm a notary, Rosa.", "You can't say stuff like that around me.", "I could lose my stamp over that.", "I've never met anyone who cares so much about stupid bureaucracy.", "Bureaucracy is not stupid.", "It's elegant.", "It's a beautiful puzzle", "waiting to be cracked.", "Every rule, every form has its purpose.", "It all fits together,", "and when the puzzle is solved", "and you take a step back and see the big picture,", "it's like staring into the face of God.", "Hey.", "- We moved up a spot. - Oh.", "You seem like a real nerd.", "Hello, Muriel.", "Another day in paradise?", "She actually means that. Please don't be offended.", "Great. What do you want?", "To apply for a block party permit.", "Here is form 1290.", "Oh, wait, you trying to get a permit for this Friday?", "You would need...", "1290-B expedited request", "and a 1021-J adjustment waiver", "and a sweet, sweet P-28-P supplemental.", "Right. There's just one problem.", "What? No. I did absolutely everything.", "The 1021-J has to be submitted", "with an approved 1290.", "But I'm submitting the 1021-J to get the 1290 approved.", "- That doesn't make any sense. - I guess it doesn't.", "Okay. Okay, okay.", "This is just a puzzle, and I can figure it out.", "To get an approved 1290,", "I need an approved 1021-J,", "which I can't get without an approved 1290,", "which I can't get without an approved 1021-J,", "which I can't get without an approved 1290,", "which I can't get without an approved 1021-J,", "which I can't get without an approved 1290,", "which I can't get without an approved 1021-J...", "Okay. She's in a loop.", "You broke her brain. I'm gonna take her out of here.", "Which I can't get without an approved 1290,", "which I can't get without...", "Sarge, Hitchcock and I just uncovered something huge.", "- You solved a crime? - What?", "That's insane, no. It's about our nap room.", "Guess how long Gina's been pumping for?", "- I don't want to... - The last hour.", "Now, everyone knows Gina's using", "a Nodella Harmony Breastpump", "with 2-Phase Expression Technology", "for faster milk expression.", "You shouldn't know so much about breastpumps, Hitchcock.", "Well, you should know more about", "what's going on in your precinct.", "Given the Nodella's exceptional flow,", "there's no way she needs to be pumping", "more than 20 minutes a side.", "Wow, you didn't even say \"breast.\"", "Yeah, because I'm not a child.", "I need my afternoon nap.", "Okay, what are you guys trying to say?", "Come with us.", "Where's Gina?", "She just left the pump running and disappeared.", "- You got played so hard. - You cuck.", "So, did you make contact with Murphy's weak link?", "- Diane Keaton's brother-in-law? - Yes.", "We're real tight, but unfortunately,", "he's such a weak link, his family won't tell him anything.", "So... that's it, then.", "We have no idea what Murphy's really up to?", "I can't morally give him that permit, so it's over.", "Wait. We still have time.", "Maybe there's a way to get Kyle back in with his family.", "Like, what if...", "Ooh, Jake's wheels are turning.", "Your brain baby is crowning.", "Boyle, please. That's disgusting.", "No, it's helping. I am having a brain baby.", "- Then push, man, push. - Breathe.", "You can do this.", "- You are so strong. - Ah, got it!", "Kyle's uncle cut him off because of that stolen car,", "right, but what if we could find that car", "and have Kyle give it back to him?", "Then all is forgiven. Kyle's back in the family.", "Right, but how do we find that car?", "We just did a big sweep of Brooklyn chop shops.", "Maybe Seamus's car is one of them.", "Maybe it's in the impound lot.", "Yes.", "Okay. Put in my password.", "Yes, it's in the impound lot!", "My brain baby's a genius.", "It's a miracle.", "Who's this lady we're meeting?", "The source: Florence Tinj.", "She ran the rules and regs department for 30 years.", "She wrote the forms.", "She has touched every life in this city.", "- Not mine. - Yeah-huh.", "Haven't you ever filled out a mileage reimbursement form?", "No, dude, I make you do those for me.", "Right, I'm so grateful to you for that.", "Anyway, she's the only person that can figure this out.", "She understands the bureaucracy", "on a level that we mortals can't even fathom.", "Florence Tinj.", "What?", "Detectives Diaz and Santiago, NYPD,", "and I just want to say...", "Those cats are having sex.", "Yeah.", "Uh, can you explain these forms to us?", "They seem logically flawed.", "At first, I thought it was a mistake,", "but then I thought, \"There's something deeper at play here.\"", "No, it's a mistake.", "- They don't work. - What?", "But you wouldn't design a form", "that literally can't be filed.", "Yeah, I would. I did it all the time,", "mostly out of spite, but also incompetence.", "Plus, I just found out I'm dyslexic.", "Okay. Thank you for your time.", "Good luck with all your, uh, hoarding, Florence.", "Okay.", "We're supposed to pick up Kyle in a minute.", "We can't just bring him straight to his uncle's Rolls,", "or it'll seem suspicious, so we gotta figure out", "a way to make him notice it on his own.", "What if you drive by and I yell,", "\"Those two birds are having sex!\"", "He'll obviously want to see that,", "and when he looks, voilà.", "The car's right there.", "Or I could just drive by it very slowly.", "- Ah, also a good plan. - Okay, let's do it.", "So, that's when it hits me: savory dinner cereal.", "- Oh, my God. - What?", "Instead of it being cold, what if I heat it up?", "Unless... is that just soup?", "- It is. - You know what?", "I think I left my wallet at home.", "- I'm just gonna turn around. - Dude, look.", "My favorite gamer just uploaded a new vid,", "and his mom is in this one.", "Then Tom Cruise hang glides in with a machine gun", "and he's like, \"This is my party now!\"", "Anyway, if I could make a movie,", "that's how it would start.", "Kyle, look, two birds are having sex!", "What? Where? Aw, man, I missed it.", "Well, let's just turn around again.", "Where are those birds?", "Still no humping birds. Damn it.", "We're never gonna see those birds.", "Look behind that 1980 white Rolls Royce.", "Ugh, I wish that stupid car would move.", "Kyle, isn't that your uncle's car?", "Oh, my God. Dude!", "I did it.", "I found it. I found my uncle's car.", "Victory dance, whoo!", "Oh, no, wait, stop! Don't dance in the...", "- Oh, Fredo. - I think I got hit!", "Ok, why are you barefoot?", "I'm violating uniform conduct code 773", "because the rules are pointless", "because they were written by a hoarder who doesn't care.", "Same here. Fight the power.", "We can't give up now.", "Not when Captain Holt's career is on the line.", "We have to get that permit.", "How? The forms don't make any sense.", "- I mean, is anything even real? - No.", "Odds are we exist in a computer simulation,", "but I don't have time to go down that rabbit hole.", "Look, the fact that these forms are broken is a good thing.", "It means there are many mistakes.", "- Mistakes we can exploit. - That's right.", "This is every form SAPO has put out for 100 years.", "We have to read every single one and look for", "miniscule mistakes that will help us get that permit.", "So you ready for a kick-ass assignment?", "Hell yeah.", "Let's do this.", "Hey, why'd you want to meet out here?", "Because we have a huge surprise for you.", "- You found my birth mother? - What? No.", "The surprise isn't gonna be as good as that...", "I'm sorry I let you guess... but...", "Yeah, after we dropped you at the hospital,", "we went back and stole it for you.", "Now you can give it to your uncle.", "Oh, my God.", "He's gonna finally let me back in the family.", "Fabien, Marco,", "I don't know how I can ever repay you.", "Oh, don't worry about it. It was nothing.", "No, it was everything.", "You guys believe in me, and honestly, it saved my life.", "Remember the other day at the bar when we first met?", "I was all alone and having some pretty dark thoughts.", "- Really? - Yeah.", "I was ready to just, uh, give up...", "- Oh, no, Kyle. - On my rap career.", "Oh, went somewhere different than I thought.", "- I'm glad that you kept rapping? - Thanks.", "You're the two best dudes I've ever known.", "That's nice. And hey, guess what?", "- You did find my birth mother. - Nope.", "I was gonna say you're a great guy, too,", "but I'm sorry I keep teeing that up.", "- But you're looking for her? - Sure.", "Oh, hello, Muriel.", "Ugh. The block party girls.", "Look, I told you, your forms don't work.", "- You're not getting the permit. - Right.", "But we had a different permit in mind.", "This is form 8, as in the eighth form", "ever written for the city of New York.", "Those old forms are all out of circulation.", "They should be, but someone made a mistake,", "and this one was never officially decertified.", "Which means it's still valid,", "which means you have to process it.", "\"Street closure request", "for the public humiliation of loose women.\"", "And, as you can see, you are required", "to expedite processing for the fee of one hay penny.", "Keep the change.", "Okay, but it says here that the form...", "Must be submitted by a man.", "I know. It's a huge bummer.", "- But also... - Hi, there.", "I'd like to humiliate some hussies,", "and I'm in a hurry.", "Pumping hard or hardly pumping, Gina?", "Where were you?", "Uh, just so we're on the same page,", "how long have you been here,", "i.e., how elaborate does my lie need to be?", "- An hour. - Okay.", "The CIA contacted me, and there's some...", "Gina, you cannot use pumping as an excuse to slack off.", "- I wasn't slacking off. - Well, you weren't here.", "Man, I was trying to help you.", "Ugh. I know. I'm sorry, I went home.", "I was missing Iggy and I wanted to see her.", "Oh, well, you could've just told me.", "Yeah, but I was embarrassed.", "I thought I'd be as incredible at being a working mom", "as I am at everything else I do:", "dancing, public speaking, capoeira, ghost hunting...", "You don't have to keep listing things you're good at.", "Earring-making, cabinet renovation.", "But juggling things is hard.", "I feel like a failure. I feel like a Coulier.", "No, you're not a Coulier, Gina.", "Look, being a working parent is hard.", "When my twins were born, I made Sharon", "keep the phone on all day just so I could listen to them.", "One month, I used 25,000 minutes.", "I'm sorry.", "I just realized I told you it sucks and there's no solution.", "That's okay.", "It's kind of nice to hear this kind of thing", "from another parent, so... thank you.", "You know, I don't even think Dave Coulier juggles.", "I Googled it. He doesn't.", "Man... what a trip.", "♪ Rap, rap, spitting rhymes ♪", "♪ Kissing shorties on the lips ♪", "♪ Have no fear, Mr. Rap is here ♪", "♪ And he will drink three beers ♪", "I wish he would turn the radio down.", "You think that's the radio?", "That sounds like professional music to you?", "All music after Mahler sounds exactly like that.", "Now, how do we expect Kyle to transfer the bug to Seamus?", "I got him a very expensive bottle of whiskey", "to give to his uncle as a gift.", "The transmitter's in the cork.", "We planned for everything.", "Oops.", "- What was that? - He broke the bottle.", "He Fredo'd it.", "Oh, so you didn't plan for everything?", "You forgot to idiot-proof the bottle.", "Well, perhaps you want to idiot-proof your criticism,", "because I got him a backup bottle with a backup bug.", "It's a good thing I had another one.", "Oh, no. God!", "And... there goes the backup bottle.", "Right, except for one thing:", "I also put a bug in the keys.", "Of course he did.", "Guy's got more bugs up his sleeve than Oogie Boogie.", "- Don't get the reference. - \"Nightmare Before Christmas.\"", "- Oh. - Shh, shh, shh.", "- They're talking. - Hey, Uncle Seamus.", "- These are for you. - You found my Rolls.", "I'm impressed.", "Hey, welcome back to the family, huh?", "We got a lot of catching up to do.", "Well done.", "Well done. Thank you both.", "We did it. We reunited a family.", "Is this what it feels like to be Oprah?", "You wish.", "OK, here's what we found out from the bug that we placed.", "Seamus is planning on stealing $20 million in bearer bonds", "from an armored truck.", "As we speak, the block party is in full swing.", "Oh, ba, ba, ba, ba, ba. Here you go.", "Turns out, he only wanted a permit", "so the street would be closed down,", "forcing the armored truck to divert", "down a narrow abandoned alley.", "It's the perfect place for an ambush,", "but we changed the truck's schedule,", "so they hadn't picked up the bonds yet.", "Hey, there's nothing in here.", "That truck is as empty", "as Jackson Browne's running surface.", "Empty? \"Running on Empty\"?", "- He sings that song. - Running surface?", "Okay, so Terry didn't like it... Charles?", "- Don't make me do this, Jake. - Whatever.", "The point is, the truck is empty.", "So we did it... I can't believe it's all wrapped up.", "- Do you even know what we did? - No.", "Just feeling out how close we were to calling it a day.", "Soon, Scully. Now that Captain Holt", "has repaid his debt without compromising", "his stupid moral compass, the only thing left", "is for him to get his tape back,", "which should be happening right about... now.", "Oh.", "Your block party's going well.", "Wasn't as much fun as I hoped it would be,", "but, um, you lived up to your end of the bargain, so.", "- I'm a man of my word. - As am I.", "Your tape.", "You ever want to do business again, my door is always open.", "Well, you should close it, lest you get moths.", "Good day.", "_", "Hey, there, sir.", "Top of the mornin' to you.", "Oh, no. What's wrong?", "Why do you always assume something's wrong when I come in here?", "Couldn't I be bringing you good news?", "- Are you? - No.", "Something's terribly wrong.", "- It's Seamus. - What do you mean?", "Forensics confirmed the tape he made of me", "was never copied. We're in the clear.", "It's not about that.", "I was checking our bug, and I overheard him", "talking about what went wrong with the armored car heist.", "He's pinning the blame on...", "Kyle. It has to be him.", "Everything was going great until he suddenly reappeared", "out of the blue.", "I bet that dum-dum ran his mouth,", "and that is the last time he screws over this family.", "He's gonna pay.", "Did he say what he would do to him?", "No, they ran over a huge pothole and then complained", "about de Blasio for the next hour.", "Yes, he needs to do something about the roads.", "Look, I don't specifically know", "they're gonna do something bad to Kyle.", "They might just lightly beat him up, so we could do nothing.", "- We could take the loophole. - You do love loopholes.", "I know we just put Seamus behind us,", "but unfortunately, you've made me a better person.", "- I think we have to help Kyle. - Good.", "I'm proud of you.", "Oh.", "Sorry, it's just...", "you said you're proud of me. That's my tear trigger.", "All right. Let's go save Kyle before the dam breaks.", "_", "- Hello, Seamus. - Hello, Raymond.", "So, apparently, NYPD police came today", "to arrest my nephew Kyle for unpaid parking violations.", "And you want me to, what, clear his record?", "I've already done my favor.", "No, I know it's a cover.", "I know he's in protective custody", "because he helped you stop my armored car play.", "I don't know what you're talking about.", "- No? - You asked me for a permit,", "and I got it. I've paid my debt.", "Now, if you'll excuse me,", "I have a bowl of mush to enjoy.", "You're right. You don't owe me anything.", "But I owe you.", "And what, exactly, does that mean?", "That means you mess with my family, I mess with yours.", "You tell your husband, Kevin, I'll see him real soon."]