[">And so concludes this year's Secret Santa drawing.", "Just a quick reminder of the rules:", "$40 limit, no perishable items,", "and no homemade massage coupons, Hitchcock.", "Fine, then everyone'll have to pay full price for them.", "Oh, Captain. I would like a $40 gift card", "to any restaurant that serves nachos.", "- I don't have you, Peralta. - Not only do I know", "that you do indeed have me, but I also know", "- who everyone else has. - That's not possible.", "Perhaps not for an ordinary man such as yourself, Jeffords.", "But for the brilliant mind of Detective Sherlock Peralta...", "I legally changed my name... it's quite simply...", "elementary.", "For, you see, Amy made a face", "I only recognized from our bedroom,", "which means that she has Captain Holt.", "Charles has Terry. His eyes keep", "- shifting over to him. - No, I don't.", "Terry looked disgusted, which means he has Hitchcock.", "Rosa didn't draw a name, nor did she put one in.", "- She doesn't wanna participate. - Never do.", "Hitchcock moves his mouth when he reads", "and he quite clearly said Charles.", "- I did get Charles. - Scully has Amy.", "He's hold his paper name-side out.", "- Oh, he's good. - And I have Scully,", "which means Captain Holt has me.", "I'll be taking that gift card. Daddy loves nachos.", "Should we draw the names again and leave Jake out?", "ALL: Yeah!", "No! Sherlock wants a present!", "[UPBEAT MUSIC]", "♪ ♪", "Sync &amp; corrections by emeline-whovian www.addic7ed.com", "Okay, quick update on the Warren Street break-in.", "Security cameras caught a picture", "of the suspect and guess what?", "That's right. We got a hot perp alert.", "- [IMITATES AIR HORN] - ALL: Ooh!", "- That's a handsome man. - Mm, I'd like to", "- bring that guy to justice. - We all would.", "But unfortunately, police cornered him", "and he shot himself in the face.", "- [BLOWS RASPBERRY] - All right. Thank you for that", "shockingly dark update.", "- Anything else? - Uh, yes.", "Something I'd like to say.", "I'm a pretty private person so this is kinda hard for me, but...", "here we go.", "I'm bi-sexual. All right.", "I will now field one minute and zero seconds", "of questions pertaining to this.", "- Go. Amy. - How long have you known?", "Since seventh grade. I was watching \"Saved by the Bell\"", "and I thought, Zack Morris is hot.", "And then I thought Lisa Turtle, also hot.", "The fact that the words Kelly and Kapowski", "didn't just come out of your mouth is lunacy.", "What made you decided to tell us now?", "Charles found out on the road trip", "and I was positive he was not", "gonna be able to keep the secret for much longer.", "Bye Rosa.", "I mean, not \"bi,\" but bye!", "I mean, see ya!", "I mean, have fun only having sex with men.", "Just bangin' dudes, left and right.", "I just stopped saying bye all together.", "So are you seeing anyone now?", "- Yeah. Her name's Tiffany. - Are you lying about her name", "- so we won't look her up? - Yes, I am. Next.", "- Do you know Anne Heche? - I do.", "- Ohh. - I must say, this is going", "considerably better than when I came out to my colleagues.", "They were not, as the kids say, awake.", "- Do you mean woke? - I did mean woke.", "But it's grammatically incoherent.", "Okay, we have time for one more question.", "- Oh! Ooh, ooh, ooh! - Nope. Absolutely not. We're done.", "Smart. It was not tasteful.", "Is anyone else having trouble with the Internet?", "I've been trying to file a warrant request", "for 45 minutes and the stupid server keeps timing out.", "Nothing's loading. It's all pinwheels.", "This all started when Cyber Crimes moved in downstairs.", "I bet those jerks are hogging our bandwidth.", "Man, I miss the Sex Crimes Unit.", "I know! They were so fun.", "Remember their Christmas Party?", "- [LAUGHS] - Okay, Sergeant Jeffords and I", "will talk to Cyber.", "Tell them I can't get on WebMD.", "My nipple tripled in size and I wanna know", "- if it's good or bad. - Can't believe that's good.", "Hey. Was that weird earlier?", "You mean when Charles showed us those pictures of Nikolaj", "taking a very sudsless bath?", "Yes, it was uncomfortable.", "No, I mean when I told everyone I was bi.", "- Was it too touchy-feely? - Rosa, no. It was great.", "And don't worry, just because you opened up a little bit", "doesn't mean everyone's gonna be less afraid of you.", "- We're all still terrified. - Thanks, Jake.", "- So how'd your parents take it? - Uhh...", "- I haven't told 'em yet. - Really?", "I mean, of course, you don't have to but I just thought", "you guys were getting closer since prison.", "No, I mean, we are. It's just,", "I don't know how I would say something like that.", "Especially to my dad. He's super traditional.", "I'm afraid this would just mess everything up.", "We've been having so much fun lately.", "♪ ♪", "- I don't wanna lose that. - Okay.", "Maybe just be honest with them. Right?", "Tell 'em how you feel. Like, you could say,", "Mom, Dad, I'm bisexual.", "But I'm still your daughter.", "I'm still the same person that I've always been.", "And who I love will never change that.", "And you guys raised me to be strong and confident.", "And I don't wanna hide who I am anymore.", "I am bi.", "Damn. That was...", "And I know that this may come as a shock to you,", "but it's my truth.", "So I hope you can accept that.", "- Jake... - Maybe you still see me", "as your little girl, but I'm woman now.", "And I know my own heart.", "- You done? - Yeah.", "Wow, that felt amazing. I really disappeared into it.", "- Should I become an actor? - Absolutely not.", "- Copy that. All right. Good luck. - Thanks.", "- [BELL DINGS] - ♪ ♪", "Look, that guy's watching a video.", "No buffering.", "They got all the bars, Captain. All the bars!", "Keep it together, Jeffords.", "Oh. You must be Raymond Holt.", "Whoa. No. Germs.", "We just wanted to ask about the Internet.", "Ever since you guys arrived, things have gotten", "- slow for us upstairs. - We're the Cyber Crimes Unit.", "Kinda need the bandwidth.", "Do you guys even use the Internet upstairs?", "I thought you just write down your hunches", "in your notebooks with your pens and paper.", "I'll have you know you're speaking to your Captain.", "Well, I'll have you know that we don't report to you.", "We report to the Commissioner's office. Ever heard of them?", "I don't care who you report to, this is what you're gonna do.", "You're gonna, um...", "- put the wires... - Right.", "Um...", "- Terry. - Uh... into the things.", "And... and beef up the speeds. Got it?", "We want beefy speeds!", "Long story short, we remain un-beefed.", "Unfortunately, we're out of options.", "- They're just not scared of us. - Right.", "But there is one person who scares everyone.", "Hey! Captain Holt, Terry, Charles,", "I wanna say... Alan?", "Close. It's Amy.", "This is nice. I can't believe", "- you're buying me dinner. - Oh, well, you really", "- helped me today. - Did I?", "I felt like I sorta straight-splained", "how to come out to you.", "No, it was good practice.", "I think I'm ready to tell my parents.", "That's awesome. When are you gonna do it?", "- In five minutes. - What?", "Actually, scratch that, they're here.", "This is happening and I need you to be here with me", "and also just step in and do it for me.", "Rosa, I think that's a very bad idea.", "And frankly, I'm not very comfortable...", "Hello, Mr. and Mrs. Diaz!", "America's favorite couple!", "I didn't know Jake was joining us.", "Neither did I. What a fun surprise that none of us", "were remotely prepared for, Rosa, right?", "- You seem nervous. Why? - Uhh...", "global warming.", "What a bitch, right?", "[LAUGHS] We all gon' drown.", "Anyways, I'm gonna head to the bathroom", "for the duration of one conversation.", "No!", "Uh, guys, I have something I need to tell you.", "- What is it, honey? - Uhh, Jake, you take it.", "Seriously? Me? Oh, man,", "now I really do have to go to the bathroom.", "What, you didn't before? You lied?", "You know, Oscar, most people just ignore my nervous rambling.", "Maybe shift focus back to Rosa.", "Don't worry.", "- We know what's happening. - You do?", "Of course.", "You and Jake are dating.", "That's why you were nervous.", "'Cause you know I never liked him.", "What? Okay, first of all, that's insane.", "We've only met once and we totally hit it off.", "We talked about soccer, I called it fútbol.", "Oh, I see what happened. But secondly,", "- Rosa and I are not... - Denying that we're dating.", "Uh, you're right. We're a couple.", "I love you, honey bun.", "Uhh!", "We need your help, Gina.", "Gina, ugh, I haven't heard that name in a long time.", "- It's on your jacket. - I know,", "but no one says it out loud and my baby can't read.", "Which, I'm told is normal for a ten-week-old, so...", "- How's little Enigma doing? - We call her Iggy now,", "but you're gonna wanna keep it down", "because she's trying to take a nap, okay, Amy?", "Oh, sure, I just feel like I was matching the same volume", "- that you were speaking at. - Amy, keep it down.", "Yes, yes, babies are adorable.", "They're like we are but so much smaller.", "So we're here because we're having an issue", "with the new Cyber Unit", "that has moved into the second floor.", "What happened to Sex Crimes?", "They were so nice.", "Remember their Christmas party?", "- Oh, so good. - [ALL IN AGREEMENT]", "- Ohh. - But now Cyber's", "hogging our Internet and we can't get them to stop.", "But you can intimidate anyone into doing what you want.", "No, sorry, I can't.", "That's precinct business and, well,", "I've left that life behind.", "But your maternity leave is over in two weeks.", "Amy, volume, okay?", "Volume!", "♪ ♪", "Hey, wait up.", "Why'd you leave the table?", "If we go to the bathroom at the same time,", "they're gonna think we're hooking up since apparently we're dating now.", "I'm sorry I said that. I thought I was", "ready to do this, but I am not.", "- I'm not gonna do it tonight, okay? - Yes, of course.", "Look, I support you no matter what.", "Just do whatever feels right.", "Can we just pretend to be a couple for tonight?", "And then I'll tell them in a few weeks that we broke up.", "Fine. But I have one rule.", "- Hands off my butt. - That's not gonna", "- be a problem. - Well, you say that now", "but you're about to enter the Jake Peralta boyfriend experience.", "It can be quite intoxicating.", "Hm. Also, you sat on a meatball.", "Did I? Oh, man, these are my Friday jeans.", "Anyways, I'm gonna snap off a wiz", "and I'll meet you back at the table. Let's do this.", "Guys, without Gina, we'll never be able", "to bend Cyber to our will.", "So we need to change tactics.", "We need to woo them", "with the international language of friendship.", "- Pork. - Ohh.", "Ooh! I'll take it to them.", "It's all dudes down there and I'm not above", "using a little flirtation to get what I want.", "- Was that a wink? - You tell me.", "I honestly don't know, but you're all we got.", "[BELL DINGS]", "♪ ♪", "Hello, boys.", "Oh, wait, wait... I winked my contact out.", "No, no, no. It's still there.", "- Oh, God it's behind my eye! - Fall back, Amy.", "- Ohh... - I got it, I got it.", "Look, we got off on the wrong foot this morning.", "And I was hoping we could start fresh.", "So we got you this.", "[CHUCKLES]", "Mmm. Decent.", "Great, now that you've accepted our meat pile,", "perhaps you'll help us restore our internet.", "Sure. I can definitely help with that.", "- Mm. - How many KBPSs are you looking for?", "- Many. - Yeah, that's not an answer.", "I need an exact number.", "- 100. - [CHUCKLES]", "Too few? Too many?", "- Four. - Okay, bro, I'll give you", "four kilobytes of Internet. [LAUGHTER]", "You're making a fool of yourself.", "- [ELECTRICITY POWERS DOWN] - No! You're the fool!", "- [GASPS] - Hey, little man.", "- Why so teeny? - I'm not teeny.", "- I'm average size. - [LAUGHS] What a sad brag.", "I don't even know who you are.", "But I know who you are, Devin.", "You tell everyone you got a degree from Stanford", "but you really went to Stamforb,", "an online college based in Arkansas.", "- [LAUGHTER] - It's a good school.", "You live with your aunt. That's sad.", "And you spend a third of your salary on tropical fish", "and aquaria. [LAUGHTER]", "You know, I found all this off of, hm,", "20 minutes of idle snoopin' around.", "Imagine what I could do with a dedicated couple of hours.", "- What do you want? - I want you to give", "the Internet back to my friends.", "Mm-kay? Or I'll keep diggin' and diggin'", "and diggin' and diggin'.", "Fine! I'll give you back your Internet, okay?", "- Just... we're through. - Oh!", "And maybe your co-workers would like to know", "what happened on your 7th grade field trip to D.C.", "- You monster. - He pooped in the Reflecting Pool.", "[ALL EXCLAIMING]", "So how did you two finally get together", "after all these years?", "Oh, uh, you know,", "I've just been crazy about her forever", "and then one day I picked up my battered old guitar", "and I sang her a song.", "Ohh!", "- How did it go? - Oh, you don't wanna hear it.", "- Yeah. - Yes, I do!", "Well, I don't have my guitar here.", "- Sing the song. - ♪ Rosa, Rosa, Rosa, Rosa ♪", "♪ Rosa, Rosa, Rosa, Rosa, Diaz, Diaz, Diaz, Diaz ♪", "♪ Diaz, Diaz, Diaz, Diaz ♪", "♪ Rosa Diaz, Rosa Diaz ♪", "♪ Diaz Rosa, Riza Diaz ♪", "♪ Diaz, you are so cool ♪", "Sounds better with a guitar.", "- [PHONE RINGING] - Oh! [CHUCKLES]", "- Just put that away. - What was that in the picture?", "- Just my mom. - Kinda looked like", "- your co-worker Amy. - Jake and Amy are friends.", "- It's not weird. - He had his arm around her", "and she was showing off a ring.", "Wow, you got a really good look at that picture, huh?", "What's going on?", "Jake and Amy are engaged.", "[SIGHS]", "- That's okay. - What?", "We understand. Love is complicated.", "Wait, why would you be okay with that?", "Mijita, when you called this dinner,", "you were so nervous, we were worried", "you were gonna tell us you were gay.", "So you would rather me be", "some dude's mistress than be in", "a loving relationship with a woman?", "Well, Jake and I aren't dating.", "But guess what?", "Your worst fears are real.", "I'm not straight. I'm bisexual.", "And I don't care what you think about it.", "Screw this. I'm outta here.", "I'm also gonna go. Are you guys on Venmo?", "You know what? We'll figure it out later.", "This isn't the right time. All right.", "♪ ♪", "Hey, so, I ran after you last night,", "- but I lost you in the subway. - I took a cab home.", "Really? Well, then, I definitely terrified some random lady.", "Hey, look, I'm sorry things didn't go", "how you wanted with your parents.", "- It was fine. - Rosa, you don't", "- have to say that. - No, it really did go fine.", "They texted me last night.", "\"Don't worry about dinner. See you at game night.\"", "Nice. But very surprising.", "It's great. I told them I'm bi,", "and they still invited me to game night.", "They're clearly okay with it.", "Well, I'm just glad it worked out.", "- Enjoy game night. - Actually, they want", "you to come to make up for", "- how awkward dinner was. - Oh, fantastic.", "I'm still involved.", "Well, I'm sure your dad is a super chill guy", "- to play against. - [LAUGHS] He is not.", "Well, then, let's hope I'm on his team.", "- That is worse. - Cool. So no good options.", "Super stoked about this invite.", "- Here we go. - [CLICKS]", "It's loading!", "We got Internet!", "All right, I guess my work here is done, guys,", "How can we ever thank you?", "I'll tell you how.", "Use this precious Internet.", "Use it every day.", "Keep multiple tabs open,", "stream videos in HD,", "leave comments on everything you can find.", "Most importantly,", "make your avatars GIFs.", "I was thinking more like a pizza party", "when you come back in two weeks.", "Oh, yeah. So here's the thing:", "- I'm not coming back. - What?", "- Seriously? - Yeah, listen,", "I have a daughter now and when she grows up", "I wanna be doing something that makes her proud.", "So I'm starting my own company.", "- Ooh! What is it? - I'm running a sports league", "for other people's pets.", "- Ohh. - Well, Gina,", "as your colleague, best friend, brother and ex-lover...", "- Ugh. - I fully support your dreams,", "but do you really wanna leave?", "My mind is made up. And so...", "this is Gina Linetti's last grand exit", "from the Nine-Nine.", "♪ I will remember you ♪", "Where's that coming from?", "- She's gone. - Do you think", "that's the last time we'll ever see her?", "[ELEVATOR BELL DINGS]", "Bye, Gina.", "♪ ♪", "I don't know what that is.", "That could literally be anything.", "Maybe try guessing.", "Rule violation!", "You're not supposed to speak.", "There's our turn, once again.", "Oh, well, do you want me to tell you", "what I was drawing just for fun?", "We're not playing just for fun.", "Mm-kay, well, don't let my desire to have fun", "ruin what seems to be a very nice night so far.", "- Right, Rosa? - Yeah, right.", "So your mother and I talked", "about what you told us last night.", "We don't need to talk about that right now.", "We want you to know we're not upset.", "Great. I'm not upset either.", "Because no matter what you call yourself,", "you still like men.", "So you can still get married", "- and have a child. - I can do those things", "with either a man or a woman.", "Yes, but it will be a man", "because this is just a phase.", "Okay, that's settled. Ladies up.", "[MELANCHOLY MUSIC]", "♪ ♪", "So, since you're not coming back,", "we wanted to bring you all your stuff.", "It's a lot of gum and what seem to be", "blackmail files you've been keeping on all of us?", "I'm not a blackmailer.", "If you tell anyone I am, I will release your secrets.", "Look, we know you want your daughter to be proud", "of the work that you do.", "I just hope you know how important you've been to the Nine-Nine.", "Yeah, just today, I was able to pull a warrant and arrest the guy", "I've been tracking for three months", "because you got the internet back.", "You're indispensible", "and we're really gonna miss you.", "And I loved the Nine-Nine, you guys.", "It just feels like it's time for me", "to, like, build something of my own.", "Like my entrepreneurial idols,", "Oprah Winfrey, Lex Luthor...", "The Superman villain?", "He built an empire, didn't he?", "- Yeah. - Well, we wish you luck.", "And it's not gonna be the same without you.", "Mm, thanks for saying that, and...", "I don't know, uh...", "You know what?", "You can have your blackmail files back.", "I don't want 'em anymore.", "Gina, these are just photos of me", "- in my everyday clothes. - [CHUCKLES]", "- I know. It's painful, right? - All right.", "- Your turn, mija. - Right.", "[EXHALES]", "Uhh, a woman.", "Uhh, uh, lady.", "Uhh, women. Two women.", "Holding hands, uh, friends.", "Ohh, mm, uhh... sisters!", "Ooh! Business partners.", "Uh, um, ooh, oh, oh,", "co-owners of a chocolate shop!", "Oh, love. Love... what do women love?", "The... George Clooney!", "It's a wedding!", "They're brides. They're in love.", "Mom, Dad, I know you don't wanna talk about this", "but I do.", "I might get married to a man...", "like you so clearly want...", "and I might not.", "'Cause this is not a phase.", "And I need you to understand that.", "- I'm bisexual. - There's no such thing", "as being bisexual.", "Yes, there is.", "I know there is because that's who I am.", "I'm attracted to both men and women.", "I've known this about myself for a really long time,", "and I didn't wanna tell you because I was afraid", "you were gonna react exactly like you are.", "What do you want us to say?", "That you accept me for who I am.", "Wow.", "Okay, let's go.", "Hey. Got you coffee.", "I don't drink coffee. Just herbal tea.", "Oh. That's cool.", "It only cost me, like, 18 bucks. Brooklyn is a nightmare.", "Hey, man, thanks for being there last night.", "Of course.", "Sorry again about how it all went down.", "Well, I'm glad I opened up to them,", "even if it didn't change their minds.", "I finally said what I wanted to say.", "- It felt right. - Yeah.", "Still sucks, though.", "Still sucks.", "That's weird. My dad's here.", "Hey, do you mind staying out here", "- with me to talk to him? - Um, yes, of course.", "- Whatever you need. - [LAUGHS]", "Your face. No, man, you've done enough.", "- Get out of here. - Oh, thank God.", "Good luck.", "Hello.", "What are you doing here?", "I wanted to say I'm sorry.", "I reacted poorly last night.", "- This is all new to me. - I know.", "But it's also not new, you know.", "I'm still the same person I always was.", "Well, I don't feel I know that person.", "- Dad... - My fault, not yours.", "I want you to be able to tell me everything.", "I can't promise you I'll understand.", "But I'm trying. I want you to know", "that I accept you for who you are.", "And I love you very, very much.", "I love you, too.", "So have you been on any dates with women, yet?", "Dad, we didn't talk about my dating life before,", "we don't need to talk about it now.", "Yeah, good, good. You're right. [LAUGHS]", "So where's Mom?", "Mm... Mom needs a little more time.", "Oof.", "I guess family game night's gonna be kinda weird.", "You know what, mijita, maybe we better", "put game night on hold for a little while.", "- Okay. - I'm gonna let you", "get back to work, okay?", "♪ ♪", "I expect certain things from my assistant.", "Black ink only. No blue. I'm not a street artist.", "Also, if you must knock on my door,", "limit yourself to two raps.", "If I wanted to hear inane pounding,", "- I could go see \"Stomp.\" - He could go see \"Stomp.\"", "- Gina. - Who's this noob?", "We had to hire someone to replace you, Gina,", "- because you quit. - Well, fire him.", "'Cause I'm back, baby!", "- Really? - What changed your mind?", "Was is the speech that Charles and I gave you?", "[CHUCKLES] No. Captain Holt said", "he'd give me a 5% raise if I came back", "and he's letting me sit at my desk", "and work on my side business one day a week.", "We never had that conversation.", "We just did, baby.", "See ya, man bangs.", "Come, Brent, let's get you down to HR", "before that start paperwork goes through.", "- Welcome back, Linetti. - Thanks, man.", "Ugh!", "All right, look, Gina, come on.", "It's just us now. Admit it.", "Amy and I changed your mind.", "All right, it was you guys.", "I actually even cried a little bit", "after you left my apartment.", "- Aw. - Oh! I made Gina Linetti cry?", "Hey, calm down. I had a baby ten weeks ago.", "I cried to a carpet cleaner commercial yesterday.", "Gina! Welcome back.", "It's great to see you. Hey, what's everybody", "- doing tonight? - Nothin'. Why?", "There's something we all need to do.", "[KNOCK AT DOOR]", "- What's going on? - Family game night!", "Don't worry, I brought \"Twister.\"", "- Hey. - Hey, Rosa.", "- Hey, Rosa. Beer. - Here goes the snacks.", "Ehh, you know, in another lifetime,", "you and I would've made a hot ass couple.", "Agreed.", "Diaz, you should be very proud of yourself.", "I know things aren't exactly where you wanna be right now,", "but, uh, I promise you they will improve.", "- Thank you, Captain. - Every time", "someone steps up and says who they are,", "the world becomes a better, more interesting place.", "So...", "thank you.", "Hey, do you seriously only have two wine glasses?", "- Yeah. I live alone. - Well, you're gonna need", "to get some more, 'cause there's a lot of us here.", "Thank you for doing this, man.", "Of course. We'll be here every week.", "Rosa, I broke both your wine glasses and your fridge door", "and your bathroom.", "Every single week!"]