[">Sir, you wanted to see me?", "Yes, I have an assignment for you.", "I'm afraid it's not a pleasant one.", "Oh, my God. Please tell me it's not...", "Yes, it's Hitchcock related.", "Son of a bitch.", "Detective Hitchcock is set to testify in court this afternoon.", "It's an important case, and I'd rather not get another call from the DA", "saying he showed up \"covered in condiments.\"", "So you want me to keep Hitchcock from", "spilling on himself for the rest of the day?", "We both know that's impossible.", "- I'm counting on you. - I won't do it.", "- There's nobody else I trust. - What you're asking is insane.", "- I'm not asking. - It's a suicide mission!", "- Then prepare for death. - You've lost your mind!", "This is a direct order, Detective! Get in line!", "Hey. You guys startled Hitchcock.", "He spilled two full jars of spaghetti sauce on himself.", "Thanks a lot, fellas.", "Synced &amp; corrected by MaxPayne == https://subscene.com ==", "Ames, super important question.", "Which one of these shirts should I wear to dinner", "- with your mom tonight? - Those are exactly the same.", "I have a signature look, Rosa.", "Put on a T-shirt for all I care.", "It doesn't matter what you wear.", "Of course it matters.", "He has to wear the smaller checks.", "Big checks wash him out. Where are you, Amy?", "It doesn't matter, because the night is already ruined.", "My stupid mother invited my stupid brother David to join us.", "- I thought you liked your brothers. - I have seven brothers, Rosa,", "and I like all of them except David. Perfect David.", "David graduated at the top of his class at the police academy.", "David took a bullet for the mayor. David bakes his own bread.", "Ooh, and does this David have a sister?", "- Yes. Amy is his sister. - And what's her deal?", "You were at the wedding, Hitchcock.", "I'm just gonna call and cancel.", "I really don't want to have dinner with my mom", "fawning all over the golden boy.", "I'm sure your mom loves you both equally.", "No, she definitely doesn't.", "My parents arrange the photos of their kids", "by who makes them the proudest.", "Number one goes on the mantel above the fireplace,", "two through four on the piano, and the rest", "- are on the staircase. - This is wack.", "- So David's on the mantel? - Always.", "Meanwhile, my picture gathers dust on the piano.", "The piano's not that bad.", "Nobody in the family even plays, Rosa.", "At least people use the stairs.", "All right, David is perfect, but so are you.", "Let's just go tonight, and I'll be your hype man.", "You know how good I am at talking you up.", "Here, watch. Hey, Scully.", "Did you know that Amy is super cool?", "No way. Can I get your autograph, ma'am?", "- See? - Fine, we'll go.", "What, too stuck up for your fans? Ya friggin' turd!", "Hey, Captain, Sarge, I have a case I want to discuss with you.", "You want to talk about work in the break room?", "That's highly unorthodox, but I suppose we can give it a try.", "Okay, so I have a perp...", "I'm sorry, this is insane. Let's talk in my office.", "Much better. All right, Boyle,", "what's this case you wanted to talk about?", "I have a perp, Alfonso Tucker, transferring into our holding cell.", "The guy who was dealing that toxic batch of meth?", "Yeah, and he refuses to name his supplier.", "I want to send someone into holding,", "undercover as a perp,", "- to see if they can get him to open up. - Why don't you do it?", "You're always going on about your acting abilities", "and that time you played Annie.", "I'm an adult man, Sarge. I didn't play Annie.", "I was in \"Annie.\" I played Miss Hannigan.", "Unfortunately, Alfonso knows I'm a cop,", "so I can't be Maxwell Blaze.", "But Terry might be right for the role.", "Ooh, that sounds fun.", "I love flexing my creative muscles.", "In addition to flexing my actual muscles.", "- Or I could do it. - What? You hate theater.", "You always say acting is just professional lying.", "Yes, but this is what the mission calls for, and I'm good at it.", "Kevin and I went to a dinner party", "where we played the French parlor game \"charades.\"", "I had to act out Elvis Presley.", "He's dead now, so I portrayed him as such.", "Everyone understood...", "Immediately.", "You know, a little competition might bring out the best in both of you.", "We'll hold auditions this afternoon. I'll prepare sides.", "Please wear clothes you can move in.", "Okay, let's get to the table before David gets here.", "My mother loves an early bird.", "Hey, babe, before we go in,", "I know I said I was gonna do the whole hype man thing, but...", "I know. I shouldn't compare myself to my brother.", "We're all on our own journey.", "What? No. Who told you that garbage?", "I was gonna say, we need a backup plan", "so you can win this thing.", "If it starts slipping away, I'll pretend to choke,", "and then you give me the Heimlich and save my life in front of everyone.", "Aw, thanks for not trying to make me a better person.", "- I love you. - Love you too.", "Amy, Jake! David and I both arrived an hour early.", "We're sharing a French onion.", "Mother...", "So she's about to jump, and I say,", "\"Hey, I can't tell you this world is a good place,", "but I guarantee you it's better with you in it.\"", "And she climbs down off the ledge,", "- and she gives me a big hug. - Ugh.", "And that was before she won the Oscar?", "I don't know, I don't really follow pop culture.", "You never cease to impress me, David.", "Hey, speaking of impressive,", "Amy just went to the NYPD shooting range", "and received a gold certification in marksmanship.", "Oh, I just got the platinum certification.", "What? That exists? What did you do,", "curve the bullets, \"Wanted\" -style?", "Yeah, I don't know what \"Wanted\" is. I don't follow pop culture.", "But I fired ten shots,", "and they all went into the same hole.", "Oh, so you actually did.", "Hey, Camila, did you know that Amy", "is the youngest female sergeant", "in the history of the Nine-Nine?", "Yes, I'm very proud of her.", "I'm proud of all my children.", "The sergeant and the lieutenant.", "What? You passed the lieutenant's exam?", "It actually wasn't something I was planning on taking,", "but then my partner got sick and I wanted to be able", "to send home extra money to his wife and kids.", "Then I read the MRI. He was totally misdiagnosed.", "So long story short, Bo is alive,", "and I got a perfect score on the test for no reason.", "Oh, man. Hey, check out these dinner rolls, huh?", "Love these bad boys.", "I'm just gonna chomp down on that, recklessly.", "Oh! Oh, no, Jake! He's choking!", "Let David do it. He has EMT training.", "- I'm here for you, Jake. - I'm gonna go to the bathroom.", "You know what...", "Don't worry. It is gonna hurt like hell.", "I think it's actually okay.", "Thank you both so much for coming in.", "This is a safe space", "where choices are welcome.", "Okay, now, I trust that both of you had a chance to review the script?", "- Yeah. - Good. Now throw them away!", "What the hell? I wrote notes in the margin.", "Terry found his super-objective.", "I want to see you improvise without the safety net.", "I want to see you become Maxwell Blaze.", "So, Maxwell, what was your childhood like?", "I was a lookout at 8,", "had my own corner at 10,", "trigger man at 13.", "You know what it's like to look a man in his eyes", "as the life drains out of him?", "I was bad from a young age.", "At school, I pushed people.", "And this wasn't horseplay. This was pushing to hurt.", "Do you have a girlfriend at home?", "Used to. She got tired of me getting locked up.", "She's with my brother now.", "He better hope I never find his ass.", "I do, and you should see her heavy,", "feminine breasts,", "with their perfectly placed nipples.", "Don't get me started on her can.", "- What's your greatest fear? - I ain't scared of nothing.", "My girlfriend. I'm scared she'll find out about my mistress,", "who also has a perfect can.", "It's smaller, but it's harder.", "Great.", "You both have given me something totally different.", "I've got a lot to think about.", "Thank you. Next!", "What up, dawgs?", "Norm Scully, reading for Maxwell Blaze.", "Listen, I just did what anyone would do.", "Hey, where'd you go?", "I just couldn't stand there while the whole restaurant", "gushed over David saving your life.", "Yeah, there was a standing ovation.", "Also, everyone saw you walk away while I was choking,", "and I don't want to say you're a villain now,", "but the B-word was tossed around a lot.", "Ugh. I'm sorry.", "I just can't be around him.", "I shouldn't have come. So let's leave.", "I'll tell everyone my stomach hurts, which it does.", "I'm pretty sure he broke my rib when he gave me the Heimlich.", "Lieutenant Santiago, a word?", "Why is David's captain here?", "What's going on? Is there a maniac on the loose,", "and David's the only one who can catch him", "before he blows up a train?", "Oh, we could call him the Trainiac.", "We're focused on the same things.", "Sorry, folks, we've discovered a large quantity", "of cocaine in Lieutenant Santiago's desk.", "We've had to place him under arrest.", "Oh, no.", "Of course. We'll head over soon.", "So that was my brother.", "He needs me to bail him out of jail.", "I feel so awful for him.", "You are smiling so much.", "No, no, I promise. I feel so, so, bad.", "Rosa D!", "Deezer, what up? Deezer?", "Hey, Scully, did you do something new with your hair?", "Same thing as always: Put mousse in it", "while it's wet, then I watch a scary movie.", "- You the man. - What is wrong with her?", "Her brother David got arrested.", "- He's a cokehead! - And you're happy about this?", "That's savage. I love it.", "- I'm not happy about it! - All right. Calm down, Littlefinger.", "He's in a lot of trouble, you know.", "Yeah, yeah, you're right. You're right.", "It's a terrible situation.", "- Let's go bail him out. - All right.", "Ooh, should I get my hair blown out first?", "I'm gonna have pictures from today for the rest of my life.", "Are you... a bad person?", "Casting's up!", "This is not a high school play, Boyle.", "Just let us know who you went with.", "Okay, first of all,", "I want to say that this was", "one of the hardest decisions I've ever had to make.", "There is so much talent in this room.", "Just tell us, bitch.", "Act as if you already have the role.", "I could have cast any one of you and put on a great show,", "but I had to make a call.", "Enough, Boyle. We're all adults.", "No one cares about this that much.", "- It's Captain Holt. - Captain Holt?", "He was the worst one!", "No offense, but Holt was so unconvincing.", "He kept referring to his childhood", "as a soot-covered street urchin.", "Yes, I gave myself a Dickensian backstory,", "which apparently made quite the impression.", "I'm sorry, Sarge.", "Honestly, I don't think I'm the right director", "to bring your vision of Maxwell Blaze to life.", "What does that even mean?", "It means you blew it.", "Walk away, Jeffords. Walk away.", "Okay, this is gonna be my mantel shot.", "So every time Mom and Dad look at it,", "they'll be reminded of what David did.", "I would say you should chill out,", "but this is actually making me feel great", "about my family, so let's dive in.", "Everybody say \"possession with intent to distribute\"!", "Hey.", "- Oh! - Ah, David, hi there.", "That was unrelated to your recent arrest", "for possession with intent to distribute.", "- How are you? - Not great.", "Yeah, jail is rough.", "You got to go poop in front of everyone.", "I remember when I was in prison,", "I held it for weeks, and when I finally did go,", "it was...", "You know what, Jake? This isn't about you.", "So, David, did you get fired,", "or is there gonna be, like, a hearing?", "She's asking so she can be there to support you.", "Oh, yeah, I wouldn't miss it.", "- I'm so excited. - To support you.", "That's what I said. I'm really looking forward", "- to being there. - To support you.", "Yeah, we're saying the same thing.", "- I am pumped this is happening. - All right, babe,", "maybe your brother doesn't want to talk about what happened.", "- Let's just go. - It's okay.", "I owe you guys an explanation.", "I actually started doing drugs when I was a teenager.", "You know how Mom and Dad put so much pressure on us?", "- Eventually I just kind of cracked. - Wait, you felt pressure?", "You always seemed to effortlessly thrive", "at everything. I was so jealous.", "But knowing that you also felt the pressure...", "All right, we can drop the act.", "I just didn't know who was listening.", "- What act, now? - Everything I've said before", "just now is a lie. I'm being framed.", "I've been investigating these dirty cops", "who are being paid off by the Brazilian mob.", "Oh, Brazilian mobsters are so good-looking.", "They're just a bunch of Giseles, the women and the men.", "Yes, it's insane. They're all gorgeous.", "Anyway, I think I got too close.", "Those dirty cops must have planted the drugs in my desk.", "So what you're saying is, you're not addicted to cocaine?", "Amy, it's me. I don't even drink coffee.", "I have too much respect for my body.", "This is water.", "And you didn't feel pressure", "- from Mom and Dad? - No, they're so supportive.", "I'd actually love some constructive criticism.", "It's the only way to grow.", "Anyway, thank you so much for bailing me out.", "If you can just drop me off at home, I will clear my name,", "and things can go back to the way they were.", "The way they were. Great.", "It's my favorite way of things being.", "Okay, Alfonso, I hope you like it here in holding.", "It's gonna be a while.", "- So... what they got you in here for? - Drugs.", "They want me to flip, but I'm no snitch.", "I'd rather do the time. How about you?", "I pushed a man, just to see him frown.", "He is terrible.", "Yeah, it's almost like casting a robotic old nerd", "was a huge mistake.", "Was it a mistake, Sarge?", "Or was it a stroke of brilliance?", "- What are you talking about? - Look, you're a good actor.", "You could even be a great one. But you're too gentle.", "Life hasn't kicked you around enough.", "I mean, I grew up poor, and my father was emotionally abusive.", "It's not enough.", "You needed to be rejected by me,", "a man you admire so much.", "What? So all this was just to make me mad?", "I need you to feel the anger and resentment", "that Tyrone McCallister feels every single day of his life.", "Who's Tyrone McCallister?", "You are.", "That's the part I wrote for you all along.", "This is so stupid, Boyle.", "You can't manipulate somebody like this", "and then expect them to get on board.", "Right, Sarge?", "Sarge?", "My name's Tyrone.", "Tyrone McGallagher.", "- McCallister. - McCallister.", "So I checked up on David's case file.", "He passed his drug test.", "Apparently he has the cleanest blood they've ever seen.", "I knew this was all too good to be true.", "Now David's gonna clear his name", "and singlehandedly take down drug dealers and dirty cops", "and get another medal from the governor.", "It sounds pretty dangerous. Maybe we should help him.", "Pretty sure he can handle this on his own.", "That's never been a problem for him.", "All right, look, Ames.", "I never had a brother,", "but I know four guys who did,", "and they would have fights and squabbles,", "but in the end, they always had each other's shells.", "Are you talking about the Ninja Turtles?", "Of course I'm talking about the Ninja Turtles!", "Ugh.", "Look, if something happens to your brother,", "you are gonna regret it,", "just like Raph regretted it when he abandoned Leo", "in the Technodrome with Krang.", "I don't know what that means.", "Well, that's on you. It's a classic.", "The point is, if your brother gets hurt", "and you don't get his back now,", "it's gonna haunt you for the rest of your life.", "You're right.", "- Obviously you're right. - Thank you.", "If David gets killed by the Brazilian mafia,", "my parents' mantel is gonna become, like,", "- a permanent shrine to him. - No, that's not what I meant.", "Oh, the thought of it makes me want to puke.", "You've learned the wrong lesson.", "Come on, let's go help the bastard.", "Don't love how we got here, but we're going where I want.", "I'm glad you guys are here.", "So this place is run by the Brazilian mob.", "My CI tells me there's a ledger with all the cops on payroll", "hidden in here somewhere.", "I'm guessing it's in that room surrounded by armed guards.", "Those are guards?", "I thought they were models.", "We need a plan to get past them.", "So here's what I'm thinking. I speak a little Portuguese", "from that time I opened a school in the favelas of Rio.", "- Ugh, barf. - What?", "I said barf.", "I can't deal with your bragging anymore.", "How is that bragging?", "I said I speak a little Portuguese", "when I'm actually fluent.", "Ugh, shut up!", "Look, if you're so angry with me, why are you even here?", "Because Jake convinced me if you die,", "I'd never hear the end of it from Mom and Dad.", "That's not exactly how I phrased it.", "Look, I get it. You're jealous.", "I'd be jealous too if someone was better than me", "at everything their whole life.", "- Oh, no. - Not everything.", "- I have more allergies than you. - Not the best brag.", "I have so many allergies, I just found out", "- I'm allergic to chia seeds. - But apparently effective.", "I'm allergic to chia and acai berries.", "Yeah? My throat gets scratchy when I eat stone fruit.", "Oh, yeah? I'm also a better dancer than you.", "Ames, you have badly misjudged your own abilities.", "You think you're better than me?", "Oh, damn.", "She's got a shot.", "- What, afraid to use your forearms? - Pretty good.", "You're not using enough elbow!", "Guys, those aren't the parts people feature when they dance.", "Now can we please find a way to distract those guards?", "Don't worry, Jake, 'cause I'm about to end this thing.", "Death drop!", "Ow!", "Ow, ow, ow!", "- Oh, that looked really bad. - Are you okay?", "Oh, look, the guards are leaving their post.", "Looks like they're coming here to help you. Jake, you should go now.", "- Are you sure? - Yes, I'm \"fone.\"", "Oh, well, as long as you're \"fone.\"", "- Jake, go. - All right, fine.", "Believe me, they're perfect.", "They're about 5 1/2 pounds each,", "and they look so good smushed together.", "Or dangling.", "Get off me, man.", "- Hey. - Hey.", "- Hey. - Cops, man.", "- Mm-hmm. - Word.", "McCallister, your lawyer's here.", "He wants to talk to you. Already?", "What the hell, man? I was just getting started.", "And yet it felt like forever.", "You were playing at Alfonso, not with Alfonso.", "What are you doing right now, Sarge?", "- Listening to you? - Yes, listening.", "What humans do 95% of the time", "and Tyrone does, apparently, none of the time.", "I want you to go back in there and listen.", "- Can you do that for me? - Yeah, okay, jeez.", "I mean, you know, look, take the note about Tyrone or don't.", "What do I know? But also, I created him.", "Hey.", "McCallister, your lawyer has more questions for you.", "- What? - Why were you doing that?", "You said I should listen!", "Well, listening doesn't always mean being quiet.", "Sometimes, the only way to listen", "is to say something.", "I'm listening to you right now.", "Do you see how I listen? This is me listening.", "You're pissing me off, Boyle!", "Ah, and he's back! Hold on to that aggression.", "Yeah, go! Go, go, go!", "What are you looking at?", "McCallister.", "Terry, Terry, Terry.", "I need you to help me see what I'm not seeing.", "Why can't you do this?", "You're giving me too many notes.", "Okay, well, then I can boil it down for you into one note:", "Tyrone is an ocean.", "I don't know what that means.", "It means I want you to be tough but vulnerable,", "brave but scared, jittery but perfectly still.", "Also, pace it up a little. Come on, buddy, you got this.", "Man, these stupid cops won't leave me alone.", "What the hell? They think I'm a snitch?", "- Not me. - I hear that.", "McCallister, I need to talk to you.", "- No! - Excuse me?", "I don't want any more notes.", "I've gone undercover before.", "Now just back off and let me do this!", "Uh-oh, Alfonso,", "seems as though we got a pig in our midst.", "Looks like we can only trust each other.", "Come on, man, you're obviously a cop too.", "You keep talking about how nefarious you are.", "Jake, let us in!", "I think she's gonna be okay,", "but she's probably got a low-grade concussion.", "I wish you hadn't tried to do a death drop.", "The ladies on \"Drag Race\" make it look so easy.", "I know, you don't get that reference because", "- you don't have a television. - Why?", "Amy, I'm sorry for getting so competitive back there.", "You guys are helping me out, and I should just be grateful.", "Of course you're being nice to me when I'm being a monster.", "Well, you know what, Mr. Perfect?", "I'm gonna find that ledger,", "and I'm gonna save your stupid butt.", "- That would be so great. - Please stop.", "Maybe there's a hidden panel somewhere?", "It's not in the desk.", "I bet it's in this old safe.", "That seems like a lot of work to open", "every time you have to pay a bribe.", "I would keep it in this filing cabinet.", "I found it!", "I beat the golden boy! I'm the golden girl!", "Hey, open up!", "- Who's in there? - Okay, everybody out.", "Go! Go, go, go!", "Hey, get off me!", "My God, you're even more stunning up close.", "I called for backup, but it could take ten minutes.", "- Should we storm the place? - Too late.", "Look, they're bringing Jake out.", "I told you, I was in the office because I work there,", "and we've actually met a bunch of times,", "and it's crazy you don't remember me!", "What should we do? If they get away,", "we'll never be able to track them.", "Shoot out the tires.", "You're a way better shot than me.", "- You should do it. - Are you crazy?", "- You're the golden girl. - David, take the shot.", "I just don't want you to feel bad about yourself...", "Take the shot!", "You're under arrest, you beautiful man.", "Cuff this son of a bitch.", "Oh, my God, you also smell so good.", "Brazil!", "All right, so first things first,", "I think I owe you both something,", "and it's this.", "Stop clapping! There's nothing to clap about.", "Look, I know you're upset, but everything went great.", "Great? You ruined this mission.", "Yeah, we might have gotten him to talk", "if you didn't give me notes every two seconds.", "Guys, you performed exactly the way I expected you to.", "It's just that you were both supporting characters.", "Hey, Boyle, I did what you asked.", "Alfonso told me everything.", "Yes! I knew it would work.", "What? What's going on?", "You were never my real star, Sarge.", "But I needed to create a scene", "so that Alfonso would think that my mission had failed.", "Then I could send in...", "Ricki Sheetz, DJ by night, gun smuggler by later night.", "Alfonso started telling me", "about all the crazy crap you guys pulled in there.", "He just couldn't stop talking", "till he gave me the name of his supplier.", "Rosa was my leading lady from the start.", "- She's the only good actor here. - She is?", "Yeah, you know nothing about my real life.", "- I'm always acting. - Well done, Boyle.", "You've executed this mission flawlessly. I'm impressed.", "Wait, if you were gonna use Diaz the whole time,", "why didn't you just tell us that?", "Because you two would have given it away", "with your terrible acting.", "No offense, but I can read", "every emotion you're feeling on your face.", "- Can you read this one? - Actually, yes.", "You're trying to be tough, but inside,", "you're super impressed by what I've accomplished today.", "Damn, you're right. You're good.", "Thank you, everyone, for joining me again.", "To David. You're my hero.", "And to Amy. You saved my butt.", "You're a great cop and a great sister.", "Wow. That means a lot coming from you.", "You've always been a role model for me.", "He's everyone's role model.", "That's why he's on the mantel.", "I have to go to the bathroom.", "Hey, are you okay?", "Yeah, I just had to go to the bathroom, like I said.", "Oh, great. I thought you went in there", "to give yourself a pep talk in the mirror", "like the girl from the deodorant commercial.", "I don't know what you're referring to.", "She wants the big promotion,", "but there's just one problem.", "She got skunk pit. We'll watch it later.", "The point is, I came to comfort you.", "Aw, thanks, but I actually feel really great.", "I've spent my whole life trying to beat David at something,", "but when you were in danger,", "I just didn't care anymore.", "All I wanted was for you to be okay.", "I may never have the mantel, but it doesn't matter,", "'cause I have you.", "Well, I'm very proud of you,", "and I also wish you had told me that before you went to the bathroom,", "because I really roasted your mom back there.", "And another thing, you should appreciate Amy more,", "because she's amazing.", "And another thing, when you come to visit us,", "you don't have to bring your own coffee.", "Our coffee is fine.", "And another thing, I know enough Spanish", "to understand what idiota means!", "And another thing!", "When you say I have an \"interesting nose,\"", "I know you mean big!", "I got lost in it.", "There were, like, 35 \"another things.\"", "- I'm so sorry. - It's okay.", "You were defending my honor.", "And I'm glad you said something.", "So should I go back and apologize to your mom?", "Oh, hell no. We're sneaking out the back.", "Oh, thank God. She is terrifying.", "See ya at Thanksgiving, Mrs. Santiago.", "- Not a doctor. - Shh.", "Fremulon."]