[">I'm here! I'm here, I'm here.", "You can start the meeting now.", "The meeting is over. You're late.", "You missed roll call and the tutorial", "on using the new copiers.", "Six years, and no matter how hard I try, I still can't", "get you to understand the importance of being punctual.", "Maybe you should just give up and accept me for who I am?", "No, I will break you.", "- Right now. - Oh.", "While you were out being tardy,", "I was hard at work devising a special punishment.", "I've crafted an intricate personal high five", "with everyone in this office except you.", "What? But you hate high fives.", "Yes, every minute of it was hell.", "But it'll be worse for you. Squad, dismissed.", "Good-bye, Diaz.", "Salute into a fanny waggle?", "- Good-bye, Boyle. - Oh, the snake charmer!", "Good-bye, Jeffords.", "- That's a butt bump. - Good-bye, Santiago.", "Double fist bump reverse explosion", "into a Pete Townshend strum.", "[SIGHS] All right, that was terrible,", "but it's over now, and I made it through.", "Good-bye, Leonard from Xerox.", "What? No, no, no.", "The copy guy?", "Synced &amp; corrected by MaxPayne == https://subscene.com ==", "♪ ♪", "♪ ♪", "So nice of you to stop by, Kevin.", "Enjoy your day. I hope it's productive.", "Thank you, Raymond.", "I hope your day is productive as well.", "PDA in the office? My, my.", "- Couldn't help myself. - Hmm.", "Oh, may I please use the precinct facilities", "before I head to work?", "Yes. Thank you for asking for permission.", "Thank you for granting it.", "[SIGHS]", "Whoomp. There it is!", "Got to say, I could have used", "a little more oomph on the whoomp.", "That's the oomphiest whoomp you'll get.", "So what's going on? Why'd you want to meet in private?", "I need your help with a case.", "Three antique coins were stolen", "from my classics department at Columbia.", "So why not ask Captain Holt for help on the case?", "Wait, are you guys getting a divorce?", "I can handle it.", "This doesn't bring up any weird issues for me.", "No, it's nothing like that.", "Raymond's a brilliant detective.", "It's just when a case involves me,", "he can get a little overemotional.", "- You remember the safe house. - Oh, yeah, he went crazy.", "But I also remember you and me becoming best friends", "and watching every Nic Cage movie ever made.", "Can you still quote them all?", "No, I purged myself of that nonsense.", "- Oh, I bet it's still in there. - It's not.", "- We'll see. - We won't.", "- There's a chance it's in there. - Chance of zero.", "I'd put money that maybe it's there.", "- You're losing your money. - Okay.", "- So will you help me? - I don't know.", "I want to, but keeping a secret from Holt?", "- That's a lot of pressure. - Hmm.", "Am I remembering correctly?", "Don't you... eat pressure for breakfast?", "[GASPS] Nic Cage in \"The Rock.\"", "We are best friends. I am so in!", "[DOOR OPENS] Oh, no, that's Raymond.", "That's how he opens a door.", "Kevin, are you still in here?", "Uh, yes, Raymond, I'm in the stall.", "Some tickets were just released", "for Mahler's Fourth Symphony this weekend.", "Great. That sounds great. Let's do it.", "Fantastic. Now, which section do you prefer?", "The first tier,", "the second tier, the third tier...", "The first tier.", "Now, which section of the first tier?", "Right, left, right center, center...", "Just any section is fine.", "[LAUGHS] Any section, wow.", "Someone had pepper on their eggs this morning.", "I'll buy the tickets. [EXHALES]", "[CHUCKLES] Any section.", "Guys, horrible news.", "The fridge broke this morning. Everything's warm.", "Doesn't seem like that big a deal.", "- Your yogurt's spoiled. - Who did this?", "Okay, everyone calm down.", "I will put a request in for a new fridge.", "Good luck getting that approved.", "Commissioner Kelly's already slashed our budget", "within an inch of its life.", "Yeah, the toilet paper's only one ply now.", "- My butt hurts all the time. - The AC is broken.", "My butt hurts all the time.", "Scully's butt hurts all the time.", "All right, guys, we get it.", "It's just that lunch is the one part of the day", "Commissioner Kelly hadn't ruined.", "People are pissed. Morale's really taken a hit.", "Okay, I got this.", "Hey, squad. Lunch is on me today.", "Taking everyone out for pizza.", "[PEOPLE CHEERING]", "And that's how you improve morale.", "Okay. You're not the only sergeant around here.", "Let me help.", "This side of the room, lunch is on me,", "and we're getting something better than pizza.", "Sushi!", "[PEOPLE CHEERING]", "Are you trying to outdo me?", "No, no, no.", "Just trying to raise morale.", "Cool. Cool, cool, cool.", "Morale, morale, morale. Okay.", "Wow, so this is your classroom.", "What's today's lecture about?", "I know you don't care about that.", "Just ask me what you want to ask me.", "Can I play with your laser pointer?", "You know, the laser pointer is a bit of a misnomer.", "It is simply a laser. The pointer is you.", "- That was awesome. - Take it for a spin.", "Don't mind if I do. Good afternoon, class.", "Allow me to make my first... point.", "- Very impressive. - Thank you very much, Kevin.", "But I do have five additional points to make.", "Chair, chair, wall, chair,", "Captain Holt.", "Captain Holt? No.", "[LAUGHS] Yes, that was a delicious lunch, Gary!", "And I agree, our group does seem happier", "than it was before.", "Oh, the pizza was that good?", "Pizza? Right, that's what I said we were getting", "before we decided to uh-snazz it up.", "Oh, you guys snazzed?", "Yeah, we snazzed all the way to La Petite Creperie.", "I thought we couldn't say \"snazz.\"", "Oh, no, I was thinking of f***.", "We can't say f***. Carry on.", "Tell 'em how good it was, Rosa.", "Tell 'em how high our morale is.", "- High. - Oh, stop gushing, girl.", "I think it's so interesting", "you guys didn't stick to your original plan,", "because neither did we.", "What? Why?", "Oh, you don't think we knew you were gonna snazz?", "[SCOFFS] We saw your snazz coming a mile away.", "That's why I took my team out", "for some big, juicy steaks, and...", "ALL: ♪ Mashed potatoes ♪", "♪ And some spinach and some key lime pie ♪", "- Thank you, Heather. - Mm-hmm.", "Well, that doesn't sound better than crepes.", "It is. Terry wins.", "We know. We were at both lunches.", "How? They were simultaneous and two miles apart.", "It was free food. Life finds a way.", "Okay, but you can't win", "because it wasn't a competition.", "So let's make it a competition.", "Same groups tomorrow?", "Okay, but let's agree at the end of this", "- that we'll still be friends. - No deal.", "Good! 'Cause I didn't mean it anyway.", "Hello, sir. How'd you find us out?", "Mahler's Fourth Symphony.", "He'd never sit in just any section.", "I might. I'm flexible.", "Oh, really? You'd sit center left?", "In timpani alley?", "I'll purchase those tickets right away.", "No, don't! Fine.", "Jake is helping me with a burglary", "here at the university,", "and I asked him not to tell you.", "- Is this about St. Augustine? - Yes.", "- What's going on? - He's embarrassed of me.", "Last Christmas,", "the classics department threw a holiday party.", "I had one drink too many and utterly humiliated myself.", "And that was the point St. Augustine was making", "in \"Consolation of Philosophy.\"", "Yeah, sounds super humiliating,", "saying something smart.", "Smart? I confused St. Augustine with Boethius.", "I might as well have stepped on a rake", "and bonked myself on the forehead.", "The problem wasn't what you said.", "It was that Dean Allister pointed out your mistake,", "and you lost your damned mind.", "I misremembered it because I'm reading both simultaneously.", "One book is too few for me.", "Where is everyone going?", "[CLATTERING]", "It was quite the kerfuffle.", "The problem is, is that I get flustered and defensive", "because I know how they all see me:", "as Kevin's working-class bimbo.", "I can't imagine that's what they think.", "- It is. - Really?", "Obviously I know that they're wrong,", "but they put you in your own head,", "and you're not yourself around them.", "I'm sorry, I was just trying to protect you.", "Yes, of course, thank you for saving me from myself.", "Now, if you'll excuse me,", "I'll just go sit by the pool and read some fiction...", "like the bimbo that I am.", "There's a pool here?", "Sir, wait. Oh! Wasn't expecting to catch up to you so fast.", "I don't know what to say now. I thought I was gonna have", "more running time to formulate it. Oh, I know!", "I'm sorry that we kept the case a secret from you.", "Oh, I understand why you did.", "The truth is, ever since I met Kevin,", "I've felt insecure in his world.", "I can't compete with these highly educated academics.", "I worry every day", "that I'll make one St. Augustine slip too many,", "and he'll realize...", "- I'm beneath him. - This is insane.", "You're the smartest person I know.", "I'll explain it to you. Among Kevin's peers,", "- I'm a Jake. - No, no, no, no, no.", "I refuse to live in a world where you're the Jake,", "because if you're the Jake, what does that make me?", "- The Charles? - The Hitchcock.", "The Hitchcock? Oh, my God.", "You dropped down so many more levels than I was expecting.", "Okay, you know what? Screw this.", "You are so smart, and we're gonna prove it to those professors.", "You're gonna work this case,", "and you're gonna find those coins.", "Well, I suppose it would be nice to show them", "I'm more than just a hot, dumb piece of ass.", "Yes! That's the spirit.", "Now get that hot ass moving,", "'cause we've got a crime to solve.", "Peralta, please, have some decorum.", "What? I was just using your words.", "Look, you teach people the way you want to be treated.", "That's what Dr. Phil says.", "Okay, lunchtime starts in ten minutes.", "Whichever team wins gets recorded", "on the Whiteboard of Victory.", "The winner will be decided by our judges,", "Hitchcock and Scully.", "Oh, my God, are we high status, Hitchcock?", "- I think so. - What a world.", "Ah, well, good luck.", "I'm sure you know all the best places to eat", "since you've reached Elite status on Yelp.", "Oh, wait, that was me.", "Oh, because Yelp reviewers", "are sane people with great taste?", "Oh, sorry, couldn't hear you over GourmetGlen12 saying", "that my review of the duck skin at the Hearth and Feather", "was helpful.", "Come on, Team Jeffords. It's chow time.", "[BOYLE CHUCKLES]", "We have a cool thing to say too.", "Team Santiago, let's lunch-a-bunch!", "- No, I don't say that. - Come on, Rosa, please?", "[MUMBLING] Let's lunch-a-bunch.", "Aha, Rosa said it!", "Did you hear that? Did you hear it?", "- Ah, Dean Allister? - Policeman Raymond.", "Good to see you. [CHUCKLES]", "Read any interesting magazines lately?", "This again? I was waiting for Kevin,", "I had finished my book, and I happened to glance", "at an issue of \"The Economist\" that someone left lying about.", "All I remember is you becoming unhinged.", "The only reason I picked it up was to swat a fly.", "I mean, I'm not crazy.", "Why are there always flowers here?", "So is policeman Raymond joining the case?", "Actually, he's leading it.", "Captain Holt is the finest investigator", "I've ever worked with.", "Sir, tell him our plan of action.", "- Clues. - Okay, you're freezing up.", "I'm just gonna take the wheel for now.", "There were no signs of forced entry,", "the only people with access to the archives", "were the professors in the department,", "and they all have alibis, which means...", "I don't know what you want me to say.", "Okay, that's my fault for throwing it to you again.", "Which means we need to examine the crime scene.", "It is there that we will find", "what Captain Holt has so eloquently described as...", "Clues?", "[SIGHS] Sir, you just said it.", "Cupcakes up, everyone.", "Heather, you already ate yours?", "The point is to eat it in their faces.", "[HORN HONKS]", "- Honk, honk, bitches. - What the hell?", "We rented a party limo,", "drove to Coney Island for hot dogs,", "and then did karaoke the entire time.", "I sang \"It Wasn't Me\" by Shaggy. Crushed it.", "But that's not even about lunch!", "- It's... - An experience.", "- Team Amy wins. - What?", "How did you get there? You were just with us.", "- Scully was with them. - Free food.", "Great cupcake, Sarge.", "But Amy still wins. Eat snazz, losers!", "[TIRES SQUEALING]", "Okay, so there were no witnesses,", "no cameras, and no prints.", "In other words, we have nothing.", "That's what you get when you put a bimbo on the case.", "Okay, well, let's not give up all hope just yet.", "We do know some things.", "For example, the perp entered using a key,", "which means they probably work here.", "And they knew enough to skip past", "all these expensive-looking artifacts.", "They walked straight up to this shelf", "and grabbed the coin case from up there.", "It's too high. You can't reach it.", "Exactly. So now we know that the thief", "was taller than me. That's a good lead.", "Also, we know they were a little bit of a freak,", "since I am above average height according to the 1940 census.", "I didn't realize you had a thing about your height.", "I don't! Because I'm above average.", "Why would I have a thing about my height", "when I'm above average? It doesn't make any sense. [SNORTING LAUGH]", "Anyways, we're looking for an insanely tall perp,", "a real Shaq type.", "Maybe the thief stood on something, like...", "one of these drawers.", "Turn off the light.", "Maybe something will show up under UV.", "- Bingpot! - A footprint.", "You did it, you brilliant bimbo.", "Oh, there you are. Why are you in the dark?", "Were you not able to find the light switch?", "Ha-ha, very funny, but I'll actually have you know", "Captain Holt just found a very promising lead.", "Oh, how fun, a lead.", "Meanwhile, we actually found the thief.", "- You did? - What?", "Well, technically our janitor found him.", "Come on in, Randy.", "Tell them how you did their jobs.", "Well, um, I was emptying the trash", "in Professor Port's office.", "I saw something shiny sticking out from underneath a notepad.", "It was one of the missing coins.", "Great police work.", "Perhaps you might want to hire Randy, or...", "Randy, you could hire them.", "It seems like you all have basically the same skill set. [CHUCKLES]", "We're actually all staffed up in maintenance.", "We don't want your job, Randy.", "I know Dean Allister Humiliated us, but we can still have our revenge.", "I watched a ton of horny '80s comedies when I was a kid,", "and they're filled with ways of getting back at mean deans.", "So we are gonna throw the wildest party", "- this campus has ever seen. - No.", "Okay, then we'll have a bikini car wash.", "No, no, save your schemes.", "I know exactly how to get back at the dean.", "- By arresting him. - For what?", "It seems pretty obvious that Port did it.", "No, no, that makes no sense.", "Why would someone steal something valuable", "and then leave it in their desk?", "I feel like this is a veiled shot at me", "for leaving the crown in my desk", "during the third Halloween Heist.", "- It is. - Oh.", "Allister planted the coin in Professor Port's desk.", "- They're rivals. - Mm.", "Did you see the book Allister was holding back there?", "A biography of Macedonian general Parmenion.", "He was taunting us.", "Again, I'm the Hitchcock here.", "You're gonna have to connect the dots for me.", "Parmenion was a close advisor to Alexander the Great.", "Alexander suspected that Parmenion", "was trying to supplant him, so he executed him.", "He was getting rid of his rival.", "Sir, you cracked it! You and your big hard brain.", "- Hard? - Yes!", "You have the biggest, hardest brain on Earth,", "and I want you to say it.", "Say \"I am Raymond Holt, and my brain is rock hard.\"", "A brain shouldn't be hard.", "If anything, I'll say, \"I am Raymond Holt,", "and my brain is soft and wet.\"", "No, don't say that. It's gross and I hate it.", "All right, let's go do some cop stuff.", "Wait, why does Terry's team have four wins?", "He only won steaks, bowling, and the mobile escape room.", "You're forgetting about our breakfast", "at the Empire State Building.", "It was so cold up there.", "It sounds a lot better than our indoor skydiving lunch.", "Speaking of which, are we gonna get reimbursed for that?", "How dare you complain about the Funtastic FlyZone.", "That was funtastic fun for everyone.", "So what are you guys planning for today?", "Oh, nothing much.", "We're just gonna keep it \"caszh.\"", "Us too. Super \"caszh.\"", "Super duper \"caszh.\"", "We all know you're both planning", "something insanely complicated and annoying.", "[LAUGHS] Your teammates are turning against you, Terry.", "- I'm on your team. - Who cares?", "We're gonna win. Team Lunch-a-Bunch forever.", "Sir, why are we still doing this?", "We've been following him for days,", "and he hasn't done anything suspicious.", "Let's just confront him.", "He only hid one of the stolen coins in Port's desk.", "He'll probably try to sell the others.", "I want to catch him in the act.", "[DOOR OPENS] Shh. Here he comes.", "♪ ♪", "[CHUCKLES] These college kids. I used to wear long-sleeve T-shirts", "under my short-sleeve T-shirts.", "Wait a minute, I still could.", "Hang on. He's stopping.", "Oh, no, he forgot his phone.", "He's gonna turn around and see us. Come on.", "- Sorry, sorry. - Oh, hey, guys, what's up?", "You want to join our a cappella jam circle?", "Oh, no.", "Are you guys Harry Potter fans?", "I do not like where this is going.", "Three, four.", "♪ Won't you come visit Hogwarts? ♪", "♪ I'll be alone, dancing in Gryffindor ♪", "♪ Harry is the best at the spells ♪", "♪ And as for potions, Hermione does well ♪", "This is actually pretty funny.", "You got to know Harry Potter.", "Wait a minute. Where'd Allister go?", "He was standing right here.", "It's like he vanished without a trace.", "Wrong, Peralta. He vanished with a trace.", "Check it out. His footprint. Gotcha.", "[WHISPERS] I am Raymond Holt and my brain is rock hard.", "- I'm not going to say that. - Smart.", "Saving it for a bigger moment in front of a bunch of people. Can't wait!", "Okay, squad, hope you ate lunch already,", "because it's lunchtime!", "- What's with the getups? - Oh, nothing much.", "We just turned the parking garage into an elaborate paintball arena.", "It's zombie-themed. We hired 60 actors.", "That sounds pretty expensive.", "Nah, New York actors are desperate.", "For ten bucks, you can shoot 'em right in the face.", "Wow, that's amazing.", "I don't know how anybody could ever beat that...", "except maybe an in-office teppanyaki grill.", "Moshi moshi, losers!", "We got shrimp. We got lobster.", "Heather, I know you're allergic to shellfish.", "You're just gonna have to not eat.", "Where's Heather? Where is everybody?", "They're on the roof by Gina's statue.", "- What the hell, guys? - Oh, God, they found us.", "- Don't let them take me. - Why are you hiding from us?", "This lunch competition has gotten out of hand.", "No one is having fun.", "I keep having panic dreams", "about Sergeant Santiago shooting down my lunch ideas.", "Historic walking tours don't win lunch, Gary.", "No one cares about winning lunch.", "Please, just leave us alone.", "[SIGHS]", "Gary, wait. Look...", "- Oh! - Ow!", "Why did you do that?", "Oh, my God, it was an accident.", "This thing doesn't have a safety.", "Ow!", "Ow, stop! Help!", "And a big round of applause for Janitor Randy for recovering our precious coin.", "Don't applaud for that man.", "- What's going on? - What's going on is,", "Captain Holt just solved this case.", "What's there left to solve? We found the coin", "in Professor Port's desk. He's the thief.", "Oh, you'd like everyone to believe that,", "wouldn't you, Dean Allister?", "Or should I say, General Parmenion?", "Raymond, are you causing a kerfuffle?", "Yes. Sometimes a moment calls for a kerfuffle.", "No. No moment calls for a kerfuffle.", "You know my feelings on this.", "Dean Allister framed Professor Port to get rid of a rival,", "just as Alexander got rid of Parmenion.", "Preposterous. Do you even have a shred of evidence", "to back up that claim?", "Oh, we've got more than a shred. Look at these photos.", "Here, a footprint from the scene of the crime", "left by the thief.", "And here, another print made yesterday by you.", "- You've been caught, Allister! - Is it happening?", "- Caught by me. - It is happening.", "- Me and my rock hard brain. - It happened!", "Oh, Raymond. Look around.", "These shoes I'm wearing with their \"unique footprint\"...", "We all have them. They were the departmental gift this Christmas.", "They're actually very funny.", "They have Achilles printed on the heel.", "I don't know if I would call that \"very\" funny.", "I'm surprised you didn't know about them.", "Kevin must have gotten a pair.", "Oh, I remember what happened.", "You had to leave the Christmas party", "before they were handed out.", "Why was that again? Oh, yes. The kerfuffle.", "But what about the autobiography of Persimminons", "you were taunting us with?", "I suppose I can see how holding any book", "would seem like a taunt to you.", "- I own a book. - But I don't think Raymond", "is remembering the story correctly.", "Alexander didn't see Parmenion as a rival.", "He killed him over a dispute about his son.", "Oh, no, it's Boethius all over again.", "At least you got one thing right.", "You do have a rock hard brain. Because that's bad.", "Everyone knows that a brain should be soft and wet.", "I wanted to say that, but Jake told me not to.", "Yeah, because it's gross.", "Thre you are.", "- You okay, sir? - I'm fine.", "I have decided to stop fighting it", "and lean in to the fact that I'm an idiot.", "Look at me, playing a video game.", "- Oh, which one? - \"Times\" crossword app.", "Not a video game.", "It plays a little song when you solve it,", "as if you've just learned to potty.", "[PIANO MUSIC ON PHONE] Yes, yes, play me my dunce's tune.", "Okay, so those guys look down on you. So what?", "I mean, Amy's parents look down on me.", "They talk about me right in front of my face in Spanish", "because they don't think I'm smart enough", "to learn another language, but I've been taking classes,", "and now I can understand all the hurtful things they've been saying.", "And how did that help?", "Well, now I know they think I'm short", "and I was able to do some research", "and find that 1940s census", "that proves I'm above average in height.", "- For 1940. - Yeah, I'm taller", "than the greatest generation. It doesn't matter.", "The point is, you can use this.", "There are benefits to being underestimated.", "My goodness. You're right.", "There are benefits to being underestimated.", "You can get away with anything.", "Sir? Are you going to kill the dean?", "No. What if the thief was someone we dismissed", "because they didn't have a classics background?", "Someone who wasn't a professor?", "But what about the footprints?", "The shoes were only given to faculty.", "There was one pair that was unaccounted for: Kevin's.", "They were left at the party...", "to be cleaned up.", "By Janitor Randy!", "My story solved it. I'm tall.", "Hey, everyone, we would like to say we're sorry", "for letting this competition get the best of us,", "and to make it up to you,", "we figured out what to do for lunch.", "Please, whatever your new idea is,", "I just don't want to get shot again.", "Ugh, Gary, it was a paintball. Suck it up.", "Isn't this supposed to be an apology?", "Yes. You're right. I'm sorry.", "I mean, I shot my husband with a real bullet two years ago,", "and it comes up way less than this.", "Way less than this.", "- Guys! - Right.", "What we're trying to say is that we lost sight", "of what this was all really about: building morale.", "So we bought two-ply toilet paper for the whole squad.", "- I call shotgun! - Shotgun!", "Also, I sold the teppanyaki grill", "and used the money to turn the briefing room into...", "the lunch zone.", "Oh, no. What's the lunch zone?", "Is it someplace we have to put on a harness and not eat lunch?", "There are no harnesses.", "There are phone chargers and noise-canceling headphones.", "So you can eat your lunch and stare at your phone", "and you won't have to see or hear anyone you work with.", "It's perfect. It's... it's absolutely perfect.", "We're so glad you like it.", "And just to be sure, I'm not gonna get shot.", "Oh, my God, Gary. Yes! You won't get shot!", "Yeah, I stole those coins.", "Can't believe you bought that whole story.", "They underestimated you, Randy,", "just as they underestimated Raymond Holt.", "Well, you guys haven't been that great to me either.", "Well, you got to teach people", "how you want to be treated, Randy. Dr. Phil, RIP.", "The point is, Captain Holt solved the case when no one else could.", "He's actually been stealing from these archives for years.", "You've been asleep at the wheel, Allister.", "- You're an embarrassment. - Really?", "Well, at least I've never confused St. Augustine with Boethius.", "Oh, who gives a rat's ass about Boethius, Wesley?", "What are you doing, Kevin?", "- I am creating a kerfuffle. - Oh, damn.", "Sure, my husband is a hot piece of ass,", "but he is so much more than just that.", "Raymond Holt is as smart as anyone in this department,", "but he chooses to use his intelligence", "to make our city a better place.", "One day, I hope to live up to the standard you set.", "You make me want to have a wetter brain.", "Oh, Kevin.", "Y'all are hella specific."]