[">I've just received the email about whether I've gotten", "the job as commissioner.", "Well, from the look on my face, I'm sure", "you can guess what it says.", "No. We have no idea at all.", "Just tell us, you monster.", "Really? No one noticed the slight", "tension in my labial commissure?", "- My lips. I'm smiling. - Wait, you're smiling?", "Wait, we're allowed to say \"labia\" again?", "- Wait, you got it? - I got it.", "Ohh!", "- Labia. - Commissioner Raymond Holt.", "- Labia. - You gotta stop right now,", "- Hitchcock. - We need to celebrate.", "Ooh, we need music.", "Ooh-ohh, ohh, I brought a \"Jock Jams\" CD for the wedding.", "Oh, we didn't talk about that.", "- It was gonna be a surprise. - Our first dance was gonna be", "the \"Tootsee Roll.\"", "Oh, no, and we didn't get to do it.", "I know. All right, nobody move.", "I'm gonna go get the CD.", "I want to thank you all.", "What an incredible moment.", "30 years of struggle and sacrifice.", "But it was worth it, because I finally get to read", "the ten words I've longed to hear:", "\"Raymond Holt, you are not the\"... oops.", "I misread the email.", "Didn't see the \"not.\"", "So...", "I will not be the new commissioner.", "♪ Y'all ready for this ♪", "Jock jam.", "Whoo.", "Why is on one else dancing?", "Did I miss something?", "Feels like I missed something.", "I'll just keep going until someone tells me to...", "- Stop, Jake. - All right.", "Synced &amp; corrected by MaxPayne == https://subscene.com ==", "Play one of the best new FPS shooters, search Steam for PROJECT WARLOCK", "So Captain Holt is taking another personal day.", "In his absence, I will be running things around here.", "- That's not true. - I'm in charge.", "Mm, no, it's gonna be more of a Westeros free-for-all, okay?", "Who will bend a knee?", "- I will. - Nobody's bending anything.", "Let's get started.", "Sarge, is Captain Holt all right?", "He never miss work.", "He said he was at a 49 and improving at 8.6% a day.", "So I guess he'll be in soon.", "Now, we have two...", "Guess who just got paid, y'all.", "That's right. We got stacks on stacks on stacks.", "Whoa. Where's all that cash from?", "Well, my brilliant wife found a crazy loophole", "called \"wedding insurance.\"", "It's very common.", "It's like renter's insurance.", "Oh, my God. Do we have that too?", "- Yes. - You are a wizard.", "The point is, we are getting refunded in full,", "so we are going on a super-deluxe, five-star", "mega-baller honeymoon.", "So you're not just going to the Berkshires anymore?", "Screw that crap hole.", "It's a dump, and anyone who goes there is garbage.", "I was gonna take Sharon there for a romantic weekend.", "Oh, well, congratulations, ya poor.", "I am so sorry. Money really changes you.", "The resort is called Posadita Bonita.", "And it's in Mexico.", "Great food, great beaches, and when I say", "\"Ay caramba\" there, I'll fit right in.", "I don't think so.", "Isn't that the place that Gina is always talking about,", "because she gets referral rewards points?", "Why, yes, it is.", "Don't forget to use code GINA30 at checkout.", "It's super intimate and super fancy.", "And when we're there, there's only one rule.", "A.B.C.", "Always be coconuting.", "At all times, we will either be drinking from, eating,", "or wearing a coconut.", "Oh, this place is amazing.", "I've never had sex outside the United States.", "What are you thinking about?", "Weirdly, the same thing.", "- Whoa. - Welcome to paradise.", "- Margarita? - Yes, I would love one.", "But is there any way you could put it in a coconut?", "It will be my pleasure, sir.", "Oh, thank you.", "I requested a ridiculous thing, and he's doing it.", "Quick, think of more stupid stuff we can ask for.", "- Grapes. - Sorry, I panicked.", "And I couldn't think of anything.", "No, no, no, grapes is perfect.", "Excuse me, sir, is there any way", "you could get my wife some grapes?", "- Yes, sir, right away. - He's running.", "He's running for the grapes.", "Here are your drinks", "and a lovers' toolbox from a Mr. Boyle.", "Ah, thank you so much.", "We will never open this.", "Oh, my God, Jake, look.", "Yes, the grapes.", "Oh, and you brought cheese.", "I don't even want cheese.", "No, Jake, in the lounge.", "Captain Holt?", "Peralta?", "Ay caramba.", "Gina, what the hell?", "New phone, who dis?", "You can't do that in person.", "It's Charles.", "Boyle. Your coworker.", "Oh, hey, Charles.", "I just found out that your mom left my dad.", "They're getting divorced.", "Eh, they had a good run.", "Fun fact: The average American marriage", "lasts fewer than two days.", "- That's not true. - It doesn't have to be.", "It's commentary.", "Well, you know who didn't think it was a good run?", "My daddy, Lynn Boyle.", "He's inconsolable.", "Well, I'm sure he'll get over it.", "No, Boyles don't \"get over it.\"", "It becomes part of us.", "It lives within us. It eats us out.", "We have to get them back together.", "- Pass. - Well, I'm doing it with", "- or without your help. - Okay, without.", "- Okay, you called my bluff. - It has to be with your help.", "And I'm not taking no for an answer.", "- No. - Okay, you did it again.", "Why are you like this?", "I don't know.", "Hey, Sarge, I have a problem, and I would ask Holt,", "- but since he's not back... - You came to Top Dog Terry.", "Smart move.", "I've been solving problems all day long.", "Okay, so you know that meth case I've been working on", "for the last two months?", "The Department of Sanitation police want to poach it", "from me, because the drugs were found in a dumpster.", "They're saying it's garbage-related.", "This is an easy one.", "Tell them to screw off.", "See? Problem solved.", "Yeah, well, I did that, and they threatened to make", "a formal complaint to the mayor.", "Then just let them have the case.", "Problem solved.", "Terry, I've been working on it for two months,", "and those dummies are gonna blow it.", "Right. Well, you could partner up with sanitation.", "Problem solved? Woof-woof?", "Nope. Headquarters won't allow it", "due to budgetary reasons.", "Okay, okay, okay, okay.", "You know, Captain Holt was writing an instruction manual", "for his replacement in case he was named commissioner.", "Maybe he could tell you what to do.", "That's not necessary.", "Top Dog Terry can make a decision.", "And what would that be?", "Does Top Dog Terry want a moment to think about it?", "Woof-woof.", "Since the rejection, a great sadness has enveloped me.", "I kept expecting this dark feeling to pass,", "but it's only gotten worse.", "Not getting the job you want stinks.", "In first grade, I was passed over for line leader,", "and I'm still pissed.", "Kyle D.'s lines had curves and gaps and cutting galore.", "It was a frickin' carnival.", "Yeah. What's a line leader?", "Well, it's not just that I didn't get the job.", "It's that John Kelly did.", "He's already released a memo detailing his", "\"vigilant policing\" initiative.", "It's essentially a return to stop and frisk.", "Choosing him is a betrayal of everything I stand for.", "I feel the same way about Kyle D.", "I tried to suck it up and go back to work.", "I put on my uniform and got in my car.", "And next thing I knew, I was on a plane to Mexico.", "I didn't even pack a bag.", "I bought a bundle of novelty shirts at a nearby gift shop.", "This one says, \"What's up, beaches?\"", "Instead of \"bitches\" for humor reasons.", "- But you hate humor. - Well, I'm a joke now,", "so it suits me.", "Mm-kay. But, how did you end up here in Mexico", "at the exact same tiny resort as us?", "Gina's been talking up this place up for years.", "Referral Code GINA30.", "I had no idea you'd be here.", "- You know what? - It's fine, sir.", "A lot of people go on their honeymoon with their boss.", "Nope, I thought if I said it out loud", "it would normalize it, but it's weird.", "It's gonna be okay.", "How long are you staying, sir?", "Just until I get my head right.", "But don't worry. I'll steer clear of you two.", "You won't even know I'm here.", "This place is so romantic.", "Yeah, and so... intimate.", "- Don't worry. - I'm not listening to you.", "I'm just thinking about how this sea bass is cold", "but not as cold and cruel as the hands of fate", "that have thrust my entire life into darkness.", "Ah, damn it.", "I just ordered the sea bass.", "Ahh, babe, this is so nice.", "There are hot stones on our butts for no reason.", "Not on mine.", "My butt stones keep falling off,", "because I'm so tense about Holt being here", "and ruining everything.", "- It hasn't been that bad. - Really?", "Oops. Sorry.", "Can't even float right.", "Just push me away.", "Everyone else does.", "It's not great, but as long as we stay in here, we're safe.", "Peralta, Santiago, I'm in your room.", "What? How?", "Patio door was open I pushed through the hedge.", "Tell me, what is it about me", "that screams loser?", "Yeah, you know, we're kind of in the middle", "of getting massages right now, sir.", "Oh, how thoughtless of me.", "I'll get down here so you can see my face.", "Oh, no, that's...", "Hello. The question was, what is it about me", "that screams loser?", "I can't figure out what went wrong between our parents.", "They were so in love.", "Oh, okay, so we're having a conversation?", "No, to get them back together,", "we need to know what happened. Did your mom tell you?", "- Nope. - Damn it.", "Okay, let's brainstorm.", "It could be that my dad is too clingy or too masculine.", "You know what? I'm going to play a game on my phone", "while you go on this little journey.", "He overshares, he's indecisive,", "he's always crying.", "Oh, I made it inside the temple.", "He wears a kimono a lot.", "- I became a hawk. - I have talons.", "Well, he can't keep a secret.", "He has a clinically loose pelvis.", "- Okay, that did break through. - I heard \"loose pelvis.\"", "Charles, you've got to stop.", "It's none of those things.", "Wait. You said your mom didn't tell you anything.", "- Do you know what happened? - Yes, I do.", "And it's none of your business, Charles.", "Just stop sticking your nose where it doesn't belong.", "Really, Gina.", "And where does my nose belong if not inside our parents?", "Okay, so we can get away from Holt.", "I mean, should we tell him to leave,", "that he's ruining our honeymoon?", "No, we can't.", "That would crush him, and he's already so crushed.", "Wait, I got it.", "We kill Holt.", "No.", "No, that was crazy for a multitude of reasons.", "We have a bunch of fun activities planned.", "If we include him, it'll cheer him up, and he'll leave.", "Right, but aren't most of our activities", "kind of geared towards couples?", "Name one couples' activity that wouldn't be more fun", "with your boss there.", "Welcome to Sensual Food Tasting:", "The Art of Feeding Your Lover.", "I feel like I don't belong here.", "Mm, I love how the mud revitalizes your skin.", "And I love how it masks my shame.", "I am loving this.", "- Mmm. - Mmm.", "Mmm.", "This is actually quite pleasant.", "You know, when you invited me to join you today,", "I was skeptical.", "I had been sitting by the pool", "contentedly watching a bee struggle to avoid drowning", "and thinking to myself how I am like that bee.", "Man, I hope it survived.", "We can't afford to lose any more bees.", "It didn't. The point is that I am glad", "you included me into your frivolous activities.", "You helped me to remember there's more to life", "than the NYPD.", "Wow, that's great to hear, sir.", "I feel a lot better.", "I think I may be heading home.", "Unless you need a third for tonight's activities.", "- What are we... - Sensual pottery.", "I think we're good.", "Sarge, I keep getting calls about my drug case from...", "What the hell is going on?", "Nothing. Just deciding what to do about", "your sanitation issue, like a boss.", "You're looking for Captain Holt's manual aren't you?", "Please, Diaz.", "Top Dog Terry does not need to look for Captain Holt's manual.", "He knows it's on his computer.", "Top Dog Terry was looking for the password.", "Why don't you just make your own decision?", "I did that, and I'm very proud of it.", "I just want to make sure Captain Holt would make", "the same decision so I can be proud of him too.", "Gina. Do you know Captain Holt's password?", "Oh, Terry, just because I know all your passwords", "doesn't mean I know Captain Holt's.", "Okay, well, we could probably guess it.", "Why don't you try BaldByChoice or PecMan", "or MacklemoreEnthusiast?", "- Stop saying my passwords. - Damn, Gina.", "Now Terry's got to update his keychain.", "Start simple. Kevin with a capital K", "and a 1 instead of an I", "Oh, I feel good about that.", "Locked out? Too many failed attempts?", "I only guessed once.", "Computer will now delete hard drive?", "I've got to fix this.", "Good. You fixed it.", "He's leaving. Our plan worked.", "We saved our own honeymoon, and fun bonus,", "- we cheered up Holt. - Yes.", "Okay, it's time to celebrate.", "You know what that means.", "This B needs a C in her A.", "Oh, my God.", "This babe needs a coconut in her arms.", "Oh, I thought you were saying", "this needs a in her.", "- Oh, my God. - Yeah, that was my reaction.", "All right, I'll go get us a couple of coconuts.", "Ahh, hey there, Captain.", "Haven't seen you looking this happy since they picked up", "\"The Durrells in Corfu\" for a fourth season.", "Yes, well, I've reached the best part of every vacation:", "Reviewing the charges.", "- Well, don't let me interrupt. - Have a safe flight.", "And I'll see you back at the Nine-Nine.", "No, you won't; I'll never be going back there again.", "- What? Why? - I'm confused.", "You and Amy made me see that there's more to life", "than the NYPD, so I'm quitting.", "Oh.", "Well... what a satisfying result", "that we all were hoping would occur.", "Hold on. So let's just back up a second.", "When you say you're quitting, you mean quitting", "for, like, a couple of weeks, and then you'll come back", "Jordan-style with a new badge number?", "No, I mean, quitting permanently,", "I'm putting in my resignation as soon as I get back home.", "I better hurry if I want to be at the airport", "six hours ahead of my flight.", "Hey, you know what?", "I should drive you there.", "Will you come with me to grab my keys from the room?", "Okay, they're just right in here, so...", "You're not leaving this room.", "What the hell is going on?", "I can't let you quit.", "Yes, but why the candles and rose petals?", "- Wuh-oh. - Is that Mr. McClane I hear?", "'Cause someone's about to Die Harrr... oh, my God.", "Why is Captain Holt here?", "Because he's gonna... wait, are you dressed like", "Bonnie Bedelia in \"Die Hard?\"", "- I am. - For sexy reasons?", "- Yes. - Oh, boy.", "Jake, why is he here?", "Because he's quitting the force,", "so I brought him to convince him not to,", "but obviously that is not important anymore.", "All right, Captain, it's been a good run.", "Thank you for teaching me the importance of a tie", "in the workplace, and the door is right over here.", "- Whoa, whoa, wait. What? - You're quitting?", "- Yes, I am. - No, you're not.", "We're keeping you right here.", "- How are you going to do that? - Physically restrain me?", "Great idea.", "Is there anything in Charles' box of nightmares", "that could be used to tie up Holt?", "Yes. Literally everything in here could be used", "to tie up a person.", "Wow, Terry, put Captain Holt's computer back together?", "- Looks great. - Sure did.", "Couldn't find room inside for this stuff, though.", "Well, is there any chance the info on in computer", "was maybe saved to the cloud?", "I don't know.", "Gina, was Captain Holt's hard drive backed up to the cloud?", "- Yeah. - Then why did you let me try", "to rebuild his computer?", "Because I'm a rascal.", "Okay, so I just log onto the cloud as Captain Holt", "and click \"forgot password\"", "and answer his security questions.", "First up: What is God?", "Hey, Gina.", "Did you see \"Real Housewives\" last night?", "If she says no, then ask about \"Below Deck.\"", "What are you doing?", "She's getting suspicious, Scully. Act natural.", "Are you wearing an earpiece?", "Tell her no. Scully, stop saying what I'm saying.", "Be normal.", "Charles, what are you doing?", "Damn it, Gina.", "What does it look like I'm doing?", "I'm trying to unlock your phone using a mask of your face", "so I can find out why your mom left my dad.", "Charles, give me my phone.", "Okay, fine.", "- Boom, unlocked it. - Give me my phone, Charles.", "Not until I find out or parents are breaking up.", "- Give it. - Scrolling, scrolling.", "- Give me my phone, you idiot. - You were the reason.", "You sent her a text that says, \"You should divorce him\"?", "Okay, yeah, but that's open to interpretation.", "No, but then she says, \"I don't want to,\"", "and then you say, \"But you have to.", "\"Leave him now, and divorce him.", "Don't tell him why.\"", "Okay, yeah, you did interpret it correctly.", "Shame, shame.", "I'm so sorry I brought Holt back here.", "I had no idea you were doing this whole \"Die Hard\" thing.", "Man, you really got the hair exactly right.", "Did you contact the onset hair stylist, Paul Abascal?", "No, this is a wig.", "- Oh, that's cool too. - So here's what I'm thinking.", "We let Holt go, I have sex with Holly Gennaro but hotter.", "The squad handles the captain, or disbands, whatever,", "we have sex again...", "- Okay, stop suggesting that. - We need to stay focused.", "- Right. - Holt it fragile.", "We need to be gentle, okay?", "- Just follow my lead. - With pleasure.", "I love the view. I'm sorry.", "This outfit is driving me insane.", "Hello, sir. Sorry again for tying you spread eagle", "- on the bed. - Apology not accepted.", "Look, I know you're upset, but this isn't", "your last chance to become commissioner.", "John Kelly's old.", "He's not gonna be in office forever.", "True, but he'll just be replaced by another", "mediocre old white man.", "Nothing will ever change.", "All right, well, what about all your goals", "for the Nine-Nine?", "You still have so much left to accomplish.", "Wrong, I've accomplished everything", "that I set out to do.", "I wanted to reduce crime, and I did.", "There's no crime in Brooklyn anymore.", "Seems like a bit of a stretch.", "What about improving community relations?", "Done. Everyone loves the police.", "It's embarrassing.", "Way off. All right, Ame, step aside; I got this.", "Captain, what about the Halloween Heist?", "I'll just come in and win it and then go back to my house.", "- Damn it. I'm out. - Jake.", "All right, fine, sir, do you know why I love coming to work?", "Because there's a bumper pool table in the break room.", "Yes, obviously I love the bumper pool table.", "But do you want to know another reason why?", "You.", "You've made me a better cop.", "You've made me a better person.", "I've learned so much from you.", "So you can't quit.", "Because I need you.", "- Oh, please. How selfish. - What?", "That little speech you just gave.", "It was all about you and what you need.", "How unbelievably selfish.", "Okay, well, I don't want to get mad right now,", "'cause Amy is worried about you, so...", "No, screw that noise.", "How dare you call Jake selfish?", "He just wasted his entire honeymoon", "trying to take care of you while you wallowed", "in your misery like a little baby.", "- That seems a little harsh. - Oh, does it?", "- I don't give a hoot. - Oh, damn.", "For the last five years, all I've done is", "give a hoot about you and what you think.", "I gave a hoot about you as a boss.", "I gave a hoot about you as a mentor.", "I gave a hoot about you as a friend.", "She gave so many hoots.", "- Not anymore. - After the way you've acted", "and what you just said to Jake, I don't give a hoot,", "what you think, and I really don't", "give a hoot if you decide to quit the NYPD, so do it.", "I'm all out of hoots.", "I'm hootless.", "- Now, what I want to say is... - Jake.", "Coming Holly Gennaro.", "Hey, I thought piña coladas might be too festive,", "so I got two super-depressing coconuts filled with merlot.", "- I'm not depressed. - I'm relieved.", "For the first time all week, it's just the two of us.", "I'm right here.", "I escaped using some of the lube Boyle sent you.", "It got everywhere. I had to change.", "Yeah, and your new shirt is very aggressive and confusing.", "Is the pineapple the slut,", "or is it calling someone else a slut?", "Clearly the pineapple is the slut.", "- Huh. - Look, I wanted to say", "- I'm sorry. - Yeah?", "Maybe find someone who gives a hoot.", "Try an owl cage.", "Oh, honey, I love you, but not your best.", "Look, you have every right not to accept my apology,", "but at least hear it first.", "I'm sorry I said Jake was selfish.", "I'm sorry I ruined your honeymoon.", "I'm sorry I interrupted your \"Die Hard\" -themed sexcapades.", "You don't have to list everything; It's cool.", "Right. I thought if I played by the NYPD's rules", "and didn't make any waves, one day I would rise to a position", "where I could make meaningful change.", "When they hired John Kelly, I realized I was wrong,", "and I thought I was out of options.", "But then you tied me to your bed, legs akimbo,", "and made me realize there was another way.", "I could not give a hoot.", "Wow, the hoot thing is catching on.", "Didn't see that coming.", "I'm going to go directly to the mayor and tell him", "John Kelly's \"vigilant policing\" proposal", "is regressive and counter-productive,", "and if he implements it, I'm gonna make", "a big stink in the press.", "Going over the commissioner and threatening the mayor, sir?", "Don't you think that'll piss him off?", "I don't give a hoot.", "Listen, I'm on the next plane back,", "but I wanted to pay for you two to extend your stay", "so you can have a proper honeymoon.", "Oh, sir, thank you.", "That's very nice, right, Jake?", "Yeah, super cool.", "Just out of curiosity asking for a friend,", "where did you get the shirt, and how much did it cost?", "Ooh, you're still wearing the mask?", "- Yeah, to hide my sadness. - I'll take it off.", "No, don't.", "For some reason, it's easier to care about what you say", "when you look like me.", "Why did you tell your mom to leave my dad, Gina?", "Is it so bad being a Boyle?", "Yes, it terrible, but that's not why I did it.", "My mom was cheating on your dad,", "so I told her she had to break it off.", "What? Why didn't you tell me?", "Because I didn't want to hurt you or him.", "She was being disgusting, so I told her she had to end it.", "You were trying to protect us.", "Gina, you were actually being sweet.", "Uh-doi.", "- How's it going, Sarge? - Not good.", "I'm reading this book on religion, and apparently", "there's some debate as to what God is.", "Don't worry about it.", "- Gina had the manual. - What?", "Why didn't she just give it to me?", "'Cause she's a rascal.", "Look at what it says.", "\"Never use italics, lest people think you are", "a con-man or a clown.\"", "I'm not sure how this applies here.", "No. Under that.", "\"If you are unsure of what to do in any situation,", "consult Sergeant Jeffords.\"", "I trust him completely.\"", "Well, that's a kick in the butt.", "So what should I do, Sarge?", "Tell sanitation you'll work the case together.", "You're the primary, and HQ can take it out", "of the supplemental budget.", "- I'll find the room. - Cool.", "Top Dog Terry's back.", "Okay, you ready?", "Mm-hmm.", "Hello.", "Oh, my God.", "Are you Melvil Dewey?", "Indeed I am.", "I invented the Dewey decimal system,", "but right now I'm working on the Do-me decimal system.", "Mm-hmm, yeah.", "This is really working for me.", "- Really? - Yeah.", "- Awesome. - So, Mr. Dewey,", "can you save me from the terrorists that have taken over", "Nakatomi Plaza?", "Yes, Holly Gennaro,", "I just need file them in the library... card... catalog.", "Yeah, this is really hard to track.", "Let's just take our clothes off.", "- Oh, thank God. - This old jacket is so hot.", "Yeah.", "That was magical.", "- I can't believe we're back. - I refuse to accept it.", "I'm still coconuting.", "This is filled with coffee.", "It is very hot.", "Coconut is not a good insulator.", "No, it's not.", "- Captain. - Peralta, Santiago,", "how was the end of the honeymoon?", "It was amazing.", "Not to brag, but I saw a sea turtle.", "Kind of sounds like you're bragging, babe.", "- I was. - It looked right at me.", "- How'd it go here? - Did you contact the mayor?", "Yes. I voiced my concerns as soon as I got back.", "He heard me out, and he's put John Kelly's", "\"vigilant policing\" initiative under review.", "Way to go, No Hoots Holt.", "- Was Kelly pissed? - Very much so.", "To retaliate, he closed the bottom floor of the Nine-Nine", "for renovations indefinitely.", "Everyone's been moved to our bullpen.", "Wait. What?", "Prepare yourselves.", "The Nine-Nine is at war with the NYPD.", "Ay caramba.", "- Not a doctor. - Shh.", "Fremulon."]