[">Bottles.", "Boyle. Bullpen.", "- What are you... - Buh-buh-buh.", "Bottles, Boyle, bullpen.", "Bowling.", "Behold, Brooklyn buddies,", "Boyle bullpen bottle bowling.", "- Beautiful. - Be brave, bro.", "Be brave.", "Bowl!", "[screaming in slow motion]", "[dramatic music]", "- Bam! - Bull's-eye!", "Booyah!", "Babushka!", "ALL: Babushka!", "[upbeat music]", "♪ ♪", "Jakey, I've got a hot case for you.", "Ooh, hit me.", "Okay, Susan Buckley was reported missing", "by her psychiatrist, Dr. William Tate.", "He thinks that her husband James", "may have had a mental break", "and done something terrible to her.", "Ooh, that is a hot case.", "Missing woman, psycho husband, creepy shrink.", "Dr. Tate was actually quite a nice man.", "Yeah, but you know, he's a psychiatrist,", "so he's automatically a creep. I've seen movies.", "They all turn into super sophisticated,", "Chianti-loving cannibals.", "Wait, have you never been to therapy?", "- No. Don't need it. - Not even after the time", "- your wife shot you? - Nope.", "What about when you were held at gunpoint", "and had to write your own suicide note?", "Oh, that was crazy. I forgot about that.", "Or when you were falsely accused of bank robbery", "- and went to prison? - Was that a big deal?", "You joined a gang and tried meth!", "I didn't want to be anyone's bitch.", "Look, it sounds like these things affected you", "more than they affected me. Maybe you should go to therapy.", "I do. Terry needs a safe space", "to process his emotions.", "I go twice a week. Couples counseling with my dad,", "and then a solo sesh with Dr. Tyler.", "Okay, unlike Kooky Charles and Tearful Terry,", "I am healthy and don't need therapy.", "I hear that. I don't go to therapy either.", "Jake and I are like two penises in a pod.", "Damn it, Hitchcock, we talked about this.", "It never helps when you back me up.", "Let's just go, Charles.", "- [knock at door] - Come in, Diaz.", "- How'd you know it was me? - The restrained knock.", "Everyone else in this office", "plays my door like it's a marimba.", "The other day, Jeffords gave it three taps", "- and two raps. - Was he drunk?", "- One can only assume. - Mm.", "Anyway, I wanted to invite you and Jocelyn", "to dinner at my house this weekend.", "Kevin will be making his famous rice.", "Thank you for the invite, but I'm not really", "having people meet Jocelyn yet.", "I'm still feeling things out with her.", "But Boyle says you brought Jocelyn to Shaw's last week.", "That was unplanned.", "Sure, but now that the squad has all met her, surely you can't object", "to her having some rice with Kevin and me?", "Okay, it's just that you can be a bit... judgmental.", "What a stupid thing to say.", "Name one time when I have been judgmental.", "- Okay. - What a stupid thing to say.", "Oh, I see. Mere seconds ago.", "Sir, Jocelyn is not like us.", "- She has feelings. - Huh.", "Are you positive this is the woman for you?", "That is exactly the type of thing", "I don't want you to say in front of her.", "Sorry. It's not gonna happen.", "[footsteps departing]", "Kevin, they're not coming.", "Yes, I know you've already started soaking the rice.", "Couldn't we just eat it ourselves?", "I understand you purchased four portions of rice.", "Yes, that's a great idea.", "We'll eat the extra rice for breakfast.", "I love you, as well.", "Hey, Sarge, a package was delivered", "to my desk downstairs, addressed to the 99th Precinct,", "attention: Sergeant, but it's not for me.", "It's a book.", "Sounds like something you'd order.", "\"How to Please Your Wife:", "100 Tips to Take Your Sex Life from Blah to Ahhhh.\"", "Yeah. That's not mine.", "It also shipped with two gallons of protein powder.", "Well, I get my protein from real food.", "22 meals a day, 1 every 40 minutes.", "It's not a big deal, okay? Just take the book.", "I promise I won't tell anyone.", "Hey, Sarge, I heard you need some sex tips.", "Except for the people I already told.", "Here's the big one: just lie flat on your back.", "- Women love to do all the work. - Ugh.", "That's very incorrect, and I don't need sex tips!", "Okay, we'll just leave the book here,", "and whoever did order it can take it when nobody's looking.", "It's not mine!", "Terry doesn't order books online.", "He supports local bookstores.", "They're dying, Amy!", "Oh, that guy looks like he's wearing a skin mask", "over his own face, so I'm guessing it's Dr. Tate.", "He has a normal man's face, Jake.", "Yes, he does have a normal man's face,", "stretched out over his own face,", "because he is a Hannibal.", "Hi there. Dr. Tate, I presume.", "Yes. Hi, nice to meet you.", "Uh, which one of you is in charge?", "- Let the mind games begin. - Excuse me?", "Sorry, I am Detective Peralta.", "This is Detective Boyle. He's in charge.", "Dr. Tate, have you heard anything from Mrs. Buckley?", "No, I haven't, and I'm quite worried.", "I received a frantic,", "disturbing call from James yesterday.", "He was afraid he'd done something horrible.", "I asked him where he was,", "and he said he was in the park near the Zen garden.", "I suspected he was just experiencing delusions,", "but when they didn't show up for therapy today,", "I became very concerned.", "So you think he killed her", "and dumped her body in the park?", "Sounds like couples counseling", "is going really great for them.", "Sorry, my partner doesn't believe in therapy.", "Oh, that's fine. It's hard for some people.", "Title of your sex tape. [exclaims]", "Are you normally so cavalier around murder investigations?", "Yes, we see a lot of darkness in our line of work,", "and humor is one of our coping mechanisms.", "It's self-preservation through disassociation.", "What the [bleep]?", "It's something I've been working on with my therapist.", "Well, I act like this", "because I'm cool and fun and people like being around me.", "I'm so sorry. I didn't mean to trigger you.", "Okay, Doc, you're not in your office.", "You don't have to use words like \"triggered\" or \"in denial.\"", "I didn't say \"in denial.\" Are you in denial?", "No, I am not, and before you say anything,", "I don't want to sleep with my mom either.", "Now, why would you bring that up unprompted?", "What? You prompted it.", "Jake, there's a body over here.", "Oh, thank God.", "I mean, \"Oh, no, death.\"", "I mean... I don't want to sleep with my mom, okay?", "I know this is the wrong takeaway from this case board,", "but I really love the new yarn you're using.", "- There are sparkles in it. - I noticed.", "Okay, so let's go over what we got.", "No witnesses, no weapon. Bruising indicates a struggle.", "No conclusive DNA found at the scene", "other than from the three of us who found the body.", "And our chief suspect, James Buckley, has disappeared.", "But he has no motive, no criminal record,", "and according to his credit card statement,", "had just purchased two sombreros.", "Kind of weird to give someone a sombrero", "when you're about to murder them.", "Well, both sombreros could have been for him.", "It's always good to have a backup sombrero.", "Please stop pronouncing it like that.", "What, pronouncing sombreros", "- like sombrero? - Yes.", "[Spanish accent] Fine, if you want me to pronounce it the wrong way.", "Look, I think James is a good suspect.", "We have Dr. Tate's notebooks,", "and they specifically mention that he's been having", "violent fantasies for the last few months.", "And you want us to just blindly trust Dr. Tate?", "He's a creepy therapist. They all are.", "What kind of profession requires a couch?", "Lots of them. My cousin Pam has a couch", "in his bird store. Would you call that creepy?", "Yes! Decidedly so.", "You always get upset when I bring up Pam.", "Whatever. Can we please just go check out James's apartment?", "Mm-hmm.", "♪ ♪", "Hello, gentlemen. How is your day going?", "Great. I just woke up from my morning nap.", "[stammers] I mean, my... morning nap.", "It's fine. It's good to be rested at work.", "Okay. Are you trying to prove that you can be nonjudgmental?", "Rosa, I didn't see you there.", "I was just having a friendly chat with my employees.", "So, uh, boys, tell me, what are you doing this weekend?", "Well, we're going to a sauce launch party at Wing Slutz.", "Sounds like a neat cultural event.", "They're introducing a new dairy-based sauce", "called Cream Dream.", "Mmm.", "And everyone who comes gets a free bucket.", "You want to know what that's called?", "- Of course I do. - No, you don't.", "None of us do. You proved your point.", "If you want to meet Jocelyn so bad, you can.", "You win.", "Okay, well, that's Friday night.", "Now, every Saturday morning,", "we go to the public baths.", "I get it. You lead colorful lives.", "Let's end this, shall we?", "Okay, so the neighbors say they haven't seen or heard", "any activity in the Buckleys' apartment, and...", "What is he doing here?", "If we find James and he's unstable,", "Dr. Tate could talk him down.", "- Hello, Peralta. - Plus, on the ride over,", "- he gave me a quickie. - A what?", "A quick therapy session. We talked about so much.", "Did you know that I have a tendency", "- to be unconsciously sexual? - Yes.", "It's a real tough nut to bust.", "Oh, you're doing it again.", "Oh, okay, I think I hear it.", "- You think you hear it? - Mm-hmm.", "Whatever, let's just do this, okay?", "NYPD, open up.", "[knocks on door] That's weird.", "- The door's unlocked. - That's too bad.", "I love watching you pound one out.", "- Charles. - What? That was sexual?", "- Which part? - All of the parts!", "All right, you stay here.", "Charles, we're going in.", "♪ ♪", "- Bedroom's clear. - The kitchen's clear.", "Did you see anything suspicious?", "Nothing, except for these", "laughing Jesus paintings everywhere.", "- Why is he in front of a tepee? - I don't know.", "The one in the kitchen has him at the last supper,", "but all the apostles are McDonald's characters.", "- Which one's Judas? - BOTH: The Hamburglar.", "Knew it as soon as I asked. You check the bathroom?", "- No, where is it? - It's right over there.", "♪ ♪", "- Clear. - Cool.", "Cool, cool, cool, cool, cool. Well, Dr. Tate,", "we will meet you back at the car.", "We just want to check some things out for one more minute.", "- Did you notice that? - The painting in the bathroom", "of Jesus standing over a vent", "with his robe blowing up like Marilyn Monroe?", "No. Dr. Tate is the killer.", "- Hey, Santiago. - Hey.", "Can you help me put up these flyers around the office?", "Mm-hmm.", "\"Lost sex book. Delivered by accident", "to Sergeant Jeffords, who doesn't need it.\"", "Terry, come on.", "Nobody cares about your sex life.", "Just take the book home.", "[laughing]", "Take someone else's book home?", "That's stealing and mail fraud.", "I can't believe you would even suggest that.", "Look, I think it's so great", "that you've been married so long", "and want to keep it fresh.", "I hope Jake does that for me if our sex life ever takes a dip.", "Dip? Oh, there is no dip.", "- Just ask Sharon. - Oh, no, please.", "I don't want to do that. That's not necessary.", "- It's okay. I believe you. - Hey, hon.", "Yeah, could you tell Amy how good I am in bed?", "Because I'm a sex machine who...", "Oh, on speaker?", "Oh, hey, girls. How was school?", "Why do you think Dr. Tate's the murderer?", "He already knew where the bathroom was.", "He's clearly been here before.", "Well, he probably just guessed, because it's obvious.", "This is New York.", "It's never obvious where the bathroom is.", "I once had an apartment where the toilet", "was literally in the refrigerator.", "I bet he was sleeping with Susan.", "Therapists are always having affairs with their patients.", "- That's not true. - Oh, really?", "Tell that to the ten minutes of \"Bikini Shrink\"", "I watched on Cinemax when I was 13.", "Dr. Juggs was insatiable.", "James was ill. We have months of notes", "saying he was increasingly unstable.", "First of all, people with mental illness", "are much more likely to be the victims than the perpetrators.", "I heard that on NPR when I was in the room", "- while Amy was listening to NPR. - Ah.", "And second, I bet Dr. Tate's notes are fake.", "I mean, you know what was in Dr. Juggs's notes?", "- What? - Stick figures doing it.", "- What does that prove? - I don't know, but it was hot.", "All I'm saying is, something feels suspicious to me here.", "Maybe we should go to Dr. Tate's office", "and see if we can find the missing notebooks.", "Wait, you're basing this all on the fact", "that he knew where a bathroom was?", "And his DNA was at the scene where we discovered the body.", "[gasps] I bet that's why", "he insisted on coming with us to the park.", "You've been weird about Dr. Tate from the start.", "To me, the evidence suggests", "that James killed his wife and fled.", "It's my case, and that's the lead we're following.", "Okay.", "You're right. I'm sorry.", "I was being unfair. It's your case.", "You call in an APB,", "and I will meet you back at the precinct.", "I'm just gonna swing by the bank.", "You're not gonna go to Dr. Tate's office", "and search it behind my back, are you?", "What? Charles, no.", "I wouldn't do that. You can trust me.", "- Okay, I trust you. - Good. You should.", "- Well, I do. - Great, because you can.", "- I feel good about it. - Good, you should.", "I think it's the right choice.", "You're making the right call by trusting me.", "Not.", "\"Wayne's World.\" Sweet.", "[lock clicks]", "All right, think.", "Where would I hide the real notebook", "if I was a creepy therapist?", "In my butt. [chuckles]", "Focus, Jake.", "Now is not the time for being hilarious.", "[faint rustling]", "What have we here?", "James and Susan Buckley.", "[voices in hallway]", "So your day's been going well?", "- It has, it has. - They're blocking my way out.", "A cancellation, and so I was able", "to get more work done.", "Yeah. Well, that's always nice.", "Same thing happened to me yesterday.", "- Is that right? - Yeah, two cancellations.", "You know? At least it wasn't three.", "- [laughs] - Have a good afternoon.", "- You too. - Okay.", "See you in the morning.", "Oh, um, can I help you?", "Yes.", "I am...", "your new patient.", "- Garrett? - Garrett...", "is my name, yes.", "You're an hour and a half early.", "I know. I have problems with time management.", "That's the issue I want to talk about.", "On the phone, you said you were concerned", "you might have multiple personality disorder.", "Yep, that too.", "Got buttloads of peeps living in my brain,", "no doubt, no doubt, no doubt, no doubt, no doubt.", "We should talk about it.", "I can't believe it's taken so long for us to meet.", "You're so nice.", "Oh, I don't know about that, Jocelyn.", "I'm just being myself.", "Well, you're very sweet", "about the cosmetology thing.", "A lot of people are dismissive of hairstylists.", "It makes no sense.", "If we didn't have hairstylists to cut our hair,", "our hair would be far too long.", "- [laughs] - Wow, great compliment.", "Hey, you're the girl", "from the diarrhea commercial, aren't you?", "You get diarrhea on the plane.", "- That's not true. - Yeah, move along.", "I don't get diarrhea on the plane.", "I get diarrhea in the airport.", "What's going on?", "Are you... an actor?", "Well, you don't have to sound so grossed out.", "I can see why you didn't want him meeting Jocelyn.", "- Excuse me? - This isn't Jocelyn.", "It's Sheena. She's an actress.", "Yeah, I was in an episode of \"SVU.\"", "I say, \"We want answers.\"", "The director tried to replace me,", "but Mariska said it would take too much time,", "and then they all agreed I'd probably cut together fine.", "Look, Diaz, I've obviously misread our relationship.", "You didn't want me to meet the real Jocelyn", "because we're not as close as I thought we were, so...", "message received.", "Hey, so you don't by any chance", "need any molly, do you?", "- I'm a cop. - And scene.", "Now I'm out of character, and I don't sell any drugs.", "I am leaving.", "So, Garrett,", "where would you like to begin?", "You know what, can we crack the door a little?", "I get very claustrophobic,", "probably from all the different people living in my head.", "We usually keep it closed for privacy,", "but whatever makes you comfortable.", "Thank you.", "Damn it, he's still here.", "- Excuse me? - Hmm?", "Uh, I was just talking to another one of the voices.", "- Is it Tatiana? - Who now?", "The mischievous seven-year-old British girl", "you told me about on the phone?", "May I speak with her?", "Uh...", "[high-pitched British accent] Yes?", "Hello, Doctor.", "I'm from Wussex.", "Is that an actual place in England?", "How should I know?", "I'm just a little girl, I am, I am.", "Well, it's nice to speak with you, Tatiana.", "Can I say hello to Brian,", "the bookkeeper from Central London?", "[in accent] Cheers, I'm Brian.", "I like bookkeeping right in the middle of London.", "Did I tell you a full list of my many personalities", "when I called you on the ol' telly, innit?", "Yes, you did.", "And are any of 'em, hopefully,", "not from England?", "There's Geoffrey.", "You said he's Australian.", "Aww, crikey.", "Hey, Sarge. I saw the flyers.", "You really put a lot of them up, huh?", "I just want to make extra sure", "we find the real book-buyer.", "Do you think it's this kind of overcompensation", "that's been making things difficult in the bedroom?", "Oh, I don't compensate.", "I procreate. Three kids.", "Okay. Weird brag.", "Look, just take the book. Nobody cares.", "Hey, I just saw this. I think you have my book.", "Oh, really?", "Told ya!", "But you're not even married, Scully.", "I'm in a committed relationship,", "and Cindy Shatz says I'm a selfish lover.", "All right, well, what about the protein powder?", "I'm trying to get ripped.", "I drink, like, six shakes a day,", "but nothing's happening.", "- Do you also exercise? - What?", "You're supposed to exercise?", "You know what, keep the powder.", "I'll drink normal milkshakes.", "And you thought that was my book.", "[laughs] Shame on you, Amy.", "Shame on you.", "You got the book?", "You should know, things are good with Sharon.", "I just want to make sure we're as happy in our relationship", "- as we can be. - That's nice, Sarge.", "Sorry you had to embarrass yourself.", "Not a big deal.", "I guess I just don't care what other people think of me.", "That's actually pretty inspiring.", "I wish I was more like that.", "Yeah. Now, if you'll excuse me...", "Whoa, whoa, whoa, hey, hey!", "You're not gonna wait for me to leave?", "Like I said, I just don't care.", "Well, Garrett, our time is up.", "Shall we pick up here next week?", "No, I can't go.", "There's still someone left inside that wants to talk.", "Do you mean Satchel,", "the \"gentle African-American man", "who was born in 1908\"?", "Oh, no, you know what?", "Satchel probably shouldn't come out right now.", "Or ever, for that matter.", "Garrett, I can only help you", "if you open up.", "[sighs]", "[deep voice] And then Dufresne", "escaped through the tunnels of Shawshank Prison.", "He was my friend.", "Are you just doing Morgan Freeman?", "Ah, yes!", "You calling me on it", "just gave me a major breakthrough.", "I'm cured! Anyway, deuces, Doc!", "♪ ♪", "I've got you now, you son of a bitch.", "- Hello, Peralta. - [screams]", "You really thought you could sneak around my office", "without me noticing, huh?", "How'd you know I was in there?", "Your shampoo left an odor.", "I could smell you.", "I knew it! You're a Hannibal.", "Pull over right here. Cut the engine.", "Why are you doing this?", "Because you found my notebooks,", "and I assume you've deduced what I did to Susan and James.", "- You killed James too? - Oops.", "I guess you only deduced the Susan part.", "But it doesn't matter.", "You never would have thought that James was a suspect.", "He was such a kind and gentle man.", "So why did you kill them?", "Well, because they were gonna tell people", "about my affair with Susan and ruin my career.", "- I knew it. - I had to do it", "for the sake of my other patients.", "You know, there are a lot of people", "who depend on me for their well-being.", "Yeah, except for the ones that you murder.", "- That's only happened twice. - It's happened before?", "The Rothmans. Nobody misses them.", "You really are a terrible therapist.", "Oh, wow, strong words for someone", "who is clearly scared to talk about his own issues.", "I'm not scared, okay?", "For example, I had an issue", "with texting while driving, but I fixed it.", "Now I just don't look at my phone while I type.", "Case in point.", "Just know that you died", "without saying anything real.", "Okay, okay, okay! Stop.", "Fine, you want something real?", "I tried therapy. It only made things worse.", "Uh-huh. Go on.", "When I was a kid, I was acting out at school,", "so they made me and my parents do family counseling,", "but instead of helping me with my problems,", "the stupid therapist just brought up", "all my parents' issues.", "And once it was all out in the open,", "they fought all the time and eventually got divorced,", "and everything good in my life just... went away.", "Interesting. So you actually", "blame yourself for your parents' divorce?", "No, I blame the therapy,", "which we only had to do because I...", "oh, my God.", "I do blame myself.", "[choking up] Oh, here come the waterworks.", "[machine whirring]", "Excuse me, do you have a less crinkly dollar", "- I could trade you for? - Of course I do.", "None of my dollars has a single crinkle.", "When they do, I steam them.", "Oh. Wow, that is crisp.", "Can't wait to get this baby home and flatten it out.", "[keypad beeping]", "- Almonds, nice choice. - Oh, thanks.", "They're, uh... they're not for me.", "They're for my girlfriend, Detective Diaz.", "Oh, you must be Jocelyn.", "What? No, I'm Denise.", "Who's Jocelyn? Is Rosa cheating on me?", "Oh, my...", "No, that was a joke.", "I'm sorry, I thought it would be funny.", "I am Jocelyn.", "Oh, that was actually very funny.", "I didn't know what was happening,", "and then I thought I knew what was happening,", "but what I thought I knew was happening", "wasn't what was happening.", "That's very good.", "- You must be Captain Holt. - Mm-hmm.", "- Hey. - Hey.", "Uh, can you give us a second, babe?", "Yeah, I'll wait out there.", "Pleasure to meet you, Captain.", "So this is Jocelyn?", "I'm glad you got to meet her. For the record,", "I wasn't keeping her from you because I was afraid", "you were gonna hurt her feelings by being judgy.", "I think it's hilarious when you're judgy.", "It's because I was afraid you weren't gonna like her.", "You and I are close, and I...", "I value your opinion.", "Well, she seems great,", "in our limited interaction.", "Maybe you could get to know her better", "over Kevin's rice this weekend?", "That would be great.", "You might want to save your girlfriend.", "She's talking to Hitchcock.", "Damn it, Hitchcock!", "So I joke about my father so much", "to avoid processing all the pain he's caused me.", "Yes. You are doing such great work here.", "- I'm really feeling it. - Yeah.", "Now, I'm sorry, but our session is coming to a close.", "I guess I'll have to bill your widow.", "Wow, that is cold-blooded,", "but I got to hand it to you, it's a pretty dope kill line.", "Unfortunately, no one will be billed, though.", "Isn't that right, Charles?", "- Hi, Dr. Tate! - What? How did he...", "Told you I could text without looking at my phone.", "Let's go.", "Oh, man, I am so glad", "you got my message with the location.", "Pretty impressive, right?", "Well, actually, you just texted", "a bunch of crazy, weird, random letters.", "It made me concerned, so I tracked your phone.", "Well, still pretty good. I found you in my contacts.", "It went to Amy. She forwarded it to me.", "It worked. Let's stop talking about it.", "Listen, I'm sorry.", "I guess you were right about the therapist.", "Yeah, well, that's nice of you to say, Charles,", "but actually, when I was stalling Dr. Tate,", "I started talking about my parents' divorce,", "and it felt really good.", "I can't believe I'm gonna say this, but...", "I think I'm gonna make an appointment with a shrink.", "Jake, that is so great.", "And I know a guy who's really good.", "You will love having him inside of you.", "Okay.", "What? Oh, come on, mister. Grow up.", "Get your mind out of the gutter, ya perv!"]